{
  "info": {
    "authors": [
      "Philip Blunsom",
      "Trevor Cohn"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1028",
    "title": "Inducing Synchronous Grammars with Slice Sampling",
    "url": "https://aclweb.org/anthology/N10-1028",
    "year": 2010
  },
  "references": [
    "acl-D08-1033",
    "acl-J97-3002",
    "acl-N03-1017",
    "acl-N07-1018",
    "acl-P07-2045",
    "acl-P09-1088",
    "acl-W02-1018",
    "acl-W07-0403"
  ],
  "sections": [
    {
      "text": [
        "Phil Blunsom",
        "This paper describes an efficient sampler for synchronous grammar induction under a non-parametric Bayesian prior.",
        "Inspired by ideas from slice sampling, our sampler is able to draw samples from the posterior distributions of models for which the standard dynamic programing based sampler proves intractable on non-trivial corpora.",
        "We compare our sampler to a previously proposed Gibbs sampler and demonstrate strong improvements in terms of both training log-likelihood and performance on an end-to-end translation evaluation."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Intractable optimisation algorithms abound in much of the recent work in Natural Language Processing.",
        "In fact, there is an increasing acceptance that solutions to many of the great challenges of NLP (e.g. machine translation, summarisation, question answering) will rest on the quality of approximate inference.",
        "In this work we tackle this problem in the context of inducing synchronous grammars for a machine translation system.",
        "We concern ourselves with the lack of a principled, and scalable, algorithm for learning a synchronous context free grammar (SCFG) from sentence-aligned parallel corpora.",
        "The predominant approach for learning phrase-based translation models (both finite state or synchronous grammar based) uses a cascade of heuristics beginning with predicted word alignments and producing a weighted set of translation rules (Koehn et al., 2003).",
        "Alternative approaches avoid such heuristics, instead learning structured alignment models directly from sentence aligned data (e.g., (Marcu and Wong, 2002; Cherry and Lin, 2007; DeNero et al., 2008; Blunsom et al., 2009)).",
        "Although these models are theoretically attractive, inference is intractable (at least O(|f||e|)).",
        "The efficacy of direct estimation of structured alignment models therefore rests on the approximations used to make inference practicable - typically heuristic constraints or Gibbs sampling.",
        "In this work we show that naive Gibbs sampling (specifically, Blunsom et al.",
        "(2009)) is ineffectual for inference and reliant on a high quality initialisation, mixing very slowly and being easily caught in modes.",
        "Instead, blocked sampling over sentence pairs allows much faster mixing, but done in the obvious way (following Johnson et al.",
        "(2007)) would incur a O(|f |1e|) time complexity.",
        "Here we draw inspiration from the work of Van Gael et al.",
        "(2008) on inference in infinite hidden Markov models to develop a novel algorithm for efficient sampling from a SCFG.",
        "We develop an auxiliary variable 'slice' sampler which can dramatically reduce inference complexity, and thereby make blocked sampling practicable on real translation corpora.",
        "Our evaluation demonstrates that our algorithm mixes more quickly than the local Gibbs sampler, and produces translation models which achieve state-of-the-art BLEU scores without using GIZA++ or sym-metrisation heuristics for initialisation.",
        "We adopt the generative model of Blunsom et al.",
        "(2009) which creates a parallel sentence pair by a sequence (derivation) of SCFG productions d = (n, r2,rn).",
        "The tokens in each language can be read off the leaves of the derivation tree while their order is defined hierarchically by the productions in use.",
        "The probability of a derivation is defined as p(d|9) =Y[red 9r where 9 are the model parameters which are drawn from a Bayesian prior.",
        "We deviate from that models definition of the prior over phrasal translations, instead adopting the hierarchical Dirichlet process prior from DeNero et al.",
        "(2008), which incorporates IBM Model 1.",
        "Blunsom et al.",
        "(2009) describe a blocked sampler following Johnson et al.",
        "(2007) which uses the Metropolis-Hastings algorithm to correct proposal samples drawn from an approximating SCFG, however this is discounted as impractical due to the complexity.",
        "Instead a Gibbs sampler is used which samples local updates to the derivation structure of each training instance.",
        "This avoids the dynamic program of the blocked sampler but at the expense of considerably slower mixing.",
        "Recently Bouchard-Cote et al.",
        "(2009) proposed an auxialliary variable sampler, possibly complementary to ours, which was also evaluated on synchronous parsing.",
        "Rather than slice sampling derivations in a collapsed Bayesian model, this model employed a secondary proposal model (IBM Models) and sampled expectations over rule parameters."
      ]
    },
    {
      "heading": "2. Slice Sampling a SCFG",
      "text": [
        "It would be advantageous to explore a middle ground where the scope ofthe dynamic program is limited to high probability regions, reducing the running time to an acceptable level.",
        "By employing the technique of slice sampling (Neal, 2003) we describe an algorithm which stochastically samples from a reduced space of possible derivations, while ensuring that these samples are drawn from the correct distribution.",
        "We apply the slice sampler to the approximating SCFG parameterised by 6, which requires samples from an inside chart p(d|6) (for brevity, we omit the dependency on 6 in the following).",
        "Slice sampling is an example of auxiliary variable sampling in which we make use of the fact that if we can draw samples from a joint distribution, then we can trivially obtain samples from the marginal distributions: p(d) = u P(d, u), where d is the variable of interest and u is an auxiliary variable.",
        "Using a Gibbs sampler we can draw samples from this joint distribution by alternately sampling from p(d| u) and p(u| d).",
        "The trick is to ensure that u is defined such that drawing samples from p(d|u) is more efficient than from p(d).",
        "We define the variable u to contain a slice variable us for every cell of a synchronous parse chart for every training instance:",
        "These slice variables act as cutoffs on the probabilities of the rules considered in each cell s: rule applications rs with 6rs < us will be pruned from the dynamic program.",
        "Sampling p(u|d) Unlike Van Gael et al.",
        "(2008), there is not a one-to-one correspondence between the spans of the rules in d and the set S, rather the derivation's rule spans form a subset of S. This complicates our definition of p(u| d) ; we must provide separate accounts of how each us is generated depending on whether there is a corresponding rule for s, i.e., rs G d. We definep(u|d) = TJsp(us|d), where:",
        "which mixes a uniform distribution and a Beta distribution depending on the existence of a rulers in the derivation d. Eq.",
        "1 is constructed such that only rules with probability greater than the relevant threshold, {rs | 6rs > us}, could have feasibly been part of a derivation resulting in auxiliary variable u.",
        "This is critical in reasoning over the reverse conditional p(d|u) which only has to consider the reduced space of rules (formulation below in (4)).",
        "Trivially, the conditioning derivation is recoverable, Vrs G d, 6rs > us.",
        "We parameterise the ß distribution in (1) with a heavy skew towards zero in order to limit the amount of pruning and thereby include many competing derivations.",
        "Sampling p(d| u) Recall the probability of a derivation, p(d) = TJr^d 6rs.",
        "We draw samples from the joint distribution, p(d, u), holding u fixed:",
        "In step (2) we cancel the 6rs terms while in step (3) we introduce ß(us; a, b) terms to the numerator and denominator for us : rs G d to simplify the range of the second product.",
        "The last step (4) discards the term f]Us ß(us; a, b) which is constant wrt d. The net result is a formulation which factors with the derivation structure, thereby eliminating the need to consider all O(|e||f |) spans in S. Critically p(d|u) is zero for all spans failing the I (us < 6rs ) condition.",
        "To exploit the decomposition of Equation 4 we require a parsing algorithm that only explores chart cells whose child cells have not already been pruned by the slice variables.",
        "The standard approach of using synchronous CYK (Wu, 1997) doesn't posses this property: all chart cells would be visited even if they are to be pruned.",
        "Instead we use an agenda based parsing algorithm, in particular we extend the algorithm of Klein and Manning (2004) to synchronous parsing.",
        "Finally, we need a Metropolis-Hastings acceptance step to account for intra-instance dependencies (the 'rich-get-richer' effect).",
        "We omit the details, save to state that the calculation cancels to the same test as presented in Johnson et al.",
        "(2007)."
      ]
    },
    {
      "heading": "3. Evaluation",
      "text": [
        "In the following experiments we compare the slice sampler and the Gibbs sampler (Blunsom et al., 2009), in terms of mixing and translation quality.",
        "We measure mixing in terms of training log-likelihood (LLH) after a fixed number of sampling iterations.",
        "Translations are produced using Moses (Koehn et al., 2007), initialised with the word alignments from the final sample, and are evaluated using BLEU(Papineni et al., 2001).",
        "The slice sampled models are restricted to learning binary branching one-to-one (or null) alignments, while no restriction is placed on the Gibbs sampler (both use the same model, so have comparable LLH).",
        "Of particular interest is how the different samplers perform given initialisations of varying quality.",
        "We evaluate three initialisers: M4: the symmetrised output of GIZA++ factorised into ITG form (as used in Blunsom et al.",
        "(2009)); M1: the output of a heavily pruned ITG parser using the IBM Model 1 prior for the rule probabilities; and LB: left-branching monotone derivations.",
        "We experiment with the Chinese ^English translation task from IWSLT, as used in Blunsom et al.",
        "(2009).",
        "Figure 1 shows LLH curves for the samplers initialised with the M1 and LB derivations, plus the curve for Gibbs sampler with the M4 initialiser.Table 1 gives BLEU scores on Test-05 for phrase-based translation models built from the 1500th sample for the various models along with the average time per sample and their final log-likelihood."
      ]
    },
    {
      "heading": "4. Discussion",
      "text": [
        "The results are particularly encouraging.",
        "The slice sampler uniformly finds much better solutions than the Gibbs sampler regardless of initialisation.",
        "In particular, the slice sampled model initialised with the naive LB structure achieves a higher likelihood than the M4 initialised model, although this is not reflected in their relative Bleu scores.",
        "In contrast the Gibbs sampler is more significantly affected by its initialisation, only deviating slightly before becoming trapped in a mode, as seen in Fig. 1.",
        "With sufficient (infinite) time both sampling strategies will converge on the true posterior regardless of initialisation, however the slice sampler appears to be converging much faster than the Gibbs sampler.",
        "Interestingly, the initialisation heuristics (M1 and M4) outperform the default heuristics (Koehn et al., 2007) by a considerable margin.",
        "This is most likely because the initialisation heuristics force the alignments to factorise with an ITG, resulting in more aggressive pruning of spurious alignments which in turn allows for more and larger phrase pairs.",
        "System",
        "Bleu",
        "time(s)",
        "LLH",
        "Moses (default settings)",
        "47.3",
        "-",
        "-",
        "LB init.",
        "36.5",
        "-",
        "-257.1",
        "M1 init.",
        "48.8",
        "-",
        "-153.4",
        "M4 init.",
        "49.1",
        "-",
        "-151.4",
        "Gibbs LB init.",
        "45.3",
        "44",
        "-135.4",
        "Gibbs M1 init.",
        "48.2",
        "40",
        "-120.5",
        "Gibbs M4 init.",
        "(Blunsom et al., 2009)",
        "49.6",
        "44",
        "-110.3",
        "Slice (a=0.15, b=1)LB init.",
        "47.3",
        "180",
        "-98.9",
        "Slice (a=0.10, b=1)M1 init.",
        "50.4",
        "908",
        "-89.4",
        "Slice (a=0.15, b=1)M1 init.",
        "49.9",
        "144",
        "-90.2",
        "Slice (a=0.25, b=1) M1 init.",
        "49.2",
        "80",
        "-95.6",
        "While the LLHs for the slice sampled models and their Bleu scores appear correlated, this doesn't extend to comparisons with the Gibbs sampled models.",
        "We believe that this is because the GIZA++ initialisation alignments also explain the data well, while not necessarily obtaining a high LLH under the ITG model.",
        "Solutions which score highly in one model score poorly in the other, despite both producing good translations.",
        "The slice sampler is slower than the local Gibbs sampler, its speed depending on the parameterisation of the Beta distribution (affecting the width of the beam).",
        "In the extreme, exhaustive search using the full dynamic program is intractable on current hard-ware, and therefore we have achieved our aim of mediating between local and blocked inference.",
        "This investigation has established the promise of the SCFG slice sampling technique to provide a scalable inference algorithm for non-parametric Bayesian models.",
        "With further development, this work could provide the basis for a family of principled inference algorithms for parsing models, both monolingual and synchronous, and other models that prove intractable for exact dynamic programming.",
        "/ - / '___",
        " – Slice (a=0.10 b=1) M1",
        "-■- Slice (a=0.15 b=1) M1",
        "---Slice (a=0.20 b=1) M1",
        "-- Slice (a=0.25 b=1) M1",
        "---- Gibbs M1",
        "1 r/J",
        "- Gibbs M4"
      ]
    }
  ]
}
