{
  "info": {
    "authors": [
      "Stefan Evert"
    ],
    "book": "NAACL HLT 2010 Tutorial Abstracts",
    "id": "acl-N10-4006",
    "title": "Distributional Semantic Models",
    "url": "https://aclweb.org/anthology/N10-4006",
    "year": 2010
  },
  "references": [
    "acl-D09-1065",
    "acl-E95-1020",
    "acl-J06-3003",
    "acl-J98-1004",
    "acl-P00-1014",
    "acl-P98-2127",
    "acl-P99-1067"
  ],
  "sections": [
    {
      "text": [
        "Distributional Semantic Models Stefan Evert, University of Osnabrück",
        "1.",
        "DESCRIPTION"
      ]
    },
    {
      "heading": null,
      "text": [
        "Distributional semantic models (DSM) -- also known as \"word space\" or \"distributional similarity\" models -- are based on the assumption that the meaning of a word can (at least to a certain extent) be inferred from its usage, i.e. its distribution in text.",
        "Therefore, these models dynamically build semantic representations -- in the form of high-dimensional vector spaces -- through a statistical analysis of the contexts in which words occur.",
        "DSMs are a promising technique for solving the lexical acquisition bottleneck by unsupervised learning, and their distributed representation provides a cognitively plausible, robust and flexible architecture for the organisation and processing of semantic information.",
        "Since the seminal papers of Landauer & Dumais (1997) and Schütze (1998), DSMs have been an active area of research in computational linguistics.",
        "Amongst many other tasks, they have been applied to solving the TOEFL synonym test (Landauer & Dumais 1997, Rapp 2004), automatic thesaurus construction (Lin 1998), identification of translation equivalents (Rapp 1999), word sense induction and discrimination (Schütze 1998), POS induction (Schütze 1995), identification of analogical relations (Turney 2006), PP attachment disambiguation (Pantel & Lin 2000), semantic classification (Versley 2008), as well as the prediction of fMRI (Mitchell et al.",
        "2008) and EEG (Murphy et al.",
        "2009) data.",
        "Recent years have seen renewed and rapidly growing interest in distributional approaches, as shown by the series of workshops on DSM held at Context 2007 [1], ESSLLI 2008 [2], EACL 2009 [3], CogSci 2009 [4], NAACL-HLT 2010 [5], ACL 2010 [6] and ESSLLI 2010 [7].",
        "The proposed tutorial aims to - introduce the most common DSM architectures and their parameters, as well as prototypical applications; - equip participants with the mathematical techniques needed for the implementation of DSMs, in particular those of matrix algebra; - illustrate visualisation techniques and mathematical arguments that help in understanding the high-dimensional DSM vector spaces and making sense of key operations such as SVD dimensionality reduction; and - provide an overview of current research on DSMs, available software, evaluation tasks and future trends.",
        "The tutorial is targeted both at participants who are new to the field and need a comprehensive overview of DSM techniques and applications, and at experienced scientists who want to get up to speed on current directions in DSM research.",
        "An implementation of all methods presented in the tutorial will be provided as supplementary material, using the open-source statistical programming language R [8].",
        "This implementation, which is based on the code and data sets available at [9], is intended as a \"toy laboratory\" for participants, but can also form a sound basis for practical applications and further DSM research."
      ]
    },
    {
      "heading": "2.. TUTORIAL OUTLINE",
      "text": [
        "1) Introduction",
        "- motivation and brief history of distributional semantics - common DSM architectures - prototypical applications - concrete examples used in the tutorial - size and type of context window - feature scaling (tf.2) Taxonomy of DSM parameters including",
        "idf, statistical association measures, ... ) - normalisation and standardisation of rows and/or columns",
        "- distance/similarity measures: Euclidean, Minkowski p-norms, cosine, entropy-based, ...",
        "- dimensionality reduction: feature selection, SVD, random indexing (RI) - basic matrix and vector operations - norms and distances, angles, orthogonality - projection and dimensionality reduction - nearest neighbours and clustering - semantic maps:3) Elements of matrix algebra for DSM",
        "4) Making sense of DSMs: mathematical analysis and visualisation techniques",
        "PCA, MDS, SOM - visualisation of high-dimensional spaces - supervised classification based on DSM vectors - understanding dimensionality reduction with SVD and RI - term-term vs. term-context matrix, connection to first-order association - SVD as a latent class model - overview of current research on DSMs - evaluation tasks and data sets - available \"off-the-shelf\" DSM software - limitations and key problems of DSMs - trends for future work5) Current research topics and future directions",
        "Each of the five parts will be compressed into a slot of roughly 30 minutes, leaving a 30-minute coffee break.",
        "In order to cover the large amount of material in a relatively short time, the discussion of mathematical and implementational aspects will aim primarily at an intuitive understanding of key issues and skip technical details.",
        "Full descriptions are provided as part of the handouts and supplementary material, esp.",
        "the thoroughly commented R implementation."
      ]
    },
    {
      "heading": "3.. INSTRUCTOR",
      "text": [
        "Stefan Evert",
        "Juniorprofessor of Computational Linguistics University of Osnabrück, Germany",
        "Stefan Evert has studied mathematics, physics and English linguistics, and holds a PhD degree in computational linguistics.",
        "His research interests include the statistical analysis of corpus frequency data (significance tests in corpus linguistics, statistical association measures, Zipf's law and word frequency distributions), quantitative approaches to lexical semantics (collocations, multiword expressions and DSM), as well as processing large text corpora (IMS Open Corpus Workbench, data model and query language of the Nite XML Toolkit, tools for the Web as corpus).",
        "Stefan Evert has published extensively on collocations and association measures, has co-organised several workshops on multiword expressions as well as the ESSLLI 2008 workshop on distributional lexical semantics, and has co-taught an advanced course on DSM at ESSLLI 2009 with Alessandro Lenci, as well as a course on Computational Lexical Semantics with Gemma Boleda.",
        "The main focus of his current research is on understanding and improving DSMs for applications in natural language processing and lexical semantics.",
        "[1] http://clic.cimec.unitn.it/marco/beyond words/ [2] http://wordspace.collocations.de/doku.php/esslli:start [5] http://sites.google.com/site/compneurowsnaacl10/ [7] http://clic.cimec.unitn.it/roberto/ESSLLI10-dsm-workshop/ [8] http://www.R-project.org/ [9] http://wordspace.collocations.de/doku.php/course:schedule"
      ]
    }
  ]
}
