{
  "info": {
    "authors": [
      "Philippe de Groote",
      "Ekaterina Lebedeva"
    ],
    "book": "Proceedings of the SIGDIAL 2010 Conference",
    "id": "acl-W10-4313",
    "title": "Presupposition Accommodation as Exception Handling",
    "url": "https://aclweb.org/anthology/W10-4313",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Van der Sandt's algorithm for handling presupposition is based on a \"presupposition as anaphora\" paradigm and is expressed in the realm of Kamp's DRT.",
        "In recent years, we have proposed a type-theoretic rebuilding of DRT that allows Montague's semantics to be combined with discourse dynamics.",
        "Here we explore van der Sandt's theory along the line of this formal framework.",
        "It then results that presupposition handling may be expressed in a purely Montagovian setting, and that presupposition accommodation amounts to exception handling."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Montague (1970) argued that there is no essential difference between natural and mathematical languages.",
        "He developed a theory that assigns a lambda-term for each lexical item, and the meaning of a whole sentence could be obtained by composing the lambda-terms via functional application.",
        "However, his theory was limited to single sentences.",
        "De Groote (2006) extends Montague's framework with a continuation-passing-style technique, developing a framework that is dynamic in a sense reminiscent of Dynamic Predicate Logic (Groenendijk and Stokhof, 1991).",
        "While Montague's semantics is based on Church's (1940) simple type theory and has only two atomic types (i, the type of individuals; and o, the type of propositions), de Groote (2006) adds an atomic type y representing the type of the environment.",
        "For each lambda-term the continuation is what is still to be processed, and its type is y – o.",
        "Since anaphoric expressions are known to be similar to presuppositional expressions (van der Sandt, 1992), it is natural to ask whether our type-theoretic framework can be extended to handle presuppositions.",
        "The goal of this paper is to answer this question positively, at least in the case of presuppositions triggered by definite descriptions.",
        "To achieve this goal y will not be defined simply as a list of individuals, but as a list of individuals together with their properties."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "Van der Sandt (1992) argues that presuppositions and anaphors display similar behavior: they primarily have to be bound to some antecedent previously introduced in the discourse.",
        "Therefore, they can be treated by similar mechanisms.",
        "He implements his ideas in DRT (Kamp and Reyle, 1993) in such a way that for each new sentence a provisional DRS encoding possible anaphoric elements is constructed.",
        "This provisional DRS is then merged with the main DRS, and the presupposi-tional anaphors are resolved in accordance with certain pragmatic constraints, so that presuppositions can be accommodated when lacking a suitable antecedent.",
        "Geurts (1999) proposes an improvement of van der Sandt's theory, called the binding theory, according to which anaphora is a kind of presupposition.",
        "Therefore, presuppositions triggered by pronouns and definite descriptions can also be accommodated: a referent is introduced with a poor descriptive content and the descriptive content can be enhanced as the discourse unfolds.",
        "Moreover, according to the presuppositional version of the quotation theory of names (Kneale, 1962), names (e.g. John) are synonymous with definite noun phrases of the form \"the individual named John\".",
        "Hence, presuppositions triggered by names and by definite descriptions can be handled similarly.",
        "De Groote's (2006) dynamic theory provides some improvement over classical DRT.",
        "It allows the representations of sentence and discourse to be built from the lexical items in the spirit of Montague.",
        "It provides reference marker renaming for",
        "Special Interest Group on Discourse and Dialogue, pages 71-74, ©2010 Association for Computational Linguistics",
        "free and may be implemented using well established techniques.",
        "We claim that Geurts' binding theory can be incorporated into this framework, providing a fully compositional treatment of definite descriptions."
      ]
    },
    {
      "heading": "3. Presupposition in Dynamic Theory",
      "text": [
        "We focus here on presuppositions triggered by definite descriptions, particularly by proper names, pronouns and possessive noun phrases.",
        "Imagine that somebody is about to tell a new story and the first sentence of this story is (1).",
        "This story is about John.",
        "(1)",
        "If the listener does not know John, he or she will immediately imagine a person named \"John\" and memorize it.",
        "In other words, the listener will accommodate the presuppositional content triggered by the proper name John in the following way: he or she will create a slot in the environment, which is some unit representing the knowledge about John, and put there what was just learned about John.",
        "Therefore, the listener will be able to refer to the created slot representing John as the discourse evolves.",
        "Moreover, the slot for John will be different from other slots, i.e. it will have some identity marker, which we call, following Kart-tunen (1976), reference marker or simply referent.",
        "There is a direct analogy between memory slots introduced above and Heim's (1982; 1983) file cards: they are both aimed to store what has been learned about some individual.",
        "Let j be the referent for John and assume that sentence (1) is followed by sentence (2).",
        "John loves Mary.",
        "(2)",
        "Mary is a new individual in the discourse and therefore Mary will be accommodated introducing a reference marker m exactly as it happened for John after the utterance of (1).",
        "The story is different for John now.",
        "The listener already has a representation standing for John in the environment, and he or she just has to turn to the corresponding slot (select the marker in the environment) and update the slot with the new information that John loves Mary (bind John from (2) to the referent j).",
        "To encode, following Montague's legacy, the observations discussed above as lambda-terms, we first define a selection function sel as a function taking two arguments: a property and an environment; and returning a reference marker:",
        "According to Montague, proper names can be interpreted as type-raised individuals, thus the lambda-term standing for John in Montague's semantics is (4), where j is a constant.",
        "In the dynamic interpretation, instead of the constant j we would like to have a referent corresponding to John.",
        "For this, we attempt to select such a referent given a property of being named John, as shown in (5).",
        "Whether the selection of the marker for John succeeds depends on the current environment.",
        "Hence, instead of using Montague's individuals (i.e. of type i) directly, we use individuals parameterized by the environment (i.e. having type (y – i)).",
        "Noun phrases are regarded as having type (6), which is analogous to the type for noun phrases (7) given by Montague, i.e. a noun phrase is interpreted by a lambda-term that accepts a property and returns a proposition.",
        "The only difference is that now individuals are always parameterized by an environment, and propositions are dynamic, i.e. they have type Q that is defined as y – (y – o) – o.",
        "Pronouns are also presupposition triggers.",
        "It can be seen in the case of cataphora, such as, for example, in sentence (8), where in the first part of the sentence the pronoun he introduces an individual.",
        "Since pronouns have poorer descriptive content than proper names and they have the type of noun phrases (6), they are represented by lambda-terms that are at most as complex as the terms for proper names.",
        "The term for the pronoun he is shown in (9), which expresses an attempt to select a human individual having masculine gender.",
        "When he woke up, Tom felt better.",
        "(8)",
        "If the sentence (8) is uttered in a discourse that does not provide a suitable referent, the presupposition trigerred by he will be accommodated (as it happened for John in (1) and for Mary in (2)).",
        "The presuppositional anaphora trigerred by Tom in the second part of the sentence could be successfully bound to the introduced referent.",
        "Consider the sentence (10), where we have a possessive noun phrase John's car triggering a presupposition that there is a car owned by John.",
        "The desired interpretation of John's car is shown in (11), which requires a search in the environment for a referent having the property of being a car possessed by John.",
        "The embedded presupposition is encoded via a selection function (for the inner presupposition triggered by John) embedded into another selection function (for the outer presupposition related to car).",
        "However, we would like to express John's car compositionally in terms of its constituents.",
        "To do so, we define a term (12) taking two arguments a noun phrase standing for a possessor and a noun standing for an object being possessed, and returning a noun phrase in form of (11).",
        "A is a dynamic conjunction having type (13) and defined in (14).",
        "The term poss]] in (12) is a usual dynamic two-arguments predicate, its lambda-term is shown in (15).",
        "SEL is a higher-order selection function.",
        "It has the same designation as (3), with the only difference that it functions on the level of dynamic propositions.",
        "Thus, the type of SEL is (16) and it is analogous to the type of sel spelled in (3).",
        "Moreover, SEL is defined via sel, and the corresponding lambda-term is presented in (17).",
        "If we apply the term [['s]] to the term (5) for John and the term (18) for car, which is just a dynamic unary predicate, we will get the desired result (11).",
        "Sometimes an anaphora wants to be bound, even though no referent was introduced explicitly, as in (19).",
        "Already after the first sentence, a listener will learn that John has a wife, i.e. introduce a new referent.",
        "The presuppositional anaphora triggerred by the possessive noun phrase his wife in the second sentence will be bound to this referent.",
        "John is married.",
        "His wife is beautiful.",
        "(19)",
        "This case can be accounted with the lexical interpretation in (20) for being married, which is defined by a two-arguments relation is_married.",
        "The first argument of the relation is the argument x being passed to the lexical interpretation.",
        "The second argument is an individual selected from the environment given the property of being either the wife or the husband of x.",
        "[isjnarried] =",
        "A discourse is updated by appending the next sentence, as shown in equation (21).",
        "A sentence is defined as a term having the type of a dynamic proposition, i.e. its type is (22), while a discourse is defined as a term having the type of a dynamic proposition evaluated over the environment, i.e its type is (23).",
        "A discourse D updated with a sentence S results in a term having type (23), thus it has one parameter <p of type (y – o).",
        "The body must be a term, of type o, contributed by D. D itself is a term of type (23).",
        "Therefore, it must be given a continuation as an argument constructed with S and its continuation.",
        "However, during the computation of A<p.D(Ae.Se<p) one of the selection functions can raise an exception containing a message that a referent having some property Q was not found in the environment.",
        "The exception will be catched and the property will be returned to the exception handler.",
        "The handler will have to introduce a referent having the property Q into the representation of the discourse, add this referent to the environment, and call the update function passing to it the amended interpretation of the discourse and the sentence S as parameters.",
        "This can be encoded using an exception handling mechanism as shown in (24) for global accommodation.",
        "Note that the definition of discourse update is recursive.",
        "The environment is defined as a list of pairs \"referent X proposition\" (25).",
        "The two-place list constructor :: appends a referent together with the corresponding propositions into the environment, therefore it has the type shown in (26).",
        "The selection function sel can implement any anaphora resolution algorithm, and hence our framework is not confined to any of them.",
        "Considering that the lambda-term for Mary is similar to (5) and the lambda-term for the transitive verb love is (27), the interpretation for the sentence (2) after beta-reductions will be (28).",
        "After the sentence (1), the lambda-term representing discourse will be (29).",
        "After the sentence (2), the lambda-term D1 in (29) will have to be updated with the term S2 in (28) as it is defined by the function (24).",
        "Since we have a referent for John in the environment of D1, it will be successfuly selected and John from S2 will get bound to it.",
        "However, there will be a failure for Mary, particularly on the property (named \"Mary\") since there is no corresponding referent in D1 yet.",
        "The failure will be handled by accommodating Mary and introducing the sentence S2 into the amended interpretation of the discourse, which results in the term shown in (30)."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "We showed that de Groote's (2006) dynamic framework can be applied to presuppositions triggered by definite descriptions, such as proper names, possessive noun phrases and pronouns; and that the exception handling mechanisms offer a proper way of modeling the dynamics of presupposition.",
        "Other presuppositional expressions, such as, for example, factives and aspectual verbs, will require more technicalities.",
        "Nevertheless, we believe that the approach can be extended to encompass a general theory of presupposition and we intend to address this in future work.",
        "Acknowledgements: We thank the anonymous reviewers for their useful comments."
      ]
    }
  ]
}
