{
  "info": {
    "authors": [
      "Julia Hockenmaier",
      "Yusuke Miyao",
      "Josef van Genabith"
    ],
    "book": "Tutorial Abstracts of ACL 2010",
    "id": "acl-P10-5001",
    "title": "Wide-Coverage NLP with Linguistically Expressive Grammars",
    "url": "https://aclweb.org/anthology/P10-5001",
    "year": 2010
  },
  "references": [
    "acl-J07-3004",
    "acl-J08-1002",
    "acl-J08-1003"
  ],
  "sections": [
    {
      "text": [
        "Wide-coverage NLP with Linguistically Expressive Grammars",
        "National Institute of Informatics",
        "Centre for Next Generation Localisation, School of Computing, Dublin City University",
        "josef@computing.dcu.ie",
        "1 Introduction",
        "In recent years, there has been a lot of research on wide-coverage statistical natural language processing with linguistically expressive grammars such as Combinatory Categorial Grammars (CCG), Head-driven Phrase-Structure Grammars (HPSG), Lexical-Functional Grammars (LFG) and Tree-Adjoining Grammars (TAG).",
        "But although many young researchers in natural language processing are very well trained in machine learning and statistical methods, they often lack the necessary background to understand the linguistic motivation behind these formalisms.",
        "Furthermore, in many linguistics departments, syntax is still taught from a purely Chomskian perspective.",
        "Additionally, research on these formalisms often takes place within tightly-knit, formalism-specific subcommunities.",
        "It is therefore often difficult for outsiders as well as experts to grasp the commonalities of and differences between these formalisms."
      ]
    },
    {
      "heading": "2. Content Overview",
      "text": [
        "second half of the tutorial, we explain two key technologies for wide-coverage NLP with these grammar formalisms: grammar acquisition and parsing models.",
        "Finally, we show NLP applications where these expressive grammar formalisms provide additional benefits."
      ]
    },
    {
      "heading": "3. Tutorial Outline",
      "text": []
    },
    {
      "heading": "1.. Introduction: Why expressive grammars",
      "text": []
    },
    {
      "heading": "2.. Introduction to TAG",
      "text": []
    },
    {
      "heading": "3.. Introduction to CCG",
      "text": []
    },
    {
      "heading": "4.. Introduction to LFG",
      "text": []
    },
    {
      "heading": "5.. Introduction to HPSG",
      "text": []
    },
    {
      "heading": "6.. Inducing expressive grammars from corpora",
      "text": []
    },
    {
      "heading": "7.. Wide-coverage parsing with expressive grammars",
      "text": []
    },
    {
      "heading": "8.. Applications",
      "text": []
    },
    {
      "heading": "9.. Summary",
      "text": [
        "This tutorial overviews basic ideas of TAG/ CCG/LFG/HPSG, and provides attendees with a comparison of these formalisms from a linguistic and computational point of view.",
        "We start from stating the motivation behind using these expressive grammar formalisms for NLP, contrasting them with shallow formalisms like context-free grammars.",
        "We introduce a common set of examples illustrating various linguistic constructions that elude context-free grammars, and reuse them when introducing each formalism: bounded and unbounded non-local dependencies that arise through extraction and coordination, scrambling, mappings to meaning representations, etc.",
        "In the"
      ]
    }
  ]
}
