{
  "info": {
    "authors": [
      "Shaojun Zhao",
      "Daniel Gildea"
    ],
    "book": "EMNLP",
    "id": "acl-D10-1058",
    "title": "A Fast Fertility Hidden Markov Model for Word Alignment Using MCMC",
    "url": "https://aclweb.org/anthology/D10-1058",
    "year": 2010
  },
  "references": [
    "acl-C96-2141",
    "acl-D08-1033",
    "acl-H05-1022",
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-J97-3002",
    "acl-P02-1040",
    "acl-P03-1012",
    "acl-P04-1066",
    "acl-P07-2045",
    "acl-W02-1012"
  ],
  "sections": [
    {
      "text": [
        "Shaojun Zhao and Daniel Gildea",
        "A word in one language can be translated to zero, one, or several words in other languages.",
        "Using word fertility features has been shown to be useful in building word alignment models for statistical machine translation.",
        "We built a fertility hidden Markov model by adding fertility to the hidden Markov model.",
        "This model not only achieves lower alignment error rate than the hidden Markov model, but also runs faster.",
        "It is similar in some ways to IBM Model 4, but is much easier to understand.",
        "We use Gibbs sampling for parameter estimation, which is more principled than the neighborhood method used in IBM Model 4."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "IBM models and the hidden Markov model (HMM) for word alignment are the most influential statistical word alignment models (Brown et al., 1993; Vogel et al., 1996; Och and Ney, 2003).",
        "There are three kinds of important information for word alignment models: lexicality, locality and fertility.",
        "IBM Model 1 uses only lexical information; IBM Model 2 and the hidden Markov model take advantage of both lexical and locality information; IBM Models 4 and 5 use all three kinds of information, and they remain the state of the art despite the fact that they were developed almost two decades ago.",
        "Recent experiments on large datasets have shown that the performance of the hidden Markov model is very close to IBM Model 4.",
        "Nevertheless, we believe that IBM Model 4 is essentially a better model because it exploits the fertility of words in the target language.",
        "However, IBM Model 4 is so complex that most researches use the GIZA++ software package (Och and Ney, 2003), and IBM Model 4 itself is treated as a black box.",
        "The complexity in IBM Model 4 makes it hard to understand and to improve.",
        "Our goal is to build a model that includes lexicality, locality, and fertility; and, at the same time, to make it easy to understand.",
        "We also want it to be accurate and computationally efficient.",
        "There have been many years of research on word alignment.",
        "Our work is different from others in essential ways.",
        "Most other researchers take either the HMM alignments (Liang et al., 2006) or IBM Model 4 alignments (Cherry and Lin, 2003) as input and perform post-processing, whereas our model is a potential replacement for the HMM and IBM Model 4.",
        "Directly modeling fertility makes our model fundamentally different from others.",
        "Most models have limited ability to model fertility.",
        "Liang et al.",
        "(2006) learn the alignment in both translation directions jointly, essentially pushing the fertility towards 1.",
        "ITG models (Wu, 1997) assume the fertility to be either zero or one.",
        "It can model phrases, but the phrase has to be contiguous.",
        "There have been works that try to simulate fertility using the hidden Markov model (Toutanova et al., 2002; Deng and Byrne, 2005), but we prefer to model fertility directly.",
        "Our model is a coherent generative model that combines the HMM and IBM Model 4.",
        "It is easier to understand than IBM Model 4 (see Section 3).",
        "Our model also removes several undesired properties in IBM Model 4.",
        "We use Gibbs sampling instead of a heuristic-based neighborhood method for parameter estimation.",
        "Our distortion parameters are similar to",
        "IBM Model 2 and the HMM, while IBM Model 4 uses inverse distortion (Brown et al., 1993).",
        "Our model assumes that fertility follows a Poisson distribution, while IBM Model 4 assumes a multinomial distribution, and has to learn a much larger number of parameters, which makes it slower and less reliable.",
        "Our model is much faster than IBM Model 4.",
        "In fact, we will show that it is also faster than the HMM, and has lower alignment error rate than the",
        "HMM.",
        "Parameter estimation for word alignment models that model fertility is more difficult than for models without fertility.",
        "Brown et al.",
        "(1993) and Och and Ney (2003) first compute the Viterbi alignments for simpler models, then consider only some neighbors of the Viterbi alignments for modeling fertility.",
        "If the optimal alignment is not in those neighbors, this method will not be able find the optimal alignment.",
        "We use the Markov Chain Monte Carlo (MCMC) method for training and decoding, which has nice probabilistic guarantees.",
        "DeNero et al.",
        "(2008) applied the Markov Chain Monte Carlo method to word alignment for machine translation; they do not model word fertility."
      ]
    },
    {
      "heading": "2. Statistical Word Alignment Models",
      "text": [
        "Given a source sentence fJ = f1, f2,..., fj and a target sentence e{ = ei, e2,..., ej, we define the alignments between the two sentences as a subset of the Cartesian product of the word positions.",
        "Following Brown et al.",
        "(1993), we assume that each source word is aligned to exactly one target word.",
        "We denote as aJ = a1,a2,... ,aJ the alignments between fJ and e{.",
        "When a word fj is not aligned with any word e, aj is 0.",
        "For convenience, we add an empty word e to the target sentence at position 0 (i.e., eo = e).",
        "However, as we will see, we have to add more than one empty word for the HMM.",
        "In order to compute the \"jump probability\" in the HMM model, we need to know the position of the aligned target word for the previous source word.",
        "If the previous source word aligns to an empty word, we could use the position of the empty word to indicate the nearest previous source word that does not align to an empty word.",
        "For this reason, we use a total of I + 1 empty words for the HMM model.",
        "Moore (2004) also suggested adding multiple empty words to the target sentence for IBM Model 1.",
        "After we add I + 1 empty words to the target sentence, the alignment is a mapping from source to target word positions:",
        "where j = 1,2,..., J and i = 1,2,..., 2I + 1.",
        "Words from position I + 1 to 2I +1 in the target sentence are all empty words.",
        "We allow each source word to align with exactly one target word, but each target word may align with multiple source words.",
        "The fertility fa of a word ei at position i is defined as the number of aligned source words:",
        "where ö is the Kronecker delta function:",
        "ö(xy) = I if X = y0 otherwise",
        "In particular, the fertility of all empty words in the target sentence is Y^==i+1 We define 0e = ^=+++1 <pi.",
        "For a bilingual sentence pair ei/+1 and fJ, we have Y, j=1 <Pi + </>e = J.",
        "The inverted alignments for position i in the target sentence are a set Bj, such that each element in Bi is aligned with i, and all alignments of i are in Bi.",
        "Inverted alignments are explicitly used in IBM Models 3, 4 and 5, but not in our model, which is one reason that our model is easier to understand.",
        "IBM Model 1 and the HMM are both generative models, and both start by defining the probability of alignments and source sentence given the target sentence: P(aJ, fJ|ei/+1); the data likelihood can be computed by summing over alignments:",
        "ments a1J are the hidden variables.",
        "The expectation maximization algorithm is used to learn the parameters such that the data likelihood is maximized.",
        "Without loss of generality, P(a1J, f1J|e1 ) can be decomposed into length probabilities, distortion probabilities (also called alignment probabilities), and lexical probabilities (also called translation probabilities):",
        "where P(J|e i ) is a length probability, P(aj | fj – , a!",
        "\", e2/+1) is a distortion probability and P(fj |fj\" ,a1, e2/+1) is a lexical probability.",
        "IBM Model 1 assumes a uniform distortion probability, a length probability that depends only on the length of the target sentence, and a lexical probability that depends only on the aligned target word:",
        "The hidden Markov model assumes a length probability that depends only on the length of the target sentence, a distortion probability that depends only on the previous alignment and the length of the target sentence, and a lexical probability that depends only on the aligned target word:",
        "In order to make the HMM work correctly, we enforce the following constraints (Och and Ney, 2003):",
        "where the first two equations imply that the probability of jumping to an empty word is either 0 or p0, and the third equation implies that the probability of jumping from a non-empty word is the same as the probability ofjumping from the corespondentempty word.",
        "The absolute position in the HMM is not important, because we re-parametrize the distortion probability in terms of the distance between adjacent alignment points (Vogel et al., 1996; Och and Ney, where c( ) is the count of jumps of a given distance.",
        "In IBM Model 1, the word order does not matter.",
        "The HMM is more likely to align a source word to a target word that is adjacent to the previous aligned target word, which is more suitable than IBM Model 1 because adjacent words tend to form phrases.",
        "For these two models, in theory, the fertility for a target word can be as large as the length of the source sentence.",
        "In practice, the fertility for a target word in IBM Model 1 is not very big except for rare target words, which can become a garbage collector, and alignto manysource words (Brownetal., 1993; less likely to have this garbage collector problem because of the alignment probability constraint.",
        "However, fertility is an inherent cross-language property and these two models cannot assign consistent fertility to words.",
        "This is our motivation for adding fertility to these two models, and we expect that the resulting models will perform better than the baseline models.",
        "Because the HMM performs much better than IBM Model 1, we expect that the fertility hidden Markov model will perform much better than the fertility IBM Model 1.",
        "Throughout the paper, \"our model\" refers to the fertility hidden Markov model.",
        "Due to space constraints, we are unable to provide details for IBM Models 3, 4 and 5; see Brown to point out that the locality property modeled in the HMM is missing in IBM Model 3, and is modeled invertedly in IBM Model 4.",
        "IBM Model 5 removes deficiency (Brown et al., 1993; Och and Ney, 2003) from IBM Model 4, but it is computationally very expensive due to the larger number of parameters than IBM Model 4, and IBM Model 5 often provides no improvement on alignment accuracy."
      ]
    },
    {
      "heading": "3. Fertility Hidden Markov Model",
      "text": [
        "Our fertility IBM Model 1 and fertility HMM are both generative models and start by defining the probability of fertilities (for each non-empty target word and all empty words), alignments, and the source sentence given the target sentence: P (0{,0e,a, fj !ei/+1); the data likelihood can be computed by summing over fertilities and alignments:",
        "P (fj lef",
        "The fertility for a non-empty word ej is a random variable 0j, and we assume 0j follows a Poisson distribution Poisson^; A(ej)).",
        "The sum of the fertilities of all the empty words (0e) grows with the length of the target sentence.",
        "Therefore, we assume that (/>e follows a Poisson distribution with parameter /A(e).",
        "Superficially, we only try to model the length probability more accurately.",
        "However, we also enforce the fertility for the same target word across the corpus to be consistent.",
        "The expected fertility for a non-empty word e is A(e ), and the expected fertility for all empty words is /A(e).",
        "Any fertility value has a non-zero probability, but fertility values that are further away from the mean have low probability.",
        "IBM Models 3, 4, and 5 use a multinomial distribution for fertility, which has a much larger number of parameters to learn.",
        "Our model has only one parameter for each target word, which can be learned more reliably.",
        "In the fertility IBM Model 1, we assume that the distortion probability is uniform, and the lexical probability depends only on the aligned target word:",
        "In the fertility HMM, we assume that the distortion probability depends only on the previous alignment and the length of the target sentence, and that the lexical probability depends only on the aligned target word:",
        "When we compute P (f |e1 + ), we only sum over fertilities that agree with the alignments:",
        "auxiliary function is:",
        "In the last two lines of Equation 3, ( , and each ( are not free variables, but are determined by the alignments.",
        "Because we only sum over fertilities that are consistent with the alignments, we have E f J P (f |e2/+) < 1, and our model is deficient, similar to IBM Models 3 and 4 (Brown et al., 1993).",
        "We can remove the deficiency for fertility IBM Model 1 by assuming a different distortion probability: the distortion probability is 0 if fertility is not consistent with alignments, and uniform otherwise.",
        "The total number of consistent fertility and alignments is we have:",
        "Replacing",
        "In our experiments, we did not find a noticeable change in terms of alignment accuracy by removing the deficiency."
      ]
    },
    {
      "heading": "4. Expectation Maximization Algorithm",
      "text": [
        "We estimate the parameters by maximizing using the expectation maximization",
        "Because P (a/, f |e1+) is in the exponential family, we get a closed form for the parameters from expected counts:",
        "where s is the number of bilingual sentences, and",
        "These equations are for the fertility hidden Markov model.",
        "For the fertility IBM Model 1, we do not need to estimate the distortion probability."
      ]
    },
    {
      "heading": "5. Gibbs Sampling for Fertility HMM",
      "text": [
        "Although we can estimate the parameters by using the EM algorithm, in order to compute the expected counts, we have to sum over all possible alignments a1, which is, unfortunately, exponential.",
        "We developed a Gibbs sampling algorithm (Geman and Ge-man, 1984) to compute the expected counts.",
        "For each target sentence e1 +1 and source sentence f, we initialize the alignment ßj for each source word /j using the Viterbi alignments from IBM Model 1.",
        "During the training stage, we try all 2/ + 1 possible alignments for aj but fix all other alignments.",
        "We choose alignment ßj with probability P(ßj|a1, • • • aj-1, aj+1 • • • a7, f, e1J+), which can be computed in the following way:",
        "For each alignment variable ßj, we choose t samples.",
        "We scan through the corpus many times until we are satisfied with the parameters we learned using Equations 4, 5, and 6.",
        "This Gibbs sampling method updates parameters constantly, so it is an \"online learning\" algorithm.",
        "However, this sampling method needs a large amount of communication between machines in order to keep the parameters up to date if we compute the expected counts in parallel.",
        "Instead, we do \"batch learning\": we fix the parameters, scan through the entire corpus and compute expected counts in parallel (E-step); then combine all the counts together and update the parameters (M-step).",
        "This is analogous to what IBM models and the HMM do in the EM algorithms.",
        "The algorithm for the E-step on one machine (all machines are independent) is in Algorithm 1.",
        "For the fertility hidden Markov model, updating P(a, f |e1+) whenever we change the alignment ßj can be done in constant time, so the complexity of choosing t samples for all ßj (j = 1, 2,..., J) is O(t/J).",
        "This is the same complexity as the HMM if t is O(/), and it has lower complexity if t is a constant.",
        "Surprisingly, we can achieve better results than the HMM by computing as few as 1 sample for each alignment, so the fertility hidden Markov model is much faster than the HMM.",
        "Even when choosing t such that our model is 5 times faster than the HMM, we achieve better results.",
        "Algorithm 1: One iteration of E-step: draw t samples for each ßj for each sentence pair in the corpus",
        "for , +) in the corpus do Initialize a1 with IBM Model 1; for t do for j do for i do ßj = i;",
        "Draw a sample for ßj using Equation 7; Update counts;",
        "We also consider initializing the alignments using the HMM Viterbi algorithm in the E-step.",
        "In this case, the fertility hidden Markov model is not faster than the HMM.",
        "Fortunately, initializing using IBM Model 1 Viterbi does not decrease the accuracy in any noticeable way, and reduces the complexity of the Gibbs sampling algorithm.",
        "In the testing stage, the sampling algorithm is the same as above except that we keep the alignments a that maximize P (a, f |e1We need more samples in the testing stage because it is unlikely to get to the optimal alignments by sampling a few times for each alignment.",
        "On the contrary, in the above training stage, although the samples are not accurate enough to represent the distribution defined by Equation 7 for each alignment ßj, it is accurate enough for computing the expected counts, which are defined at the corpus level.",
        "Interestingly, we found that throwing away the fertility and using the HMM Viterbi decoding achieves same results as the sampling approach (we can ignore the difference because it is tiny), but is faster.",
        "Therefore, we use Gibbs sampling for learning and the HMM Viterbi decoder for testing.",
        "Gibbs sampling for the fertility IBM Model 1 is similar but simpler.",
        "We omit the details here.",
        "Table 1: AER results.",
        "IBM1F refers to the fertility IBM1 and HMMF refers to the fertility HMM.",
        "We choose t = 1, 5, and 30 for the fertility HMM.",
        "HMMF-5 ESTi HMMF-30 iVZ'J",
        "Figure 1 : AER comparison (en – cn)",
        "Alignment",
        "Model",
        "P",
        "R",
        "AER",
        "IBM1",
        "49.6",
        "55.3",
        "47.8",
        "IBM1F",
        "55.4",
        "57.1",
        "43.8",
        "HMM",
        "62.6",
        "59.5",
        "39.0",
        "en – cn",
        "HMMF-1",
        "65.4",
        "59.1",
        "37.9",
        "HMMF-5",
        "66.8",
        "60.8",
        "36.2",
        "HMMF-30",
        "67.8",
        "62.3",
        "34.9",
        "IBM4",
        "66.8",
        "64.1",
        "34.5",
        "IBM1",
        "52.6",
        "53.7",
        "46.9",
        "IBM1F",
        "55.9",
        "56.4",
        "43.9",
        "HMM",
        "66.1",
        "62.1",
        "35.9",
        "cn – en",
        "HMMF-1",
        "68.6",
        "60.2",
        "35.7",
        "HMMF-5",
        "71.1",
        "62.2",
        "33.5",
        "HMMF-30",
        "71.1",
        "62.7",
        "33.2",
        "IBM4",
        "69.3",
        "68.5",
        "31.1",
        "Figure 3: Training time comparison.",
        "The training time for each model is calculated from scratch.",
        "For example, the training time of IBM Model 4 includes the training time of IBM Model 1, the HMM, and IBM Model 3.",
        "IBM1 1",
        "IBM1F éieq",
        "HMM kkïîïs",
        "HMMF-1",
        "-",
        "HMMF-5 t.113 -",
        "HMMF-30 zzzz]",
        "-",
        "IBM4 £i-::;i':, .",
        "_",
        "_",
        "■>y>",
        ">5<j",
        "■",
        "-",
        "■ -",
        "m -"
      ]
    },
    {
      "heading": "6. Experiments",
      "text": [
        "We evaluated our model by computing the word alignment and machine translation quality.",
        "We use the alignment error rate (AER) as the word alignment evaluation criterion.",
        "Let A be the alignments output by word alignment system, P be a set ofpos-sible alignments, and S be a set of sure alignments both labeled by human beings.",
        "S is a subset of P. Precision, recall, and AER are defined as follows:",
        "AER is an extension to F-score.",
        "Lower AER is better.",
        "We evaluate our fertility models on a Chinese-English corpus.",
        "The Chinese-English data taken from FBIS newswire data, and has 380K sentence pairs, and we use the first 100K sentence pairs as our training data.",
        "We used hand-aligned data as reference.",
        "The Chinese-English data has 491 sentence pairs.",
        "We initialize IBM Model 1 and the fertility IBM Model 1 with a uniform distribution.",
        "We smooth all parameters (A(e) and P(/|e)) by adding a small value (10-8), so they never become too small.",
        "We run both models for 5 iterations.",
        "AER results are computed using the IBM Model 1 Viterbi alignments, and the Viterbi alignments obtained from the Gibbs sampling algorithm.",
        "We initialize the HMM and the fertility HMM with the parameters learned in the 5th iteration of IBM Model 1.",
        "We smooth all parameters (A(e), P(a|a/) and P(/|e)) by adding a small value (10-8).",
        "We run both models for 5 iterations.",
        "AER results are computed using traditional HMM Viterbi decoding for both models.",
        "It is always difficult to determine how many samples are enough for sampling algorithms.",
        "However, both fertility models achieve better results than their baseline models using a small amount of samples.",
        "For the fertility IBM Model 1, we sample 10 times for each ßj, and restart 3 times in the training stage; we sample 100 times and restart 12 times in the testing stage.",
        "For the fertility HMM, we sample 30 times for each ßj with no restarting in the training stage; no sampling in the testing stage because we use traditional HMM Viterbi decoding for testing.",
        "More samples give no further improvement.",
        "Initially, the fertility IBM Model 1 and fertility HMM did not perform well.",
        "If a target word e only appeared a few times in the training corpus, our model cannot reliably estimate the parameter A(e).",
        "Hence, smoothing is needed.",
        "One may try to solve it by forcing all these words to share a same parameter A(einfreqUent).",
        "Unfortunately, this does not solve the problem because all infrequent words tend to have larger fertility than they should.",
        "We solve the problem in the following way: estimate the parameter A(enon_empty) for all non-empty words, all infrequent words share this parameter.",
        "We consider words that appear less than 10 times as infrequent words.",
        "Table 1, Figure 1, and Figure 2 shows the AER results for different models.",
        "We can see that the fertility IBM Model 1 consistently outperforms IBM Model 1, and the fertility HMM consistently outperforms the HMM.",
        "The fertility HMM not only has lower AER than the HMM, it also runs faster than the HMM.",
        "Figure 3 show the training time for different models.",
        "In fact, with just 1 sample for each alignment, our model archives lower AER than the HMM, and runs more than 5 times faster than the HMM.",
        "It is possible to use sampling instead of dynamic programming in the HMM to reduce the training time with no decrease in AER (often an increase).",
        "We conclude that the fertility HMM not only has better AER results, but also runs faster than the hidden Markov model.",
        "We also evaluate our model by computing the machine translation BLEU score (Papineni et al., 2002) using the Moses system (Koehn et al., 2007).",
        "The training data is the same as the above word alignment evaluation bitexts, with alignments for each model symmetrized using the grow-diag-final heuristic.",
        "Our test is 633 sentences of up to length 50, with four references.",
        "Results are shown in Table 2; we see that better word alignment results do not lead to better translations.",
        "recall = precision ="
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "We developed a fertility hidden Markov model that runs faster and has lower AER than the HMM.",
        "Our model is thus much faster than IBM Model 4.",
        "Our model is also easier to understand than IBM Model 4.",
        "The Markov Chain Monte Carlo method used in our model is more principled than the heuristic-based neighborhood method in IBM Model 4.",
        "While better word alignment results do not necessarily correspond to better translation quality, our translation results are comparable in translation quality to both the HMM and IBM Model 4.",
        "Acknowledgments We would like to thank Tagy-oung Chung, Matt Post, and the anonymous reviewers for helpful comments.",
        "This work was supported by NSF grants IIS-0546554 and IIS-0910611.",
        "Model",
        "BLEU",
        "HMM",
        "19.55",
        "HMMF-30",
        "19.26",
        "IBM4",
        "18.77"
      ]
    }
  ]
}
