{
  "info": {
    "authors": [
      "Jenny Brusk",
      "Ron Artstein",
      "David R. Traum"
    ],
    "book": "Proceedings of the SIGDIAL 2010 Conference",
    "id": "acl-W10-4333",
    "title": "Don't tell anyone! Two Experiments on Gossip Conversations",
    "url": "https://aclweb.org/anthology/W10-4333",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Don't tell anyone!",
        "Two Experiments on Gossip Conversations",
        "Jenny Brusk Ron Artstein, David Traum",
        "P.O.",
        "Box 408 Marina del Rey, CA 90292",
        "541 28 Skövde, Sweden {artstein, traum}@ict.usc.edu jenny.brusk@his.se",
        "The purpose of this study is to get a working definition that matches people's intuitive notion of gossip and is sufficiently precise for computational implementation.",
        "We conducted two experiments investigating what type of conversations people intuitively understand and interpret as gossip, and whether they could identify three proposed constituents of gossip conversations: third person focus, pejorative evaluation and substantiating behavior.",
        "The results show that (1) conversations are very likely to be considered gossip if all elements are present, no intimate relationships exist between the participants, and the person in focus is unambiguous.",
        "(2) Conversations that have at most one gossip element are not considered gossip.",
        "(3) Conversations that lack one or two elements or have an ambiguous element lead to inconsistent judgments."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We are interested in creating believable characters, i.e. \"characters that provide the illusion of life\" (Bates, 1994).",
        "Since people engage extensively in gossip, such characters also need to be able to understand and engage in gossip in order to be believable in some situations.",
        "To enable characters to engage in gossip, we need a computational model of gossip that can be applied in the authoring of such characters and/or by the characters themselves.",
        "Unfortunately, such a model does not yet exist.",
        "Moreover, there is not yet a clear consensus on how gossip should be defined, and most of the definitions are too vague or too general to be useful.",
        "Merriam-Webster online dictionary, for example, defines gossip as \"rumor or report of an intimate nature\" and \"chatty talk\", neither of which is specific enough.",
        "What we need is a working definition that (a) matches people's intuitive notion of gossip to the extent possible, given that the notion itself is somewhat vague, and (b) is sufficiently precise to provide a basis for computational implementation.",
        "More recent definitions (e.g. Eder and Enke, 1991; Eggins and Slade, 1997; Hallett et al., 2009) have been derived from analyzing transcriptions of real gossip conversations.",
        "These definitions have only minor individual differences and can in essence be formulated as \"evaluative talk about an absent third person\".",
        "We have chosen to use this definition as a starting point since it currently is the most specific one and since it is based on the observed structure of naturally occurring gossip conversations.",
        "This paper reports the results from two experiments on gossip conversations.",
        "The first experiment aimed at investigating what type of conversations people intuitively perceive as gossip.",
        "In the second study we also wanted to find out whether the subjects would accept a given definition and could apply it by identifying three specified gossip elements.",
        "The paper is structured as follows.",
        "In section 2 we give a background to gossip with respect to both its social function as well as its conversational structure.",
        "Section 3 introduces the experimental method.",
        "In sections 4 and 5 we present the two experiments and discuss the results.",
        "In section 6, finally, we give some final remarks and suggestions for future work."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "Gossip has been described as a mechanism for social control (e.g. Gluckman, 1963; Fine and Rosnow, 1978; Bergmann, 1993; Eggins and",
        "Slade, 1997) that maintains \"the unity, morals and values of social groups\" (Gluckman, 1963).",
        "It has furthermore been suggested that gossip is a form of \"information-management\", primarily to improve one's self-image and \"protect individual interests\" (Paine, 1967), but also to influence others (Szwed, 1966; Fine and Ros-now, 1978).",
        "Gossip can furthermore be viewed as a form of entertainment (Abrahams, 1970) -\"a satisfying diversion from the tedium of routine activities\" (Fine and Rosnow, 1978:164).",
        "Recent studies have used a sociological approach focusing on analyzing the structure of gossip conversations (e.g. Bergmann, 1993; Eder and Enke, 1991; Eggins and Slade, 1997; Hallett et al., 2009).",
        "Rather than observing and interviewing people in a certain community about their gossip behavior, they have analyzed transcripts of naturally occurring gossip conversations.",
        "Their studies show that gossipers collaborate in creating the gossip, making it a highly interactive genre.",
        "They also identified two key elements of gossip:",
        "• Third person focus - the identification of an absent third person that is acquainted with, but emotionally disjoint from the other participants (Bergmann (1993) refers to this as being \"virtually\" absent, while Goodwin (1980) labels it \"symbolically\" absent).",
        "• An evaluation of the person in focus or of his or her behavior.",
        "Eggins and Slade (1997) propose that the evaluation necessarily is pejorative to separate gossip from other types of chat.",
        "Hallett et al.",
        "(2009) found that the gossipers often use implicit evaluations to conceal the critique, suggesting that the gossipers either speak in general terms about something that implicitly is understood to be about a certain person, or that the gossipers avoid evaluating the behavior under the assumption that the evaluation is implicit in the behavior itself.",
        "Instead of specifying the evaluation as being pejorative, they say it is \"unsanctioned\".",
        "In addition to the two elements described above, Eggins and Slade (1997) propose a third obligatory element:",
        "• Substantiating behavior - An elaboration of the deviant behavior that can either be used as a motivation for the negative evaluation, or as a way to introduce gossip in the conversation.",
        "Eder and",
        "Enke (1991) use a different model, but the substantiating behavior component corresponds roughly to their optional Explanation act.",
        "There seems to be a consensus that gossip conversations have third person focus.",
        "The question is whether a gossip conversation necessarily has both a substantiating behavior component as well as a pejorative evaluation component, and if they do, can they be identified?",
        "In the experiments presented later in this paper, we hope to shed light on whether these components are necessary or not."
      ]
    },
    {
      "heading": "3. Method",
      "text": [
        "During the fall 2009, we conducted two experiments about gossip conversations.",
        "The aim of the experiments was to verify to what extent the definition of gossip accords with intuitive recognition of gossip episodes, and secondly whether people could reliably identify constituent elements.",
        "The data was collected using online questionnaires that were distributed through different email-lists mainly targeting researchers and students within game design, language technology, and related fields, located primarily in North America and Europe.",
        "The questionnaires had the following structure: The first page consisted of an introduction, including instructions, and each page thereafter had a dialogue excerpt retrieved from a screenplay followed by the question and/or task.",
        "Based on the previous studies presented earlier (in particular Bergmann, 1993; Eder and Enke, 1991; and Eggins and Slade, 1997) we had the following hypotheses:",
        "• The more gossip elements present in the text, the more likely the conversation will be considered gossip.",
        "• Third person focus is a necessary (but not sufficient) element of gossip.",
        "• Conversations in which the participants (including the target) are intimately related will be rated lower than those in which all participants are emotionally separated."
      ]
    },
    {
      "heading": "4. Experiment I: Identifying gossip text",
      "text": [
        "The aim of the first experiment was to investigate how people intuitively understand and interpret gossip conversations.",
        "The questionnaire contained 16 different dialogue excerpts retrieved from transcripts of the famous sitcoms Desperate Housewives and Seinfeld.",
        "The excerpts were selected to cover different combinations of the elements presented in the previous section (third person focus, an evaluation, and a motivation for the evaluation), as in the following dialogue:",
        "B: Tisha.",
        "Tisha.",
        "Oh, I can tell by that look on your face you've got something good.",
        "Now, come on, don't be selfish.",
        "T: Well, first off, you're not friends with Maisy Gibbons, are you?",
        "B: No.",
        "T: Thank god, because this is too good.",
        "Maisy was arrested.",
        "While Harold was at work, she was having sex with men in her house for money.",
        "Can you imagine?",
        "B: No, I can't.",
        "T: And that's not even the best part.",
        "Word is, she had a little black book with all her clients' names.",
        "T: Of course.",
        "These things always do.",
        "Nancy, wait up.",
        "I can't wait to tell you this.",
        "Wait, wait.",
        "A preliminary analysis to determine whether the elements were present or not, was made by the first author.",
        "The instructions contained no information about the elements and no definition was given.",
        "To each excerpt we provided some contextual information, such as the interpersonal relationship between the speakers and other people mentioned in the dialogue, e.g.:",
        "The married couple, Bree (B) and Rex (R) Van de Kamp, is having lunch at the club.",
        "Some women laughing at the next table cause the two of them to turn and look.",
        "One of their acquaintances, Tisha (T), walks away from that table and heads to another one.",
        "Maisy Gibbons is another woman in their neighborhood, known to be very dominant and judgmental towards the other women.",
        "The subjects were asked to read and rank the excerpts using the following scale:",
        "• Absolutely not gossip",
        "• Could be considered gossip in some contexts",
        "• Would be considered gossip in most contexts",
        "• Absolutely gossip",
        "For the purpose of analysis we converted the above responses to integers from 0 to 3.",
        "A total of 52 participants completed the experiment.",
        "The following table shows the distribution of ratings for each of the 16 excerpts (the table is sorted by the mean rating).",
        "It is apparent from the table that a few excerpts are clearly gossip or clearly not gossip, but there is much disagreement on other excerpts.",
        "Inter-rater reliability is a = 0.437: well above chance, but not particularly high.",
        "Only 7 of the 16 excerpts (ID #2, 5, 6, 7, 8, 11, 15) were clearly rated as gossip or not gossip by more than half of the subjects, and only 5 of those have a mean rating below 0.5 or above 2.5.",
        "ID",
        "Rating distribution",
        "Mean",
        "0",
        "1",
        "2",
        "3",
        "rating",
        "11",
        "50",
        "1",
        "1",
        "0",
        "0.058",
        "6",
        "46",
        "5",
        "0",
        "1",
        "0.154",
        "15",
        "33",
        "15",
        "4",
        "0",
        "0.442",
        "2",
        "28",
        "20",
        "4",
        "0",
        "0.538",
        "5",
        "30",
        "15",
        "6",
        "1",
        "0.577",
        "10",
        "17",
        "24",
        "10",
        "1",
        "0.904",
        "9",
        "10",
        "26",
        "13",
        "3",
        "1.173",
        "16",
        "11",
        "17",
        "16",
        "8",
        "1.404",
        "4",
        "8",
        "18",
        "18",
        "8",
        "1.500",
        "14",
        "11",
        "13",
        "11",
        "17",
        "1.654",
        "3",
        "6",
        "20",
        "11",
        "15",
        "1.673",
        "1",
        "1",
        "17",
        "25",
        "9",
        "1.808",
        "13",
        "3",
        "18",
        "17",
        "14",
        "1.808",
        "12",
        "5",
        "9",
        "15",
        "23",
        "2.077",
        "8",
        "3",
        "0",
        "11",
        "38",
        "2.615",
        "7",
        "1",
        "2",
        "4",
        "45",
        "2.788",
        "Despite the apparently low agreement, the results correspond fairly well with our expectations.",
        "The 3 excerpts with a mean value below 0.5 had no gossip elements at all and the other two excerpts with a median value of 0 had only one gossip element.",
        "Similarly, the two excerpts rated highest clearly had all gossip elements.",
        "The rest of the excerpts, however, either lacked one element or had one element that was unclear in some regard (see discussion, below).",
        "Conversations between family members or partners also caused higher disagreements, which seem to support Bergmann's (1993) remark: \"[...] we can ask whether we should call gossip the conversations between spouses [...] alone.",
        "This surely is a borderline case for which there is no single answer\" (p. 68).",
        "Among the nine excerpts with a mean value approximately between 1 and 2 (ID #1, 3, 4, 9, 10, 12, 13, 14, and 16), we made the following observations: 3 excerpts lacked one element; in 2 of them, the gossipers were family members or partners; 3 excerpts had an ambiguous focus, among which one also possibly was perceived as a warning.",
        "By \"ambiguous focus\" we mean that it is unclear whether the person in focus is the speaker, the addressee or the absent third person.",
        "Instead, the absent third person seems to play a subordinate role rather than focused role, for instance as part of a self-disclosure or a confrontation.",
        "If the conversation is the least bit confrontational, the addressee tends to go into defense rather than choosing a more typical gossip response, such as support, expansion, or challenge (Eder and Enke, 1991) in order to protect the face.",
        "Hence, no \"gossip fuel\" is added to the conversation.",
        "The result of the remaining excerpt is however more difficult to explain.",
        "One possible explanation is that the initiator was unacquainted with the target, but perhaps more likely is that some of the subjects interpreted the conversation as mocking rather than gossip:",
        "D: That's Sam, the new girl in accounting.",
        "W: What's with her arms?",
        "They just hang like salamis.",
        "D: She walks like orangutan.",
        "E: Better call the zoo."
      ]
    },
    {
      "heading": "5. Experiment II: Identifying gossip elements in a text",
      "text": [
        "The aim of the second experiment was to investigate whether the subjects could accept and apply a given definition by identifying the three obligatory elements of gossip according to Eggins and Slade (1997) (see section 2); third person focus, pejorative evaluation, and substantiating behavior.",
        "In addition to the elements, we provided the more general definition presented in section 1 ( \"evaluative talk about an absent third person\").",
        "The results from the first experiment indicated that conversations that seemingly had all the elements but in which the person in focus was ambiguous, received a lower gossip rating than those having an unambiguous third person focus.",
        "So an additional goal was to investigate whether changing the relationship between the participants would affect the gossip rating.",
        "We used excerpts from Seinfeld, Desperate Housewives, Legally blonde, and Mean girls.",
        "In total we selected 21 excerpts, of which 8 also occurred in the first experiment.",
        "Two of the recurring excerpts were used both in their original versions as well as in modified versions, in which we had removed the emotional connections between the participants.",
        "The purpose of this was to find out whether changing the interpersonal relationship would change the gossip rating.",
        "The subjects were instructed to read the excerpts and then identify the gossip elements according to the following description:",
        "• The person being talked about (third person focus) - the \"target\", e.g. \"Maisy Gibbons was arrested\"",
        "• Pejorative evaluation.",
        "A judgment of the target him-/herself or of the target's behavior.",
        "This evaluation is in most cases negative, e.g. \"She's a slut\", \"He's weird\"",
        "• The deviant behavior that motivates the gossip and provides evidence for the judgment (also called the substantiating behavior stage), e.g. \"Maisy Gibbons was arrested\"",
        "For each element they found, they were asked to specify the corresponding line reference as given in the text.",
        "They were also instructed to say whether they considered the conversation to be gossip or not gossip.",
        "If their rating disagreed with the definition, i.e. if they had found all the elements but still rated the conversation as not gossip, or if one or more elements were lacking but the conversation was considered gossip anyway, they were asked to specify why.",
        "We analyzed the results from the 19 subjects who completed ratings for all 21 excerpts.",
        "This gave a total of 399 yes/no judgments on 4 attributes.",
        "Inter-coder reliability is shown in Table 2.",
        "The easiest attribute to interpret is third person focus.",
        "All but three of the subjects marked either 4 or 5 excerpts as not having third person focus, with the remaining subjects not deviating by much (marking 3, 6, and 7 excerpts).",
        "Moreover, the subjects agree on which excerpts have third person focus: only one excerpt gets a substantial number of conflicting ratings (see the analysis given below in section 5.4), while the remaining 20 excerpts get consistent ratings from all subjects with only occasional deviation by one or two of the deviant subjects.",
        "This accounts for the high observed agreement on this feature (94.9%).",
        "Expected agreement is high because the corpus is not balanced (16 of 21 excerpts display third person focus), but even so, chance-corrected agreement is high (85.1%), showing that third person focus is an attribute that participants can readily and reliably identify.",
        "The remaining attributes, including gossip, are less clear.",
        "Agreement on all of them is clearly above chance, but is not particularly high, showing that these notions are either not fully defined, or that the excerpts are ambiguous.",
        "Gossip itself is identified somewhat more reliably than either substantiating behavior or pejorative evaluation; this casts doubt about the ability to use the latter two as defining features of gossip, given that they are more difficult to identify.",
        "To test the relationship between the various features, we looked for co-occurrences among the individual judgments.",
        "We have a total of 399 ratings (21 excerpts times 19 judges), each with 4 attributes; these are distributed as shown in Table 3.",
        "We can see that third person focus is an almost necessary condition for classifying a screenplay conversation as gossip, though it is by no means sufficient.",
        "Tables 4-6 show the co-occurrences of individual features to gossip; the association is strongest between gossip and third person focus and weakest between gossip and pejorative evaluation.",
        "Gossip Gossip 3rd person2",
        "Substantiating Substantiating behavior_behavior_",
        "Do, while expected agreement is: Ae = 1 - De.",
        "Strike-through marks the absence of a feature.",
        "Alpha",
        "Observed",
        "Expected",
        "agreement",
        "agreement",
        "Gossip",
        "0.466",
        "0.744",
        "0.520",
        "Third person focus",
        "0.851",
        "0.949",
        "0.661",
        "Substantiating behavior",
        "0.376",
        "0.709",
        "0.533",
        "Pejorative evaluation",
        "0.384",
        "0.733",
        "0.567",
        "3rd person",
        "3rd person",
        "Subst",
        "Subst",
        "Subst Subst",
        "Pejor",
        "168",
        "24",
        "2",
        "Pejor",
        "33",
        "14",
        "Pejor",
        "25",
        "20",
        "17 17",
        "Pejor",
        "6",
        "23",
        "3 47",
        "Gossip Gossip Pejorative",
        "Correlation with gossip",
        "In addition to the co-occurrences of features on the individual judgments, we can look at these co-occurrences grouped by screenplay.",
        "Table 7 shows, for each of the 21 excerpts, how many subjects identified each of the four features (the table is sorted by the gossip score).",
        "It is apparent from the table that all the features are correlated to some extent.",
        "Table 8 shows the correlation between gossip and each of the other three features.",
        "The first column calculates correlation based on the individual judgments (399 items, each score is either 0 or 1); the second column calculates correlation based on the rated excerpts (21 items, each score is an integer between 0 and 19, as in table 7); and the third column groups the judgments by subject (19 items, each score is an integer between 0 and 21, indicating the number of dialogues in which the subject identified the particular feature; the full data are not shown).",
        "Individual",
        "All the correlations are significantly different from 0 at the p < 0.05 level or greater.",
        "The differences between the columns are not significant, except for the difference between the third person correlation by individuals and that by excerpt, which is significant at p < 0.05.",
        "The correlations between the features on the individual judgments show that subjects tend to identify the different features together; this may be partly a reflection of awareness on their part that the features are expected to go together, given the task definition.",
        "The correlations between the excerpt scores show that the excerpts themselves differ along the four dimensions, and these differences go hand in hand.",
        "Finally, we see that the subjects themselves differ in how often they identify the different features, though the correlations are likely to be just a reflection of the first tendency identified above, to mark the features together.",
        "We wanted to find out whether the subjects would accept, understand and be able to apply a given definition.",
        "The results from the experiment showed that the subjects accepted the given definition to some extent and managed to apply it.",
        "When the subjects disagreed they were asked to say why.",
        "One of the subjects, for example, explicitly disagreed with the definition given in the introduction and provided a counter definition: \"Gossip is idle talk or rumor, especially about the personal or private affairs of others\".",
        "Yet another subject was uncertain about which definition to use: \"Depends what you mean by gossip.",
        "It can either mean malicious, behind the back talk of other people or idle chat.",
        "If you mean 'idle chat' with gossip then this is also gossip\".",
        "A possible explanation could be that the subjects refer to different forms of gossip (see e.g. Gilmore, 1978) and therefore apply different definitions (such as the lexical definition presented earlier) than the one that was given in the experiment.",
        "Presentation was ordered by ID, same for all subjects.",
        "Third person Substantiating Pejorative",
        "ID",
        "Gossip",
        "Third person",
        "Subst.",
        "behavior",
        "Pejorative evaluation",
        "2",
        "0",
        "0",
        "1",
        "3",
        "11",
        "0",
        "0",
        "9",
        "9",
        "19",
        "0",
        "1",
        "6",
        "8",
        "14",
        "1",
        "0",
        "2",
        "12",
        "5",
        "7",
        "19",
        "5",
        "1",
        "15",
        "7",
        "19",
        "18",
        "17",
        "21",
        "8",
        "17",
        "6",
        "16",
        "12",
        "9",
        "17",
        "10",
        "14",
        "20",
        "13",
        "13",
        "10",
        "10",
        "16",
        "14",
        "18",
        "14",
        "7",
        "8",
        "14",
        "19",
        "7",
        "19",
        "7",
        "14",
        "19",
        "9",
        "9",
        "17",
        "14",
        "19",
        "17",
        "18",
        "18",
        "15",
        "19",
        "19",
        "19",
        "4",
        "17",
        "19",
        "12",
        "9",
        "10",
        "17",
        "19",
        "16",
        "19",
        "6",
        "17",
        "19",
        "19",
        "19",
        "9",
        "18",
        "19",
        "17",
        "8",
        "1",
        "18",
        "19",
        "19",
        "19",
        "3",
        "19",
        "19",
        "18",
        "18",
        "13",
        "19",
        "19",
        "18",
        "19",
        "Several subjects stated that they judged the conversation as gossip even if they did not identify any pejorative evaluation, and they also questioned whether the evaluation had to be negative or even present at all, or as one of the subjects put it: \"Although there is no pejorative evaluation (at least not clearly) I believe this is gossip\".",
        "These subjects thus explicitly reject Eggins and Slade's (1997) requirement that the evaluation has to be pejorative.",
        "The examples above show that people have variable intuitions of gossip and consequently the concept of gossip is somewhat vague.",
        "Even so, the experiment also showed that people to a large degree are in agreement when the examples according to the given definition clearly are gossip or not gossip.",
        "Meaning that even though the definition does not capture all types of (potential) gossip conversations, it captures those episodes that most people agree to be gossip, which for our purpose is sufficient.",
        "In some particular cases, the subjects did not choose gossip even if all elements had been found.",
        "The results from the first experiment indicated that this deviation either was related to the interpersonal relationship between the gossip participants or that the focus was ambiguous.",
        "In order to test whether changing the interpersonal relationship between the participants would change the gossip rating, we compared the results from the conversations we had modified with their original counterparts.",
        "In one of the original excerpts, the addressee was romantically involved with the man that the speaker was talking about.",
        "The speaker formulated the negative assessment and deviant behavior in a way that for most people would be interpreted as a warning, which probably explains why only 7 of the 19 subjects rated the original conversation as gossip.",
        "The modified version on the other hand, was rated as gossip by all subjects.",
        "In the second dialogue, the speaker questions the addressee's choice of person to date, and does this by both evaluating the person negatively as well as providing evidence for the evaluation.",
        "It turns out, however, that the addressee thinks she is going out for a date with someone else, so a large part of the conversation deals with trying to identify the target.",
        "15 of 19 subjects rated the original conversation as gossip, while all subjects rated it as gossip in the modified version.",
        "These comparisons indicate that the status of the relationship between the gossipers and the gossip target affects whether the dialogue is considered gossip or not.",
        "In the original version of both these examples, the focus was ambiguous, i.e. the focus was as much on the addressee as on the absent third person.",
        "We have shown that third person focus is a key element of gossip.",
        "The correlation was furthermore confirmed by the subjects themselves in their comments, where the lack of third person often was listed as a reason for not choosing gossip.",
        "In one example, the respondent regarded the conversation as gossip even if it really was an insult directed towards the addressee, but explained it as its \"...almost like he's forgotten he's talking to the person he's giving this opinion/gossip about\".",
        "The highest disagreement concerning third person focus was found in the following exKaren: Okay, what is it?",
        "Gretchen: Regina says everyone hates you because you're such a slut.",
        "Karen: She said that?",
        "Gretchen: You didn't hear it from me.",
        "The dialogue contains an ambiguous focus in that it both includes a quote as well as a confrontational insult.",
        "By using the third person reference, Gretchen avoids taking responsibility for the insult.",
        "In some sense both Karen and Regina are in focus, where Karen is the target of the pejorative evaluation and Regina can be interpreted as being the focus of the substantiating behavior component.",
        "How Regina's role is interpreted is determined by the respondents' personal attitude towards gossiping in general (i.e. whether they interpret Gretchen's utterance as containing an implicit evaluation of Regina's behavior or not), and how they perceive the interpersonal relationship between Karen and Gretchen.",
        "Gossip has an inherent contradiction in that it both has a function of negotiating the accepted way to behave while it at the same time often is considered an inappropriate activity that can have serious negative consequences for both the gossipers as well as the gossip target (see e.g. Gilmore, 1978; Bergmann, 1993; Eggins and Slade, 1997; Hallett et al., 2009)."
      ]
    },
    {
      "heading": "6. Final remarks and future work",
      "text": [
        "The aim of these studies has been to get a workable definition of gossip that people can agree upon and that is sufficiently precise to provide a basis for computational implementation.",
        "We conducted two experiments to investigate people's intuitive notion of gossip and the results show that (1) conversations in which all elements are present, where no intimate relationships exist between the participants, and in which the person in focus is unambiguous, are very likely to be considered gossip.",
        "(2) Conversations that have at most one gossip element are not considered gossip.",
        "(3) Inconsistencies are mainly found in conversations that lack one or two elements or have at least one element that is ambiguous, or are taking place between gossipers that have an intimate relationship.",
        "We have suggested that third person focus is a necessary, but not sufficient, element of gossip, but the other elements are less clear even if their co-occurrence in a conversation clearly affects the gossip score.",
        "In the second experiment this might be due to the instructions, but it does not explain the unbiased results from the first experiment.",
        "So on the one hand we can clearly see that all three elements are important for the understanding of gossip, but on the other hand, the subjects' had trouble in identifying them.",
        "This suggests that we need to further investigate these elements to see how they can be specified more clearly.",
        "We have taken a first step toward a computational account of gossip, by empirically verifying the extent to which the given definition can be applied and the components recognized by people.",
        "Some of our next steps to further this program include authoring content for believable characters that follow this definition, as well as attempting to automatically recognize these elements.",
        "Among the possible applications of gossip we can think of game characters and virtual humans that are capable of engaging in gossip conversations to share information and create social bonds with a human user or its avatar.",
        "This involves being able to both generate gossip on basis of the interpersonal relationship and selecting content that could be regarded as gossip, as well as to automatically detect gossip occurring in a conversation.",
        "The latter use could also be used for characters that actively want to avoid taking part in gossip conversations."
      ]
    }
  ]
}
