{
  "info": {
    "authors": [
      "James Pustejovsky",
      "Anna Rumshisky",
      "Alex Plotnick",
      "Elisabetta Jezek",
      "Olga Batiukova",
      "Valeria Quochi"
    ],
    "book": "Workshop on Semantic Evaluations (SemEval)",
    "id": "acl-S10-1005",
    "title": "SemEval-2010 Task 7: Argument Selection and Coercion",
    "url": "https://aclweb.org/anthology/S10-1005",
    "year": 2010
  },
  "references": [
    "acl-C04-1133",
    "acl-E06-2001",
    "acl-J05-1004",
    "acl-J91-4003",
    "acl-W07-2007",
    "acl-W09-3716"
  ],
  "sections": [
    {
      "text": [
        "James Pustejovsky and Anna Rumshisky and Alex Plotnick",
        "of Computer Science Brandeis University Waltham, MA, USA",
        "of Linguistics University of Pavia Pavia, Italy",
        "of Humanities Carlos III University of Madrid Madrid, Spain",
        "ILC-CNR Pisa, Italy",
        "We describe the Argument Selection and Coercion task for the SemEval-2010 evaluation exercise.",
        "This task involves characterizing the type of compositional operation that exists between a predicate and the arguments it selects.",
        "Specifically, the goal is to identify whether the type that a verb selects is satisfied directly by the argument, or whether the argument must change type to satisfy the verb typing.",
        "We discuss the problem in detail, describe the data preparation for the task, and analyze the results of the submissions."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In recent years, a number of annotation schemes that encode semantic information have been developed and used to produce data sets for training machine learning algorithms.",
        "Semantic markup schemes that have focused on annotating entity types and, more generally, word senses, have been extended to include semantic relationships between sentence elements, such as the semantic role (or label) assigned to the argument by the predicate (Palmer et al., 2005; Ruppenhofer et al., 2006; Kipper, 2005; Burchardt et al., 2006; Subi-rats, 2004).",
        "In this task, we take this one step further and attempt to capture the \"compositional history\" of the argument selection relative to the predicate.",
        "In particular, this task attempts to identify the operations of type adjustment induced by a predicate over its arguments when they do not match its selectional properties.",
        "The task is defined as follows: for each argument of a predicate, identify whether the entity in that argument position satisfies the type expected by the predicate.",
        "If not, then identify how the entity in that position satisfies the typing expected by the predicate; that is, identify the source and target types in a type-shifting or coercion operation.",
        "Consider the example below, where the verb report normally selects for a human in subject position, as in (la).",
        "Notice, however, that through a métonymie interpretation, this constraint can be violated, as demonstrated in (lb).",
        "(1) a. John reported in late from Washington, b. Washington reported in late.",
        "Neither the surface annotation of entity extents and types nor assigning semantic roles associated with the predicate would reflect in this case a crucial point: namely, that in order for the typing requirements of the predicate to be satisfied, a type coercion or a metonymy (Hobbs et al., 1993; Pustejovsky, 1991; Nunberg, 1979; Egg, 2005) has taken place.",
        "The SemEval Metonymy task (Markert and Nis-sim, 2007) was a good attempt to annotate such métonymie relations over a larger data set.",
        "This task involved two types with their métonymie variants: categories-for-locations (e.g., place-for-people) and categories-for-organizations (e.g., organization-for-members).",
        "One of the limitations of this approach, however, is that while appropriate for these specialized metonymy relations, the annotation specification and resulting corpus are not an informative guide for extending the annotation of argument selection more broadly.",
        "In fact, the metonymy example in (1) is an instance of a much more pervasive phenomenon of type shifting and coercion in argument selection.",
        "For example, in (2) below, the sense annotation for the verb enjoy should arguably assign similar values to both (2a) and (2b).",
        "Annotate j – »|~ Train -fest j – ^|",
        "(2) a. Mary enjoyed drinking her beer, b. Mary enjoyed her beer.",
        "The consequence of this is that under current sense and role annotation strategies, the mapping to a syntactic realization for a given sense is made more complex, and is in fact perplexing for a clustering or learning algorithm operating over subcat-egorization types for the verb."
      ]
    },
    {
      "heading": "2. Methodology of Annotation",
      "text": [
        "Before introducing the specifics of the argument selection and coercion task, we will briefly review our assumptions regarding the role of annotation in computational linguistic systems.",
        "We assume that the features we use for encoding a specific linguistic phenomenon are rich enough to capture the desired behavior.",
        "These linguistic descriptions are typically distilled from extensive theoretical modeling of the phenomenon.",
        "The descriptions in turn form the basis for the annotation values of the specification language, which are themselves the features used in a development cycle for training and testing a labeling algorithm over a text.",
        "Finally, based on an analysis and evaluation of the performance of a system, the model of the phenomenon may be revised.",
        "We call this cycle of development the matter methodology (Fig.",
        "1):",
        "Model: Structural descriptions provide theoretically informed attributes derived from empirical observations over the data;",
        "Annotate: Annotation scheme assumes a feature set that encodes specific structural descriptions and properties of the input data;",
        "Train: Algorithm is trained over a corpus annotated with the target feature set; Test: Algorithm is tested against held-out data; Evaluate: Standardized evaluation of results;",
        "Revise: Revisit the model, annotation specification, or algorithm, in order to make the annotation more robust and reliable.",
        "Some of the current and completed annotation efforts that have undergone such a development cycle include PropBank (Palmer et al., 2005), Nom-Bank (Meyers et al., 2004), and TimeBank (Pustejovsky et al., 2005)."
      ]
    },
    {
      "heading": "3. Task Description",
      "text": [
        "The argument selection and coercion (asc) task involves identifying the selectional mechanism used by the predicate over a particular argument.For the purposes of this task, the possible relations between the predicate and a given argument are restricted to selection and coercion.",
        "In selection, the argument NP satisfies the typing requirements of the predicate, as in (3):",
        "(3) a.",
        "The spokesman denied the statement (proposi-",
        "tion).",
        "b.",
        "The child threw the stone (physical object).",
        "c. The audience didn't believe the rumor (proposition).",
        "Coercion occurs when a type-shifting operation must be performed on the complement NP in order to satisfy selectional requirements of the predicate, as in (4).",
        "Note that coercion operations may apply to any argument position in a sentence, including the subject, as seen in (4b).",
        "Coercion can also be seen as an object of a proposition, as in (4c).",
        "(4) a.",
        "The president denied the attack (event – > propo-",
        "sition).",
        "b.",
        "The White House (location – > human) denied this statement.",
        "c. The Boston office called with an update (event – >",
        "info).",
        "In order to determine whether type-shifting has taken place, the classification task must then involve (1) identifying the verb sense and the associated syntactic frame, (2) identifying selectional requirements imposed by that verb sense on the target argument, and (3) identifying the semantic type of the target argument."
      ]
    },
    {
      "heading": "4. Resources and Corpus Development",
      "text": [
        "We prepared the data for this task in two phases: the data set construction phase and the annotation phase (see Fig. 2).",
        "The first phase consisted of (1) selecting the target verbs to be annotated and compiling a sense inventory for each target, and (2) data extraction and preprocessing.",
        "The prepared data was then loaded into the annotation interface.",
        "During the annotation phase, the annotation judgments were entered into the database, and an adjudicator resolved disagreements.",
        "The resulting database was then exported in an XML format.",
        "For the English data set, the data construction phase was combined with the annotation phase.",
        "The data for the task was created using the following steps:",
        "1.",
        "The verbs were selected by examining the data from the BNC, using the Sketch Engine (Kilgar-riff et al., 2004) as described in (Rumshisky and Batiukova, 2008).",
        "Verbs that consistently impose semantic typing on one of their arguments in at least one of their senses (strongly coercive verbs) were included into the final data set: arrive (at), cancel, deny, finish, and hear.",
        "2.",
        "Sense inventories were compiled for each verb, with the senses mapped to OntoNotes (Pradhan et al., 2007) whenever possible.",
        "For each sense, a set of type templates was compiled using a modification of the CPA technique (Hanks and Pustejovsky, 2005; Pustejovsky et al., 2004): every argument in the syntactic pattern associated with a given sense was assigned a type specification.",
        "Although a particular sense is often compatible with more than one semantic type for a given argument, this was never the case in our data set, where no disjoint types were tested.",
        "The coercive senses of the chosen verbs were associated with the following type templates:",
        "a.",
        "Arrive (at), sense reach a destination or goal: human arrive at location b.",
        "Cancel, sense call off: human cancel event",
        "c. Deny, sense state or maintain that something is untrue: human deny proposition d. Finish, sense complete an activity: human finish e. Hear, sense perceive physical sound: human hear",
        "We used a subset of semantic types from the Brandeis Shallow Ontology (BSO), which is a shallow hierarchy of types developed as a part of the CPA effort (Hanks, 2009; Pustejovsky et al., 2004; Rumshisky et al., 2006).",
        "Types were selected for their prevalence in manually identified selection context patterns developed for several hundred English verbs.",
        "That is, they capture common semantic distinctions associated with the selectional properties of many verbs.",
        "The types used for annotation were:",
        "abstract entity, animate, artifact, attitude, document, drink, emotion, entity, event, food, human, human group, idea, information, location, obligation, organization, path, physical object, property, proposition, rule, sensation, sound, substance, time period, vehicle",
        "This set of types is purposefully shallow and non-hierarchical.",
        "For example, human is a subtype of both animate and physical object, but annotators and system developers were instructed to choose the most relevant type (e.g., human) and to ignore inheritance.",
        "3.",
        "A set of sentences was randomly extracted for each target verb from the BNC (Burnard, 1995).",
        "The extracted sentences were parsed automatically, and the sentences organized according to the grammatical relation the target verb was involved in.",
        "Sentences were excluded from the set if the target argument was expressed as anaphor, or was not present in the sentence.",
        "The semantic head for the target grammatical relation was identified in each case.",
        "4.",
        "Word sense disambiguation of the target predicate was performed manually on each extracted sentence, matching the target against the sense inventory and the corresponding type templates as described above.",
        "The appropriate senses were then saved into the database along with the associated type template.",
        "5.",
        "The sentences containing coercive senses of the target verbs were loaded into the Brandeis Annotation Tool (Verhagen, 2010).",
        "Annotators were presented with a list of sentences and asked to determine whether the argument in the specified grammatical relation to the target belongs to the type associated with that sense in the corresponding template.",
        "Disagreements were resolved by adjudication.",
        "Verb",
        "Sense",
        "Type",
        "Selection",
        "Inventory",
        "Templates",
        "Table 1 : Coercions in the English data set",
        "6.",
        "To guarantee robustness of the data, two additional steps were taken.",
        "First, only the six most recurrent coercion types were selected; these are given in table 1.",
        "Preference was given to cross-domain coercions, where the source and the target types are not related ontologically.",
        "Second, the distribution of selection and coercion instances were skewed to increase the number of coercions.",
        "The final English data set contains about 30% coercions.",
        "7.",
        "Finally, the data set was randomly split in half into a training set and a test set.",
        "The training data has 1032 instances, 311 of which are coercions, and the test data has 1039 instances, 314 of which are coercions.",
        "In constructing the Italian data set, we adopted the same methodology used for the English data set, with the following differences:",
        "1.",
        "The list of coercive verbs was selected by examining data from the ItWaC (Baroni and Kilgar-riff, 2006) using the Sketch Engine (Kilgarriff et al., 2004):",
        "accusare 'accuse', annunciare 'announce', arrivare 'active' , ascoltare 'listen', avvisare 'inform', chiamare 'call', cominciare 'begin', completare 'complete', con-cludere 'conclude', contattare 'contact', divorare 'devour', echeggiare 'echo', finire 'finish', informare 'inform', interrompere 'interrupt', leggere 'read', raggiun-gere 'reach', recar(si) 'go to', rimbombare 'resound', sentire 'hear', udire 'hear', visitare 'visit'.",
        "2.",
        "The coercive senses of the chosen verbs were associated with type templates, some of which are listed listed below.",
        "Whenever possible, senses and type templates were adapted from the Italian Pattern Dictionary (Hanks and lezek, 2007) and mapped to their simple equivalents (Lenci et al., 2000).",
        "a. arrivare, sense reach a location: human arriva [prep] location",
        "b. cominciare, sense initiate an undertaking: human comincia event",
        "c. completare, sense finish an activity: human compléta event d. udire, sense perceive a sound: human ode sound",
        "e. visitare, sense visit a place: human visita location",
        "The following types were used to annotate the Italian dataset:",
        "abstract entity, animate, artifact, attitude, container, document, drink, emotion, entity, event, food, human, human group, idea, information, liquid, location, organization, physical object, property, sensation, sound, time period, vehicle",
        "The annotators were provided with a set of definitions and examples of each type.",
        "3.",
        "A set of sentences for each target verb was extracted and parsed from the PAROLE sottoin-sieme corpus (Bindi et al., 2000).",
        "They were skimmed to ensure that the final data set contained a sufficient number of coercions, with proportionally more selections than coercions.",
        "Sentences were preselected to include instances representing one of the chosen senses.",
        "4.",
        "In order to exclude instances that may have been wrongly selected, a judge performed word sense disambiguation of the target predicate in the extracted sentences.",
        "5.",
        "Annotators were presented with a list of sentences and asked to determine the usual semantic type associated with the argument in the specified grammatical relation.",
        "Every sentence was annotated by two annotators and one judge, who resolved disagreements."
      ]
    },
    {
      "heading": "6.. Some of the coercion types selected for Italian were:",
      "text": [
        "a. location – > human (accusare, annunciare) b. artifact – > human (annunciare, avvisare) c. event – > location (arrivare, raggiungere) d. artifact – > event (cominciare, completare) e. event – > document (leggere, divorare) f. human – > document (leggere, divorare) g. event – > sound (ascoltare, echeggiare) h. artifact – > sound (ascoltare, echeggiare)",
        "7.",
        "The Italian training data contained 1466 instances, 381 of which are coercions; the test data had 1463 instances, with 384 coercions."
      ]
    },
    {
      "heading": "5. Data Format",
      "text": [
        "The test and training data were provided in XML.",
        "The relation between the predicate (viewed as a function) and its argument were represented by composition link elements (CompLink), as shown below.",
        "The test data differed from the training data in the omission of CompLink elements.",
        "Coerion Type",
        "Verb",
        "Train",
        "Test",
        "event – ^-location",
        "arrive at",
        "38",
        "37",
        "artifact – levent",
        "cancel",
        "35",
        "35",
        "finish",
        "91",
        "92",
        "event^proposition",
        "deny",
        "56",
        "54",
        "artifact – »-sound",
        "hear",
        "28",
        "30",
        "event^sound",
        "hear",
        "24",
        "26",
        "document^event",
        "finish",
        "39",
        "40",
        "In case of coercion, there is a mismatch between the source and the target types, and both types need to be identified; e.g., The State Department repeatedly denied the attack:",
        "The State Department repeatedly <SELECTOR sid=\"sl\">denied</SELECTOR> the <TARGET id=\"t1\">attack</TARGET>.",
        "<CompLink cid=\"cidl\" compType=\"COERCION\" selector_id=\"si\" relatedToTarget=\"tl\" sourceType=\"EVENT\" targetType=\"PROPOSITION\"/>",
        "When the compositional operation is selection, the source and target types must match; e.g., The State Department repeatedly denied the statement:",
        "The State Department repeatedly <SELECTOR sid=\"s2\">denied</SELECTOR> the <TARGET id=\"t2\">statement</TARGET>.",
        "<CompLink cid=\"cid2\" compType=\"SELECTION\" selector_id=\"s2\" relatedToTarget=\"t2\" sourceType=\"PROPOSITION\" targetType=\"PROPOSITION\"/>"
      ]
    },
    {
      "heading": "6. Results & Analysis",
      "text": [
        "We received only a single submission for the asc task.",
        "The UTDMet system was an SVM-based system with features derived from two main sources: a PageRank-style algorithm over Word-Net hypernyms used to define semantic classes, and statistics from a PropBank-style parse of some 8 million documents from the English Gigaword corpus.",
        "The results, shown in Table 2, were computed from confusion matrices constructed for each of four classification tasks for the 1039 link instances in the English test data: determination of argument selection or coercion, identification of the argument source type, identification of the argument target type, and the joint identification of the source/target type pair.",
        "Clearly, the UTDMet system did quite well at this task.",
        "The one immediately noticeable outlier is the macro-averaged precision for the joint type, which reflects a small number of miscategoriza-tions of rare types.",
        "For example, eliminating the single miscategorized artifact-location link in the submitted test data bumps this score up to a respectable 94%.",
        "This large discrepancy can explained by the lack of any coercions with those types in the gold-standard data.",
        "In the absence of any other submissions, it is difficult to provide a point of comparison for this performance.",
        "However, we can provide a baseline by taking each link to be a selection whose source and target types are the most common type (event for the gold-standard English data).",
        "This yields micro-averaged precision scores of 69% for selection vs. coercion, 33% for source type identification, 37% for the target type identification, and 22% for the joint type.",
        "The performance of the UTDMet system suggests that most of the type coercions were identifiable based largely on examination of lexical clues associated with selection contexts.",
        "This is in fact to be expected for the type coercions that were the focus of the English data set.",
        "It will be interesting to see how systems perform on the Italian data set and an expanded corpus for English and Italian, where more subtle and complex type exploitations and manipulations are at play.",
        "These will hopefully be explored in future competitions."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "In this paper, we have described the Argument Selection and Coercion task for SemEval-2010.",
        "This task involves identifying the relation between a predicate and its argument as one that encodes the compositional history of the selection process.",
        "This allows us to distinguish surface forms that directly satisfy the selectional (type) requirements of a predicate from those that are coerced in context.",
        "We described some details of a specification language for selection, the annotation task using this specification to identify argument selection behavior, and the preparation of the data for the task.",
        "Finally, we analyzed the results of the task submissions.",
        "Prec.",
        "Recall",
        "Averaging",
        "Selection vs.",
        "95",
        "96",
        "(macro)",
        "Coercion:",
        "96",
        "96",
        "(micro)",
        "Source Type:",
        "96",
        "96",
        "(macro)",
        "96",
        "96",
        "(micro)",
        "Target Type:",
        "100",
        "100",
        "(both)",
        "lointType:",
        "86",
        "95",
        "(macro)",
        "96",
        "96",
        "(micro)"
      ]
    }
  ]
}
