{
  "info": {
    "authors": [
      "Anja Belz",
      "Eric Kow"
    ],
    "book": "Proceedings of the International Natural Language Generation Conference",
    "id": "acl-W10-4217",
    "title": "Extracting Parallel Fragments from Comparable Corpora for Data-to-text Generation",
    "url": "https://aclweb.org/anthology/W10-4217",
    "year": 2010
  },
  "references": [
    "acl-J03-3002",
    "acl-J05-4003",
    "acl-J93-1003",
    "acl-P04-1066",
    "acl-P06-1011",
    "acl-P95-1034",
    "acl-P95-1050",
    "acl-P99-1067",
    "acl-W04-3243",
    "acl-W08-1131",
    "acl-W09-0603"
  ],
  "sections": [
    {
      "text": [
        "Extracting Parallel Fragments from Comparable Corpora for",
        "Data-to-text Generation",
        "Anja Belz Eric Kow",
        "Building NLG systems, in particular statistical ones, requires parallel data (paired inputs and outputs) which do not generally occur naturally.",
        "In this paper, we investigate the idea of automatically extracting parallel resources for data-to-text generation from comparable corpora obtained from the Web.",
        "We describe our comparable corpus of data and texts relating to British hills and the techniques for extracting paired input/output fragments we have developed so far."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Starting with Knight, Langkilde and Hatzivas-siloglou's work on Nitrogen and its successor Halogen (Knight and Hatzivassiloglou, 1995; Knight and Langkilde, 2000), NLG has over the past 15 years moved towards using statistical techniques, in particular in surface realisation (Langk-ilde, 2002; White, 2004), referring expression generation (most of the sytems submitted to the tuna and grec shared task evaluation challenges are statistical, see Gatt et al.",
        "(2008), for example), and data-to-text generation (Belz, 2008).",
        "The impetus for introducing statistical techniques in NLG can be said to have originally come from machine translation (MT), but unlike MT, where parallel corpora of inputs (source language texts) and outputs (translated texts) occur naturally at least in some domains, NLG on the whole has to use manually created input/output pairs.",
        "Data-to-text generation (d2t) is the type of nlg that perhaps comes closest to having naturally oc-curing inputs and outputs at its disposal.",
        "Work in D2T has involved different domains including generating weather forecasts from meteorological data (Sripada et al., 2003), nursing reports from intensive care data (Portet et al., 2009), and museum exhibit descriptions from database records (Isard et al., 2003; Stock et al., 2007); types of data include dynamic time-series data (e.g. medical data) and static database entries (museum exhibits).",
        "While data and texts in the three example domains cited above do occur naturally, two factors mean they cannot be used directly as example corpora or training data for building d2t systems: one, most are not freely available to researchers (e.g. by simply being available on the Web), and two, more problematically, for the most part, there is no direct correspondence between inputs and outputs as there is, say, between a source language text and its translation.",
        "On the whole, naturally occurring resources of data and related texts are not strictly parallel, but are merely what has become known as comparable in the MT literature, with only a subset of data having corresponding text fragments, and other text fragments having no obvious corresponding data items.",
        "Moreover, data transformations may be necessary before corresponding text fragments can be identified.",
        "In this report, we look at the possibility of automatically extracting parallel data-text fragments from comparable corpora in the case of D2T from static database records.",
        "Such a parallel data-text resource could then be used to train an existing D2T generation system, or even build a new statistical generator from scratch, e.g. using techniques from statistical MT (Belz and Kow, 2009).",
        "The steps involved in going from comparable data and text resources to generators that produce texts similar to those in the text resource are then as follows: (1) identify sources on the Web for comparable data and texts; (2) pair up data records and texts; (3) extract parallel fragments (sets of data fields paired with word strings); (4) train a D2T generator using the parallel fragments; and (5) feed data inputs to the generator which then generates new texts describing them.",
        "Figure 1 illustrates steps 1-3 which this paper focuses on.",
        "In Section 3 we look at steps 1 and 2; in Section 4 at step 3.",
        "First we briefly survey related work in MT."
      ]
    },
    {
      "heading": "2. Related work in MT",
      "text": [
        "In statistical MT, the expense of manually creating new parallel MT corpora, and the need for very large amounts of parallel training data, has led to a sizeable research effort to develop methods for automatically constructing parallel resources.",
        "This work typically starts by identifying comparable corpora.",
        "Much of it has focused on identifying word translations in comparable corpora, e.g. Rapp's approach was based on the simple and elegant assumption that if words Af and Bf have a higher than chance co-occurrence frequency in one language, then two appropriate translations Ae and Be in another language will also have a higher than chance co-occurrence frequency (Rapp, 1995; Rapp, 1999).",
        "At the other end of the spectrum, Resnik & Smith (2003) search the Web to detect web pages that are translations of each other.",
        "Other approaches aim to identify pairs of sentences (Munteanu and Marcu, 2005) or sub-sentential fragments (Munteanu and Marcu, 2006) that are parallel within comparable corpora.",
        "The latter approach is particularly relevant to our work.",
        "They start by translating each document in the source language (SL) word for word into the target language (TL).",
        "The result is given to an information retrieval (ir) system as a query, and the top 20 results are retained and paired with the given SL document.",
        "They then obtain all sentence pairs from each pair of SL and TL documents, and discard those sentence pairs with few words that are translations of each other.",
        "To the remaining sentences they then apply a fragment detection method which tries to distinguish between source fragments that have a translation on the target side, and fragments that do not.",
        "The biggest difference between the MT situation and the D2T situation is that in the latter sentence-aligned parallel resources exist and can be used as a starting point.",
        "E.g. Munteanu & Marcu use an existing parallel Romanian-English corpus to (automatically) create a lexicon from which is then used in various ways in their method.",
        "In D2T we have no analogous resources to help us get started, and the methods described in this paper use no such prior knowledge."
      ]
    },
    {
      "heading": "3. A Comparable Corpus of British Hills",
      "text": [
        "As a source of data, we use the Database of British Hills (BHDB) created by Chris Crocker, version 11.3, which currently contains measurements and other information about 5,614 British hills.",
        "Additionally, we perform reverse geocoding via the Google Map API which allows us to convert latitude and longitude information from the hills database into country and region names.",
        "We add the latter to each database entry.",
        "On the text side, we use Wikipedia texts in the WikiProject British and Irish Hills (retrieved on 2009-11-09).",
        "There are currently 899 pages covered by this WikiProject, 242 of which are of quality category B or above.",
        "Matching up data records and documents:",
        "Matching up the data records in the BHDB with articles in Wikipedia is not trivial: not all BHDB entries have corresponding Wikipedia articles, different hills often share the same name, and the same hill can have different names and spellings.",
        "We perform a search of Wikipedia with the hill's name as the search term, using the Mediawiki API, and then retain the top n search results returned (currently n = 1).",
        "The top search result is not always a correct match for the database record.",
        "We",
        "Hill of Stake is a hill on the boundary between North Ayrshire and Renfrewshire , Scotland .",
        "It is 522 metres ( 1712 feet ) high .",
        "It is one of the Marilyns of Lowland Scotland .",
        "It is the highest point of the relatively low-lying county of Renfrewshire and indeed the entire Clyde Muirshiel Regional Park of which it is a part.",
        "Table 1: Output of step 1: data record from British Hills DB and matched Wikipedia text (Hill of Stake).",
        "manually selected the pairs we are confident are a correct match.",
        "This left us with 759 matched pairs out of a possible 899.",
        "Table 1 shows an example of an automatically matched database entry and Wikipedia article.",
        "It illustrates the non-parallelism discussed in the preceding section; e.g. there is no information in the database corresponding to the last sentence."
      ]
    },
    {
      "heading": "4. Towards a Parallelised Corpus",
      "text": [
        "In the second processing step, we pair up data fields and sentences.",
        "Related methods in mt have translation lexicons and thesauri that can be used as bridges between SL and TL texts, but there is no equivalents in NLG.",
        "Our current method associates each data field with a handwritten 'match predicate'.",
        "For example, the match predicate for height-metres returns True if the sentence contains the words 'X metres' (among other patterns), where X is some number within 5% of the height of the hill in the database.",
        "We retain only the sentences that match at least one data field.",
        "Table 2 shows what the data field/sentence alignment procedure outputs for the Hill of Stake.",
        "While it was fine for step 2 to produce some rough matches, in step 3, parallel fragment detection, the aim is to retain only those parts of a sentence that can be said to realise some data field(s) in the set of data fields with which it has been matched.",
        "Computing data-text associations: Following some preprocessing of sentences where each occurrence of a hill's name and height is replaced by lexical class tokens _name_, _height_metres_ or -height_feet_, the first step is to construct a kind of lexicon of pairs (d, w) of data fields d and words w, such that w is often seen in the realisation of d. For this purpose we adapt Munteanu & Marcu's (2006) method for (language to language) lexicon construction.",
        "For this purpose we compute a measure of the strength of association between data fields and words; we use the G log-likelihood ratio which has been widely used for this sort of purpose (especially lexical association) since it was introduced to NLP (Dunning, 1993).",
        "Following Moore (2004a) rather than Munteanu & Marcu, our current notion of cooccurrence is that a data field and word cooccur if they are present in the same pair of data fields and sentence (as identified by the method described in Section 4.1 above).",
        "We then obtain counts for the number of times each word cooccurs with each data field, and the number of times it occurs without the data field being present (and conversely).",
        "This allows us to compute the G score, for which we use the formulation from Moore (2004b) shown in Figure 2.",
        "If the G score for a given (d, w) pair is greater than p(d)p(w), then the association is taken to be positive, i.e. w is likely to be a realisation of d, otherwise the association is taken to be negative, i.e. w is likely not to be part of a realisation of d.",
        "For each d we then convert G scores to probabilities by dividing G by the appropriate normalising factor (the sum over all negative G scores for d for obtaining the negative association probabilities, and analogously for positive associations).",
        "Table 3 shows the three words with the highest positive association probabilities for each of our six data fields.",
        "Note that these are not the three most likely alternative 'translations' of each data key, but rather the three words which are most likely to be part of a realisation of a data field, if seen in conjunction with it.",
        "Identifying realisations: The next step is to apply these probabilities to identify those parts of a sentence that are likely to be a valid realisation of the data fields in the input.",
        "In Figure 3 we plot the positive and negative association probabilities for one of the sentences from our running example, Hill of Stake.",
        "The light grey graph represents the association probabilities between each word in the sentence and height-feet, the dark grey line those between the words in the sentence and height-metres.",
        "We plot the negative association probabilities simply by multiplying each by – 1.",
        "The part of the sentence that one would want to extract as a possible realisation of",
        "{ height-metres, height-feet }, namely \"_HEIGHTJVIETRES_ metres ( _HEIGHT_FEET_ feet )",
        "high\", shows up clearly as a sequence of relatively strong positive association values.",
        "Our current approach identifies such contiguous positive",
        "Figure 3: Positive and negative association probabilities plotted against the words they were computed for.",
        "association scores and extracts the corresponding sentence fragments.",
        "This works well in many cases, but is too simple as a general approach; we are currently developing this method further."
      ]
    },
    {
      "heading": "5. Concluding Remarks",
      "text": [
        "In this paper we have been interested in the problem ofautomatically obtaining parallel corpora for data-to-text generation.",
        "We presented our comparable corpus of 759 paired database entries and human-authored articles about British Hills.",
        "We described the three techniques which we have implemented so far and which we combine to extract parallel data-text fragments from the corpus: (i) identification of candidate pairs of data fields and sentences; (ii) computing scores for the strength of association between data and words; and (iii) identifying sequences of words in sentences that have positive association scores with the given data fields.",
        "\"main-name-only\": \"Hill of Stake\", \"country\": \"Scotland\"",
        "_name_ is a hill on the boundary between North Ayrshire and Renfrewshire, Scotland.",
        "\"height-metres\": 522, \"height-feet\": 1713",
        "It is _height^4ETERS_ metres (_height_feet_ feet) high.",
        "\"country\": \"Scotland\",",
        "\"classification\": [\"Ma\", \"CoH\", \"CoU\"]",
        "It is one of the Marilyns of Lowland Scotland.",
        "\"main-name-only\": \"Hill of Stake\"",
        "It is the highest point of the relatively low-lying county of Renfrewshire and indeed the entire Clyde Muirshiel Regional Park of which it is a part.",
        "Data key d",
        "Word w",
        "P+(w\\d)",
        "main-name-only",
        "jjame_",
        "0.1355",
        "a",
        "0.0742",
        "in",
        "0.0660",
        "classification",
        "as",
        "0.0412",
        "adjoining",
        "0.0193",
        "qualifies",
        "0.0177",
        "region",
        "District",
        "0.1855",
        "Lake",
        "0.1661",
        "area",
        "0.1095",
        "country",
        "in",
        "0.1640",
        "jjame_",
        "0.1122",
        "Scotland",
        "0.0732",
        "height-metrès",
        "metres",
        "0.1255",
        "m",
        "0.0791",
        "height",
        "0.0679",
        "height-feet",
        "feet",
        "0.1511",
        "_height^4eters_",
        "0.0974",
        "(",
        "0.0900"
      ]
    }
  ]
}
