{
  "info": {
    "authors": [
      "Hailong Cao",
      "Andrew Finch",
      "Eiichiro Sumita"
    ],
    "book": "Proceedings of the 4th Workshop on Syntax and Structure in Statistical Translation",
    "id": "acl-W10-3804",
    "title": "Syntactic Constraints on Phrase Extraction for Phrase-Based Machine Translation",
    "url": "https://aclweb.org/anthology/W10-3804",
    "year": 2010
  },
  "references": [
    "acl-D07-1079",
    "acl-D07-1103",
    "acl-D09-1024",
    "acl-N03-1017",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1033",
    "acl-P05-1034",
    "acl-P05-1069",
    "acl-P06-1077",
    "acl-P06-1121",
    "acl-P06-2014",
    "acl-P07-1003",
    "acl-P07-1089",
    "acl-P07-2045",
    "acl-P08-1009",
    "acl-P08-1064",
    "acl-P08-1114",
    "acl-P09-1036",
    "acl-P09-1058",
    "acl-P09-2060",
    "acl-W04-3243",
    "acl-W06-1606",
    "acl-W06-3119",
    "acl-W08-0306",
    "acl-W08-0334",
    "acl-W08-0409",
    "acl-W99-0604"
  ],
  "sections": [
    {
      "text": [
        "Syntactic Constraints on Phrase Extraction for Phrase-Based",
        "Machine Translation",
        "Hailong Cao, Andrew Finch and Eiichiro Sumita",
        "Language Translation Group, MASTAR Project National Institute of Information and Communications Technology",
        "{hlcao,andrew.finch,eiichiro.sumita }@nict.go.jp",
        "A typical phrase-based machine translation (PBMT) system uses phrase pairs extracted from word-aligned parallel corpora.",
        "All phrase pairs that are consistent with word alignments are collected.",
        "The resulting phrase table is very large and includes many non-syntactic phrases which may not be necessary.",
        "We propose to filter the phrase table based on source language syntactic constraints.",
        "Rather than filter out all non-syntactic phrases, we only apply syntactic constraints when there is phrase segmentation ambiguity arising from unaligned words.",
        "Our method is very simple and yields a 24.38% phrase pair reduction and a 0.52 BLEU point improvement when compared to a baseline PBMT system with full-size tables."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Both PBMT models (Koehn et al., 2003; Chiang, 2005) and syntax-based machine translation models (Yamada et al., 2000; Quirk et al., 2005; Galley et al., 2006; Liu et al., 2006; Marcu et al., 2006; and numerous others) are the state-of-the-art statistical machine translation (SMT) methods.",
        "Over the last several years, an increasing amount of work has been done to combine the advantages of the two approaches.",
        "DeNeefe et al.",
        "(2007) made a quantitative comparison of the phrase pairs that each model has to work with and found it is useful to improve the phrasal coverage of their string-to-tree model.",
        "Liu et al.",
        "(2007) proposed forest-to-string rules to capture the non-syntactic phrases in their tree-to-string model.",
        "Zhang et al.",
        "(2008) proposed a tree sequence based tree-to-tree model which can describe non-syntactic phrases with syntactic structure information.",
        "The converse of the above methods is to incorporate syntactic information into the PBMT model.",
        "Zollmann and Venugopal (2006) started with a complete set of phrases as extracted by traditional PBMT heuristics, and then annotated the target side of each phrasal entry with the label of the constituent node in the target-side parse tree that subsumes the span.",
        "Marton and Resnik (2008) and Cherry (2008) imposed syntactic constraints on the PBMT system by making use of prior linguistic knowledge in the form of syntax analysis.",
        "In their PBMT decoders, a candidate translation gets an extra credit if it respects the source side syntactic parse tree but may incur a cost if it violates a constituent boundary.",
        "Xiong et al.",
        "(2009) proposed a syntax-driven bracketing model to predict whether a phrase (a sequence of contiguous words) is bracketable or not using rich syntactic constraints.",
        "In this paper, we try to utilize syntactic knowledge to constrain the phrase extraction from word-based alignments for PBMT system.",
        "Rather than filter out all non-syntactic phrases, we only apply syntactic constraints when there is phrase segmentation ambiguity arising from unaligned words.",
        "Our method is very simple and yields a 24.38% phrase pair reduction and a 0.52 BLEU point improvement when compared to the baseline PBMT system with full-size tables."
      ]
    },
    {
      "heading": "2. Extracting Phrase Pairs from Word-based Alignments",
      "text": [
        "In this section, we briefly review a simple and effective phrase pair extraction algorithm upon which this work builds.",
        "The basic translation unit of a PBMT model is the phrase pair, which consists of a sequence of source words, a sequence of target words and a vector of feature values which represents this pair's contribution to the translation model.",
        "In typical PBMT systems such as MOSES (Koehn, 2007), phrase pairs are extracted from word-aligned parallel corpora.",
        "Figure 1 shows the form of training example.",
        "Since there is no phrase segmentation information in the word-aligned sentence pair, in practice all pairs of \"source word sequence ||| target word sequence\" that are consistent with word alignments are collected.",
        "The words in a legal phrase pair are only aligned to each other, and not to words outside (Och et al., 1999).",
        "For example, given a sentence pair and its word alignments shown in Figure1, the following nine phrase pairs will be extracted:",
        "Source phrase ||| Target phrase fl III el ~ _fl f2 III el e2_",
        "Table l: Phrase pairs extracted from the example in Figure l",
        "Note that neither the source phrase nor the target phrase can be empty.",
        "So \"f3 III EMPTY\" is not a legal phrase pair.",
        "Phrase pairs are extracted over the entire training corpus.",
        "Given all the collected phrase pairs, we can estimate the phrase translation probability distribution by relative frequency.",
        "The collected phrase pairs will also be used to build the lexicalized reordering model.",
        "For more details of the lexicalized reordering model, please refer to Tillmann and Zhang (2005) and section 2.7.2 of the MOSES's manuall.",
        "The main problem of such a phrase pair extraction procedure is the resulting phrase translation table is very large, especially when a large quantity of parallel data is available.",
        "This is not desirable in real application where speed and memory consumption are often critical concerns.",
        "In addition, some phrase translation pairs are generated from training data errors and word alignment noise.",
        "Therefore, we need to filter the phrase table in an appropriate way for both efficiency and translation quality (Johnson et al., 2007; Yang and Zheng, 2009)."
      ]
    },
    {
      "heading": "3. Syntactic Constraints on Phrase Pair Extraction",
      "text": [
        "We can divide all the possible phrases into two types: syntactic phrases and non-syntactic phrases.",
        "A \"syntactic phrase\" is defined as a word sequence that is covered by a single subtree in a syntactic parse tree (Imamura, 2002).",
        "Intuitively, we would think syntactic phrases are much more reliable while the non-syntactic phrases are useless.",
        "However, (Koehn et al., 2003) showed that restricting phrasal translation to only syntactic phrases yields poor translation performance - the ability to translate non-syntactic phrases (such as \"there are\", \"note that\", and \"according to\") turns out to be critical and pervasive.",
        "(Koehn et al., 2003) uses syntactic constraints from both the source and target languages, and over 80% of all phrase pairs are eliminated.",
        "In this section, we try to use syntactic knowledge in a less restrictive way.",
        "Firstly, instead of using syntactic restriction on both source phrases and target phrases, we only apply syntactic restriction to the source language side.",
        "Secondly, we only apply syntactic restriction to the source phrase whose first or last word is unaligned.",
        "For example, given a parse tree illustrated in Figure 2, we will filter out the phrase pair \"f2 f3 III e2\" since the source phrase \"f2 f3\" is a non-syntactic phrase and its last word \"f3\" is not",
        "l http://www.statmt.org/moses/",
        "Source phrase ||| Target phrase aligned to any target word.",
        "The phrase pair \"fl f2 f3 ||| el e2\" will also be eliminated for the same reason.",
        "But we do keep phrase pairs such as \"fl f2 ||| el e2\" even if its source phrase \"fl f2\" is a non-syntactic phrase.",
        "Also, we keep \"f3 f4 ||| e3\" since \"f3 f4\" is a syntactic phrase.",
        "Table 2 shows the completed set of phrase pairs that are extracted with our constraint-based method.",
        "The state-of-the-art alignment tool such as GIZA++ can not always find alignments for every word in the sentence pair.",
        "The possible reasons could be: its frequency is too low, noisy data, auxiliary words or function words which have no obvious correspondence in the opposite language.",
        "In the automatically aligned parallel corpus, unaligned words are frequent enough to be noticeable (see section 4.l in this paper).",
        "How to decide the translation of unaligned word is left to the phrase extraction algorithm.",
        "An unaligned source word should be translated together with the words on the right of it or the words on the left of it.",
        "The existing algorithm considers both of the two directions.",
        "So both \"f2 f3 ||| e2\" and \"f3 f4 ||| e3\" are extracted.",
        "However, it is unlikely that \"f3\" can be translated into both \"e2\" and \"e3\".",
        "So our algorithm uses prior syntactic knowledge to keep \"f3 f4 ||| e3\" and exclude \"f2 f3 ||| e2\"."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "Our SMT system is based on a fairly typical phrase-based model (Finch and Sumita, 2008).",
        "For the training of our SMT model, we use a modified training toolkit adapted from the MOSES decoder.",
        "Our decoder can operate on the same principles as the MOSES decoder.",
        "Minimum error rate training (MERT) with respect to BLEU score is used to tune the decoder's parameters, and it is performed using the standard technique of Och (2003).",
        "A lexicalized reordering model was built by using the \"msd-bidirectional-fe\" configuration in our experiments.",
        "The translation model was created from the FBIS parallel corpus.",
        "We used a 5-gram language model trained with modified Kneser-Ney smoothing.",
        "The language model was trained on the target side of the FBIS corpus and the Xinhua news in the GIGAWORD corpus.",
        "The development and test sets are from the NIST MT08 evaluation campaign.",
        "Table 3 shows the statistics of the corpora used in our experiments.",
        "The Chinese sentences are segmented, POS tagged and parsed by the tools described in Kruof which are trained on the Penn Chinese Treebank 6.0.",
        "Data",
        "Sentences",
        "Chinese words",
        "English words",
        "Training set",
        "22l,994",
        "6,25l,554",
        "8,065,629",
        "Development set",
        "l,664",
        "38,779",
        "46,387",
        "Test set",
        "l,357",
        "32,377",
        "42,444",
        "GIGAWORD",
        "l9,049,757",
        "-",
        "306,22l,306",
        "We use GIZA++ to align the sentences in both the Chinese-English and English-Chinese directions.",
        "Then we combine the alignments using the standard \"grow-diag-final-and\" procedure provided with MOSES.",
        "In the combined word alignments, 6l4,369 or 9.82% of the Chinese words are unaligned.",
        "Table 4 shows the top l0 most frequently unaligned words.",
        "Basically, these words are auxiliary words or function words whose usage is very flexible.",
        "So it would be difficult to automatically align them to the target words.",
        "In order to confirm that it is advantageous to apply appropriate syntactic constraints on phrase extraction, we performed three translation experiments by using different ways of phrase extraction.",
        "In the first experiment, we used the method introduced in Section 2 to extract all possible phrase translation pairs without using any constraints arising from knowledge of syntax.",
        "The second experiment used source language syntactic constraints to filter out all non-syntactic phrases during phrase pair extraction.",
        "The third experiment used source language syntactic constraints to filter out only non-syntactic phrases whose first or last source word was unaligned.",
        "With the exception of the above differences in phrase translation pair extraction, all the other settings were the identical in the three experiments.",
        "Table 5 summarizes the SMT performance.",
        "The evaluation metric is case-sensitive BLEU-4 (Papineni et al., 2002) which estimates the accuracy of translation output with respect to a set of reference translations.",
        "As shown in the table, it is harmful to fully apply syntactic constraints on phrase extraction, even just on the source language side.",
        "This is consistent with the observation of (Koehn et al., 2003) who applied both source and target constraints in German to English translation experiments.",
        "Clearly, we obtained the best performance if we use source language syntactic constraints only on phrases whose first or last source word is unaligned.",
        "In addition, we reduced the number of distinct phrase pairs by 24.38% over the baseline full-size phrase table.",
        "The results in table 5 show that while some non-syntactic phrases are very important to maintain the performance of a PBMT system, not all of them are necessary.",
        "We can achieve better performance and a smaller phrase table by applying syntactic constraints when there is phrase segmentation ambiguity arising from unaligned words."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "To some extent, our idea is similar to Ma et al.",
        "(2008), who used an anchor word alignment model to find a set of high-precision anchor links and then aligned the remaining words relying on dependency information invoked by the acquired anchor links.",
        "The similarity is that both Ma et al.",
        "(2008) and this work utilize structure information to find appropriate translations for words which are difficult to align.",
        "The difference is that they used dependency information in the word alignment stage while our method uses syntactic information during the phrase pair extraction stage.",
        "There are also many works which leverage syntax information to improve word alignments (e.g., Cherry and Lin, 2006; DeNero and Klein, 2007; Fossum et al., 2008; Hermjakob, 2009).",
        "Syntactic Constraints",
        "Number of distinct phrase pairs",
        "BLEU",
        "None",
        "l4,l95,686",
        "l7.26",
        "Full constraint",
        "4,855,l08",
        "l6.5l",
        "Selectively constraint",
        "l0,733,73l",
        "l7.78",
        "Unaligned word",
        "Frequency",
        "77776",
        "•>",
        "2905l",
        "94l4",
        " – ",
        "8768",
        "8543",
        "7",
        "747l",
        "7365",
        "7",
        "6l55",
        "7",
        "5945",
        "7",
        "5450",
        "Johnson et al., (2007) presented a technique for pruning the phrase table in a PBMT system using Fisher's exact test.",
        "They compute the significance value of each phrase pair and prune the table by deleting phrase pairs with significance values smaller than a certain threshold.",
        "Yang and Zheng (2008) extended the work in Johnson which is built on synchronous context free grammars (SCFG).",
        "Tomeh et al., (2009) described an approach for filtering phrase tables in a statistical machine translation system, which relies on a statistical independence measure called Noise, first introduced in (Moore, 2004).",
        "The difference between the above research and this work is they took advantage of some statistical measures while we use syntactic knowledge to filter phrase tables."
      ]
    },
    {
      "heading": "6. Conclusion and Future Work",
      "text": [
        "Phrase pair extraction plays a very important role on the performance of PBMT systems.",
        "We utilize syntactic knowledge to constrain the phrase extraction from word-based alignments for a PBMT system.",
        "Rather than filter out all non-syntactic phrases, we only filter out non-syntactic phrases whose first or last source word is unaligned.",
        "Our method is very simple and yields a 24.38% phrase pair reduction and a 0.52 BLEU point improvement when compared to the baseline PBMT system with full-size tables.",
        "In the future work, we will use other language pairs to test our phrase extraction method so that we can discover whether or not it is language independent."
      ]
    }
  ]
}
