{
  "info": {
    "authors": [
      "Georgiana Dinu",
      "Mirella Lapata"
    ],
    "book": "EMNLP",
    "id": "acl-D10-1113",
    "title": "Measuring Distributional Similarity in Context",
    "url": "https://aclweb.org/anthology/D10-1113",
    "year": 2010
  },
  "references": [
    "acl-C00-2137",
    "acl-D08-1094",
    "acl-D09-1045",
    "acl-J07-2002",
    "acl-J98-1004",
    "acl-N10-1013",
    "acl-P08-1028",
    "acl-P10-1097",
    "acl-P10-2017",
    "acl-P98-2127",
    "acl-W07-2009",
    "acl-W09-0215",
    "acl-W09-2506"
  ],
  "sections": [
    {
      "text": [
        "Georgiana Dinu Mirella Lapata",
        "Saarland University University of Edinburgh",
        "Saarbrücken, Germany Edinburgh, UK",
        "The computation of meaning similarity as operationalized by vector-based models has found widespread use in many tasks ranging from the acquisition of synonyms and paraphrases to word sense disambiguation and textual entailment.",
        "Vector-based models are typically directed at representing words in isolation and thus best suited for measuring similarity out of context.",
        "In his paper we propose a probabilistic framework for measuring similarity in context.",
        "Central to our approach is the intuition that word meaning is represented as a probability distribution over a set of latent senses and is modulated by context.",
        "Experimental results on lexical substitution and word similarity show that our algorithm outperforms previously proposed models."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The computation of meaning similarity as operationalized by vector-based models has found widespread use in many tasks within natural language processing (NLP).",
        "These range from the acquisition of synonyms (Grefenstette, 1994; Lin, 1998) and paraphrases (Lin and Pantel, 2001) to word sense disambiguation (Schuetze, 1998), textual entailment (Clarke, 2009), and notably information retrieval (Salton et al., 1975).",
        "The popularity of vector-based models lies in their unsupervised nature and ease of computation.",
        "In their simplest incarnation, these models represent the meaning of each word as a point in a high-dimensional space, where each component corresponds to some co-occurring contextual element (Landauer and Dumais, 1997; McDonald, 2000; Lund and Burgess, 1996).",
        "The advantage of taking such a geometric approach is that the similarity of word meanings can be easily quantified by measuring their distance in the vector space, or the cosine of the angle between them.",
        "Vector-based models do not explicitly identify the different senses of words and consequently represent their meaning invariably (i.e., irrespective of co-occurring context).",
        "Consider for example the adjective heavy which we may associate with the general meaning of \"dense\" or \"massive\".",
        "However, when attested in context, heavy may refer to an overweight person (e.g., She is short and heavy but she has a heart of gold.)",
        "or an excessive cannabis user (e.g., Some heavy users develop a psychological dependence on cannabis.",
        ").",
        "Recent work addresses this issue indirectly with the development of specialized models that represent word meaning in context (Mitchell and Lapata, 2008; Erk and Pado, 2008; Thater et al., 2009).",
        "These methods first extract typical co-occurrence vectors representing a mixture of senses and then use vector operations to either obtain contextualized representations of a target word (Erk and Pado, 2008) or a representation for a set of words (Mitchell and",
        "Lapata, 2009).",
        "In this paper we propose a probabilistic framework for representing word meaning and measuring similarity in context.",
        "We model the meaning of isolated words as a probability distribution over a set of latent senses.",
        "This distribution reflects the a priori, out-of-context likelihood of each sense.",
        "Because sense ambiguity is taken into account directly in the vector construction process, contextualized meaning can be modeled naturally as a change in the original sense distribution.",
        "We evaluate our approach on word similarity (Finkelstein et al., 2002) and lexical substitution (McCarthy and Navigli, 2007) and show improvements over competitive baselines.",
        "In the remainder of this paper we give a brief overview of related work, emphasizing vector-based approaches that compute word meaning in context (Section 2).",
        "Next, we present our probabilistic framework and different instantiations thereof (Sections 3 and 4).",
        "Finally, we discuss our experimental results (Sections 5 and 6) and conclude the paper with future work."
      ]
    },
    {
      "heading": "2. Related work",
      "text": [
        "Vector composition methods construct representations that go beyond individual words (e.g., for phrases or sentences) and thus by default obtain word meanings in context.",
        "Mitchell and Lapata (2008) investigate several vector composition operations for representing short sentences (consisting of intransitive verbs and their subjects).",
        "They show that models performing point-wise multiplication of component vectors outperform earlier proposals based on vector addition (Landauer and Du-mais, 1997; Kintsch, 2001).",
        "They argue that multiplication approximates the intersection of the meaning of two vectors, whereas addition their union.",
        "Mitchell and Lapata (2009) further show that their models yield improvements in language modeling.",
        "Erk and Padó (2008) employ selectional preferences to contextualize occurrences of target words.",
        "For example, the meaning of a verb in the presence of its object is modeled as the multiplication of the verb's vector with the vector capturing the inverse selectional preferences of the object; the latter are computed as the centroid of the verbs that occur with this object.",
        "Thater et al.",
        "(2009) improve on this model by representing verbs in a second order space, while the representation for objects remains first order.",
        "The meaning of a verb boils down to restricting its vector to the features active in the argument noun (i.e., dimensions with value larger than zero).",
        "More recently, Reisinger and Mooney (2010) present a method that uses clustering to produce multiple sense-specific vectors for each word.",
        "Specifically, a word's contexts are clustered to produce groups of similar context vectors.",
        "An average prototype vector is then computed separately for each cluster, producing a set of vectors for each word.",
        "These cluster vectors can be used to determine the semantic similarity of both isolated words and words in context.",
        "In the second case, the distance between prototypes is weighted by the probability that the context belongs to the prototype's cluster.",
        "Erk and Padó (2010) propose an exemplar-based model for capturing word meaning in context.",
        "In contrast to the prototype-based approach, no clustering takes place, it is assumed that there are as many senses as there are instances.",
        "The meaning ofaword in context is the set of exemplars most similar to it.",
        "Unlike Reisinger and Mooney (2010) and Erk and Padó (2010) our model is probabilistic (we represent word meaning as a distribution over a set of latent senses), which makes it easy to integrate and combine with other systems via mixture or product models.",
        "More importantly, our approach is conceptually simpler as we use a single vector representation for isolated words as well as for words in context.",
        "A word's different meanings are simply modeled as changes in its sense distribution.",
        "We should also point out that our approach is not tied to a specific sense induction method and can be used with different variants of vector-space models."
      ]
    },
    {
      "heading": "3. Meaning Representation in Context",
      "text": [
        "In this section we first describe how we represent the meaning of individual words and then move on to discuss our model of inducing meaning representations in context.",
        "Observed Representations Most vector space models in the literature perform computations on a co-occurrence matrix where each row represents a target word, each column a document or another neighboring word, and each entry their co-occurrence frequency.",
        "The raw counts are typically mapped into the components of a vector in some space using for example conditional probability, the log-likelihood ratio or tf-idf weighting.",
        "Under this representation, the similarity of word meanings can be easily quantified by measuring their distance in the vector space, the cosine of the angle between them, or their scalar product.",
        "Our model assumes the same type of input data, namely a co-occurrence matrix, where rows correspond to target words and columns to context features (e.g., co-occurring neighbors).",
        "Throughout this paper we will use the notation ti with i : to refer to a target word and Cj with j : 1..J to refer to context features.",
        "A cell (i, j) in the matrix represents the frequency of occurrence of target ti with context feature Cj over a corpus.",
        "Meaning Representation over Latent Senses We further assume that the target words ti i : found in a corpus share a global set of meanings or senses Z = {zk\\k : 1...K}.",
        "And therefore the meaning of individual target words can be described as a distribution over this set of senses.",
        "More formally, a target ti is represented by the following vector:",
        "where component P(z\\\\ti) is the probability of sense zi given target word ti, component P(z2\\ti) the probability of sense z2 given ti and so on.",
        "The intuition behind such a representation is that a target word can be described by a set of core meanings and by the frequency with which these are attested.",
        "Note that the representation in (1) is not fixed but parametrized with respect to an input corpus (i.e., it only reflects word usage as attested in that corpus).",
        "The senses zi... zK are latent and can be seen as a means of reducing the dimensionality of the original co-occurrence matrix.",
        "Analogously, we can represent the meaning of a target word given a context feature as:",
        "Here, target ti is again represented as a distribution over senses, but is now modulated by a specific context Cj which reflects actual word usage.",
        "This distribution is more \"focused\" compared to (1); the context helps disambiguate the meaning of the target word, and as a result fewer senses will share most of the probability mass.",
        "In order to create the context-aware representations defined in (2) we must estimate the probabilities P(zk\\ti,Cj) which can be factorized as the product of Pzk), the joint probability of target tiand latent sense zk, and P(cj \\zk,ti), the conditional probability of context Cj given target ti and sense zk :",
        "Problematically, the term P(Cj \\zkis difficult to estimate since it implies learning a total number of K x I J-dimensional distributions.",
        "We will therefore make the simplifying assumption that target words ti and context features Cj are conditionally independent given sense zk:",
        "Although not true in general, the assumption is relatively weak.",
        "We do not assume that words and context features occur independently of each other, but only that they are generated independently given an assigned meaning.",
        "A variety of latent variable models can be used to obtain senses zi... zK and estimate the distributions P(zk \\ti) and P(Cj\\ zk); we give specific examples in Section 4.",
        "Note that we abuse terminology here, as the senses our models obtain are not lexicographic meaning distinctions.",
        "Rather, they denote coarsegrained senses or more generally topics attested in the document collections our model is trained on.",
        "Furthermore, the senses are not word-specific but global (i.e., shared across all words) and modulated either within or out of context probabilistically via estimating P (zk \\ ti, Cj ) and P (zk \\ respectively."
      ]
    },
    {
      "heading": "4. Parametrizations",
      "text": [
        "The general framework outlined above can be parametrized with respect to the input co-occurrence matrix and the algorithm employed for inducing the latent structure.",
        "Considerable latitude is available when creating the co-occurrence matrix, especially when defining its columns, i.e., the linguistic contexts a target word is attested with.",
        "These contexts can be a small number of words surrounding the target word (Lund and Burgess, 1996; Lowe and McDonald, 2000), entire paragraphs, documents (Salton et al., 1975; Landauer and Dumais, 1997) or even syntactic dependencies (Grefenstette, 1994; Lin, 1998; Padó and Lapata, 2007).",
        "Analogously, a number of probabilistic models can be employed to induce the latent senses.",
        "Examples include Probabilistic Latent Semantic Analysis (PLSA, Hofmann (2001)), Probabilistic Principal Components Analysis (Tipping and Bishop, 1999), non-negative matrix factorization (NMF, Lee and Seung (2000)), and latent Dirichlet allocation (LDA, Blei et al.",
        "(2003)).",
        "We give a more detailed description of the latter two models as we employ them in our experiments.",
        "Non-negative Matrix Factorization Nonnegative matrix factorization algorithms approximate a non-negative input matrix V by two non-negative factors W and H, under a given loss function.",
        "W and H are reduced-dimensional matrices and their product can be regarded as a compressed form of the data in V:",
        "where W is a basis vector matrix and H is an encoded matrix of the basis vectors in equation (5).",
        "Several loss functions are possible, such as mean squared error and Kullback-Leibler (KL) divergence.",
        "In keeping with the formulation in Section 3 we opt for a probabilistic interpretation of NMF (Gaussier and Goutte, 2005; Ding et al., 2008) and thus minimize the KL divergence between WH and V.",
        "Specifically, we interpret matrix V as Vij = P(ti, Cj), and matrices W and H as P(ti, zk) and P (cj |zk), respectively.",
        "We can also obtain the following more detailed factorization:",
        "P(ti,Cj) = Efc P(ti)P(Zfc |ti)P(Cj |zfc).",
        "Le WH denote the factors in a NMF decomposition of an input matrix V and B be a diagonal matrix with Bkk = Ej Hkj.",
        "B-1H gives a row-normalized version of H. Similarly, given matrix WB, we can define a diagonal matrix A, with Aii = Ek(WB)ik.",
        "A-1WB row-normalizes matrix WB.",
        "The factorization WH can now be rewritten as:",
        "which allows us to interpret A as P(ti), A-1WB as P(zk|ti) and B-1H as P(cj |zk).",
        "These interpretations are valid since the rows of A-1WB and of B-1H sum to 1, matrix A is diagonal with trace 1 because elements in WH sum to 1, and all entries are non-negative.",
        "Latent Dirichlet Allocation LDA (Blei et al., 2003) is a probabilistic model of text generation.",
        "Each document d is modeled as a distribution over K topics, which are themselves characterized by distributions over words.",
        "The individual words in a document are generated by repeatedly sampling a topic according to the topic distribution and then sampling a single word from the chosen topic.",
        "More formally, we first draw the mixing proportion over topics 9d from a Dirichlet prior with parameters a.",
        "Next, for each of the Nd words wdn in document d, a topic zdn is first drawn from a multinomial distribution with parameters 9dn.",
        "The probability of a word token w taking on value i given that topic z = j is parametrized using a matrix ß with bij = P(w = i|z = j).",
        "Integrating out 6d's and zdn's, gives P(D|a, ß), the probability of a corpus (or document collection):",
        "The central computational problem in topic modeling is to obtain the posterior distribution P(6, z|w, a, ß) of the hidden variables z = (z1, z2,..., zN).",
        "given a document w = (w1,w2,...,wn).",
        "Although this distribution is intractable in general, a variety of approximate inference algorithms have been proposed in the literature.",
        "We adopt the Gibbs sampling procedure discussed in Griffiths and Steyvers (2004).",
        "In this model, P(w = i|z = j) is also a Dirichlet mixture (denoted (/>) with symmetric priors (denoted ß).",
        "We use LDA to induce senses of target words based on context words, and therefore each row ti in the input matrix transforms into a document.",
        "The frequency of ti occurring with context feature Cj is the number of times word Cj is encountered in the \"document\" associated with ti.",
        "We train the LDA model on this data to obtain the 6 and ( distributions.",
        "6 gives the sense distributions of each target ti: 6ik = P(zk|ti) and 0 the context-word distribution for each sense zk: 0kj = P(cj|zk)."
      ]
    },
    {
      "heading": "5. Experimental Set-up",
      "text": [
        "In this section we discuss the experiments we performed in order to evaluate our model.",
        "We describe the tasks on which it was applied, the corpora used for model training and our evaluation methodology.",
        "Tasks The probabilistic model presented in Section 3 represents words via a set of induced senses.",
        "We experimented with two types of semantic space based on NMF and LDA and optimized parameters for these models on a word similarity task.",
        "The latter involves judging the similarity sim(ti, ti) = sim(v(ti), v(ti)) of words ti and ti out of context, where v(ti) and v(ti) are obtained from the output of NMF or LDA, respectively.",
        "In our experiments we used the data set of Finkelstein et al.",
        "(2002).",
        "It contains 353 pairs of words and their similarity scores as perceived by human subjects.",
        "The contextualized representations were next evaluated on lexical substitution (McCarthy and Navigli, 2007).",
        "The task requires systems to find appropriate substitutes for target words occurring in context.",
        "Typically, systems are given a set of substitutes, and must produce a ranking such that appropriate substitutes are assigned a higher rank compared to non-appropriate ones.",
        "We made use of the SemEval 2007 Lexical Substitution Task benchmark data set.",
        "It contains 200 target words, namely nouns, verbs, adjectives and adverbs, each of which occurs in 10 distinct sentential contexts.",
        "The total set contains 2,000 sentences.",
        "Five human annotators were asked to provide substitutes for these target words.",
        "Table 1 gives an example of the adjective still and its substitutes.",
        "Following Erk and Padó (2008), we pool together the total set of substitutes for each target word.",
        "Then, for each instance the model has to produce a ranking for the total substitute set.",
        "We rank the candidate substitutes based on the similarity of the contextualized target and the out-of-context substitute, sim(v(ti, Cj), v(ti)), where ti is the target word, Cj a context word and ti a substitute.",
        "Contextualizing just one of the words brings higher discriminative power to the model rather than performing compar-",
        "Sentences Substitutes",
        "Table 1: Lexical substitution data example for the adjective still; numbers in parentheses indicate the frequency of the substitute.",
        "isons with the target and its substitute embedded in an identical context (see also Thater et al.",
        "(2010) for a similar observation).",
        "Model Training All the models we experimented with use identical input data, i.e., a bag-of-words matrix extracted from the GigaWord collection of news text.",
        "Rows in this matrix are target words and columns are their co-occurring neighbors, within a symmetric window of size 5.",
        "As context words, we used a vocabulary of the 3,000 most frequent words in the corpus.",
        "We implemented the classical NMF factorization algorithm described in Lee and Seung (2000).",
        "The input matrix was normalized so that all elements summed to 1.",
        "We experimented with four dimensions K: [600 - 1000] with step size 200.",
        "We ran the algorithm for 150 iterations to obtain factors W and H which we further processes as described in Section 4 to obtain the desired probability distributions.",
        "Since the only parameter of the NMF model is the factorization dimension K, we performed two independent runs with each K value and averaged their predictions.",
        "The parameters for the LDA model are the number of topics K and Dirichlet priors a and ß.",
        "We experimented with topics K: [600 – 1400], again with step size 200.",
        "We fixed ß to 0.01 and tested two values for a: K (Porteous et al., 2008) and (Griffiths and Steyvers, 2004).",
        "We used Gibbs sampling on the \"document collection\" obtained from the input matrix and estimated the sense distributions as described in Section 4.",
        "We ran the chains for 1000 iter-",
        "the LDA models.",
        "All models use this reduced size input data.",
        "It is important to apply the herbicide on a still day, because spray drift can kill non-target plants.",
        "calm (5) not-windy (1) windless (1)",
        "A movie is a visual document comprised of a series of still images.",
        "motionless (3) unmoving (2) fixed (1) stationary (1) static (1)",
        "ations and averaged over five iterations [600 – 1000] at lag 100 (we observed no topic drift).",
        "We measured similarity using the scalar product, cosine, and inverse Jensen-Shannon (IJS) divergence (see (7), (8), and (9), respectively):",
        "where m is a shorthand for 2 (v + w) and KL the Kullback-Leibler divergence, KL(v|w) = Ei vi1og( W ).",
        "Among the above similarity measures, the scalar product has the most straightforward interpretation as the probability of two targets sharing a common meaning (i.e., the sum over all possible meanings).",
        "The scalar product assigns 1 to a pair of identical vectors if and only if P(zi) = 1 for some i and P(zj) = 0, Vj = i.",
        "Thus, only fully disam-biguatedwords receive ascore of1.",
        "Beyond similarity, the measure also reflects how \"focused\" the distributions in question are, as very ambiguous words are unlikely to receive high scalar product values.",
        "Given a set of context words, we contextualize the target using one context word at a time and compute the overall similarity score by multiplying the individual scores.",
        "Baselines Our baseline models for measuring similarity out of context are Latent Semantic Analysis (Landauer and Dumais, 1997) and a simple semantic space without any dimensionality reduction.",
        "For LSA, we computed the US V SVD decomposition of the original matrix to rank k = 1000.",
        "Any decomposition of lower rank can be obtained from this by setting rows and columns to 0.",
        "We evaluated decompositions to ranks K: [200 – 1000], at each 100 step.",
        "Similarity computations were performed in the lower rank approximation matrix USV, as originally proposed in Deerwester et al.",
        "(1990), and in matrix U which maps the words into the concept space.",
        "It is common to compute SVD decompositions on matrices to which prior weighting schemes have been applied.",
        "We experimented with tf-idf weighting and line normalization.",
        "Our second baseline, the simple semantic space, was based on the original input matrix on which we applied several weighting schemes such as point-wise mutual information, tf-idf, and line normalization.",
        "Again, we measured similarity using cosine, scalar product and inverse JS divergence.",
        "In addition, we also experimented with Lin's (1998) similarity measure:",
        "where the values in v and w are point-wise mutual information, and I(•) gives the indices of positive values in a vector.",
        "Our baselines for contextualized similarity were vector addition and vector multiplication which we performed using the simple semantic space (Mitchell and Lapata, 2008) and dimensionality reduced representations obtained from NMF and LDA.",
        "To create a ranking of the candidate substitutes we compose the vector of the target with its context and compare it with each substitute vector.",
        "Given a set of context words, we contextualize the target using each context word at a time and multiply the individual scores.",
        "Evaluation Method For the word similarity task we used correlation analysis to examine the relationship between the human ratings and their corresponding vector-based similarity values.",
        "We report Spearman's p correlations between the similarity values provided by the models and the mean participant similarity ratings in the Finkelstein et al.",
        "(2002) data set.",
        "For the lexical substitution task, we compare the system ranking with the gold standard ranking using Kendall's Tb rank correlation (which is adjusted for tied ranks).",
        "For all contextualized models we defined the context of a target word as the words occurring within a symmetric context window of size 5.",
        "We assess differences between models using stratified shuffling (Yeh, 2000).",
        "Table 2: Results on out of context word similarity using a simple co-occurrence based vector space model (SVS), latent semantic analysis, non-negative matrix factorization and latent Dirichlet allocation as individual models with the best parameter setting (LSA, NMF, LDA) and as mixtures (LSAmix, NMFmix, LDAmix)."
      ]
    },
    {
      "heading": "6. Results",
      "text": [
        "Word Similarity Our results on word similarity are summarized in Table 2.",
        "The simple cooccurrence based vector space (SVS) performed best with tf-idf weighting and the cosine similarity measure.",
        "With regard to LSA, we obtained best results with initial line normalization of the matrix, K = 600 dimensions, and the scalar product similarity measure while performing computations in matrix U.",
        "Both NMF and LDA models are generally better with a larger number of senses.",
        "NMF yields best performance with K = 1000 dimensions and the scalar product similarity measure.",
        "The best LDA model also uses the scalar product, has K = 1200 topics, and a set to .",
        "Following Reisinger and Mooney (2010), we also evaluated mixture models that combine the output of models with varying parameter settings.",
        "For both NMF and LDA we averaged the similarity scores returned by all runs.",
        "For comparison, we also present an LSA mixture model over the (best) middle interval K values.",
        "As can be seen, the LSA model improves slightly, whereas NMF and LDA perform worse than their best individual models.",
        "Overall, we observe that NMF and LDA yield significantly (p < 0.01) better correlations than LSA and the sim-",
        "Table 3: Results on lexical substitution using a simple semantic space model (SVS), additive and multiplicative compositional models with vector representations based on co-occurrences (Add-SVS, Mult-SVS), NMF (Add-",
        "NMF, Mult-NMF), and LDA (Add-LDA, Mult-LDA) and contextualized models based on NMF and LDA with the best parameter setting (Cont-NMF, Cont-LDA) and as mixtures (Cont-NMFMIX, Cont-LDAMIX).",
        "ple semantic space, both as individual models and as mixtures.",
        "Lexical Substitution Our results on lexical substitution are shown in Table 3.",
        "As a baseline we also report the performance of the simple semantic space that does not use any contextual information.",
        "This model returns the same ranking of the substitute candidates for each instance, based solely on their similarity with the target word.",
        "This is a relatively competitive baseline as observed by Erk and Padó (2008) and Thater et al.",
        "(2009).",
        "We report results with contextualized NMF and LDA as individual models (the best word similarity settings) and as mixtures (as described above).",
        "These are in turn compared against additive and multiplicative compositional models.",
        "We implemented an additive model with pmi weighting and Lin's similarity measure which is defined in an additive fashion.",
        "The multiplicative model uses tf-idf weighting and cosine similarity, which involves multiplication of vector components.",
        "Other combinations of weighting schemes and similarity measures delivered significantly lower results.",
        "We also report results for these models when using the NMF and LDA reduced representations.",
        "Model",
        "Spearman p",
        "SVS",
        "38.35",
        "LSA",
        "49.43",
        "NMF",
        "52.99",
        "LDA",
        "53.39",
        "lsamix",
        "49.76",
        "NMFmix",
        "51.62",
        "ldamix",
        "51.97",
        "Model",
        "Kendall's Tb",
        "SVS",
        "11.05",
        "Add-SVS",
        "12.74",
        "Add-NMF",
        "12.85",
        "Add-LDA",
        "12.33",
        "Mult-SVS",
        "14.41",
        "Mult-NMF",
        "13.20",
        "Mult-LDA",
        "12.90",
        "Cont-NMF",
        "14.95",
        "Cont-LDA",
        "13.71",
        "Cont-NMFMIX",
        "16.01",
        "Cont-LDAMIX",
        "15.53",
        "Table 4: Results on lexical substitution for different parts of speech with a simple semantic space model (SVS), two compositional models (Add-SVS, Mult-SVS), and contextualized mixture models with NMF and LDA (Cont-NMFMIX, Cont-LDAMIX), using Kendall's Tb correlation coefficient.",
        "All models significantly (p < 0.01) outperform the context agnostic simple semantic space (see",
        "SVS in Table 3).",
        "Mixture NMF and LDA models are significantly better than all variants of compositional models (p < 0.01); the individual models are numerically better, however the difference is not statistically significant.",
        "We also find that the multiplicative model using a simple semantic space (Mult-SVS) is the best performing compositional model, thus corroborating the results of Mitchell and Lapata (2009).",
        "Interestingly, dimensionality compositional models.",
        "This indicates that the better results we obtain are due to the probabilistic formulation of our contextualized model as a whole rather than the use of NMF or LDA.",
        "Finally, we observe that the Cont-NMF model is slightly better than Cont-LDA, however the difference is not statistically significant.",
        "To allow comparison with previous results reported on this data set, we also used the Generalized Average Precision (GAP, Kishida (2005)) as an evaluation measure.",
        "GAP takes into account the order of candidates ranked correctly by a hypothetical system, whereas average precision is only sensitive to their relative position.",
        "The best performing models are Cont-NMFMIX and Cont-LDAMIX obtaining a GAP of 42.7% and 42.9%, respectively.",
        "Erk and Padó (2010) report a GAP of 38.6% on this data set with their best model.",
        "Table 4 shows how the models perform across different parts of speech.",
        "While verbs and nouns seem to be most difficult, we observe higher gains from the use of contextualized models.",
        "Cont-LDAMIX obtains approximately 7% absolute gain for nouns and Cont-NMFMIX approximately 6% for verbs.",
        "All",
        "Table 5: Induced senses of jam and five most likely words given these senses using an LDA model; sense probabilities are shown in parentheses.",
        "contextualized models obtain smaller improvements for adjectives.",
        "For adverbs most models do not improve over the no-context setting, with the exception Cont-NMFMIX.",
        "Finally, we also qualitatively examined how the context words influence the sense distributions of target words using examples from the lexical substitution dataset and the output of an individual Cont-LDA model.",
        "In many cases, a target word starts with a distribution spread over a larger number of senses, while a context word shifts this distribution to one majority sense.",
        "Consider, for instance, the target noun jam in the following sentence:",
        "(1) With their transcendent, improvisational jams and Mayan-inspired sense of a higher, metaphysical purpose, the band's music delivers a spiritual sustenance that has earned them a very devoted core following.",
        "Table 5 shows the out-of-context senses activated for jam together with the five most likely words associated with them.",
        "Sense probabilities are also shown in parentheses.",
        "As can be seen, initially two traffic-related and two music-related senses are activated, however with low probabilities.",
        "In the presence of the context word band, we obtain a much more \"focused\" distribution, in which the MUSIC sense has 0.88 probability.",
        "The system ranks riff and gig as the most likely two substitutes for jam.",
        "The gold annotation also lists session as a possible substitute.",
        "In a large number of cases, the target is only partially disambiguated by a context word and this is also reflected in the resulting distribution.",
        "An example is the word bug which initially has a distribution triggering the SOFTWARE (0.09, computer, software, microsoft, windows) and DISEASE (0.06, disease, aids, virus, cause) senses.",
        "In the context of client, bug remains ambiguous between the senses SECRET-AGENCY (0.34, agent, secret, intelligence, FBI)) and SOFTWARE (0.29):",
        "Model",
        "Adv",
        "Adj",
        "Noun",
        "Verb",
        "SVS",
        "22.47",
        "14.38",
        "09.52",
        "7.98",
        "Add-SVS",
        "22.79",
        "14.56",
        "11.59",
        "10.00",
        "Mult-SVS",
        "22.85",
        "16.37",
        "13.59",
        "11.60",
        "Cont-NMFMIX",
        "26.13",
        "17.10",
        "15.16",
        "14.18",
        "Cont-LDAMIX",
        "21.21",
        "16.00",
        "16.31",
        "13.67",
        "Senses",
        "Word Distributions",
        "TRAFFIC (0.18) MUSIC (0.04) FAN (0.04) VEHICLE (0.04)",
        "road, traffic, highway, route, bridge music, song, rock, band, dance, play crowd, fan, people, wave, cheer, street car, truck, bus, train, driver, vehicle",
        "(2) We wanted to give our client more than just a list of bugs and an invoice – we wanted to provide an audit trail of our work along with meaningful productivity metrics.",
        "There are also cases where the contextualized distributions are not correct, especially when senses are domain specific.",
        "An example is the word function occurring in its mathematical sense with the context word distribution.",
        "However, the senses that are triggered by this pair all relate to the \"service\" sense of function.",
        "This is a consequence of the newspaper corpus we use, in which the mathematical sense of function is rare.",
        "We also see several cases where the target word and one of the context words are assigned senses that are locally correct, but invalid in the larger context.",
        "In the following example:",
        "(3) Check the shoulders so it hangs well, stops at hips or below, and make sure the pants are long enough.",
        "The pair (check, shoulder) triggers senses INJURY (0.81, injury, left, knee, shoulder) and BALL-SPORTS (0.10, ball, shot, hit, throw).",
        "However, the sentential context ascribes a meaning that is neither related to injury nor sports.",
        "This suggests that our models could benefit from more principled context feature aggregation.",
        "Generally, verbs are not as good context words as nouns.",
        "To give an example, we often encounter the pair (let, know), used in the common \"inform\" meaning.",
        "The senses we obtain for this pair, are, however, rather uninformative general verb classes: {see, know, think, do} (0.57) and {go, say, do, can} (0.20).",
        "This type of error can be eliminated in a space where context features are designed to best reflect the properties of the target words."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "In this paper we have presented a general framework for computing similarity in context.",
        "Key in this framework is the representation of word meaning as a distribution over a set of global senses where contextualized meaning is modeled as a change in this distribution.",
        "The approach is conceptually simple, the same vector representation is used for isolated words and words in context without being tied to a specific sense induction method or type of semantic space.",
        "We have illustrated two instantiations of this framework using non-negative matrix factorization and latent Dirichlet allocation for inducing the latent structure, and shown experimentally that they outperform previously proposed methods for measuring similarity in context.",
        "Furthermore, both of them benefit from mixing model predictions over a set of different parameter choices, thus making parameter tuning redundant.",
        "The directions for future work are many and varied.",
        "Conceptually, we have defined our model in an asymmetric fashion, i.e., by stipulating a difference between target words and contextual features.",
        "However, in practice, we used vector representations that do not distinguish the two: target words and contextual features are both words.",
        "This choice was made to facilitate comparisons with the popular bag-of-words vector space models.",
        "However, differentiating target from context representations may be beneficial particularly when the similarity computations are embedded within specific tasks such as the acquisition of paraphrases, the recognition of entailment relations, and thesaurus construction.",
        "Also note that our model currently contextualizes target words with respect to individual contexts.",
        "Ideally, we would like to compute the collective influence of several context words on the target.",
        "We plan to further investigate how to select or to better aggregate the entire set of features extracted from a context.",
        "Acknowledgments The authors acknowledge the support of the DFG (Dinu; International Research Training Group \"Language Technology and Cognitive Systems\") and EPSRC (Lapata; grant GR/T04540/01)."
      ]
    }
  ]
}
