{
  "info": {
    "authors": [
      "Glenn Slayden",
      "Mei-Yuh Hwang",
      "Lee Schwartz"
    ],
    "book": "Proceedings of the 1st Workshop on South and Southeast Asian Natural Language Processing",
    "id": "acl-W10-3602",
    "title": "Thai Sentence-Breaking for Large-Scale SMT",
    "url": "https://aclweb.org/anthology/W10-3602",
    "year": 2010
  },
  "references": [
    "acl-A97-1004",
    "acl-D08-1077",
    "acl-J97-2002",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P96-1041",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "text": [
        "thai-language.com",
        "Microsoft Research",
        "Thai language text presents challenges for integration into large-scale multi-language statistical machine translation (SMT) systems, largely stemming from the nominal lack of punctuation and inter-word space.",
        "For Thai sentence breaking, we describe a monolingual maximum entropy classifier with features that may be applicable to other languages such as Arabic, Khmer and Lao.",
        "We apply this sentence breaker to our large-vocabulary, general-purpose, bidirectional Thai-English SMT system, and achieve BLEU scores of around 0.20, reaching our threshold of releasing it as a free online service."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "NLP research has consolidated around the notion of the sentence as the fundamental unit of translation, a consensus which has fostered the development powerful statistical and analytical approaches which incorporate an assumption of deterministic sentence delineation.",
        "As such systems become more sophisticated, languages for which this assumption is challenged receive increased attention.",
        "Thai is one such language, since it uses space neither to distinguish syllables from words or affixes, nor to unambiguously signal sentence boundaries.",
        "Written Thai has no sentence-end punctuation, but a space character is always present between sentences.",
        "There is generally no space between words, but a space character may appear within a sentence according to linguistic or prescriptive orthographic motivation (Wathabunditkul 2003), and these characteristics disqualify sentence-breaking (SB) methods used for other languages, such as Palmer and Hearst (1997).",
        "Thai SB has therefore been regarded as the task of classifying each space that appears in a Thai source text as either sentence-breaking (sb) or non-sentence-breaking (nsb).",
        "Several researchers have investigated Thai SB.",
        "Along with a discussion of Thai word breaking (WB), Aroonmanakun (2007) examines the issue.",
        "With a human study, he establishes that sentence breaks elicited from Thai informants exhibit varying degrees of consensus.",
        "Mittra-piyanuruk and Sornlertlamvanich (2000) define part-of-speech (POS) tags for sb and nsb and train a trigram model over a POS-annotated corpus.",
        "At runtime, they use the Viterbi algorithm to select the POS sequence with the highest probability, from which the corresponding space type is read back.",
        "Charoenpornsawat and Sornler-tlamvanich (2001) apply Winnow, a multiplicative trigger threshold classifier, to the problem.",
        "Their model has ten features: the number of words to the left and right, and the left-two and right-two POS tags and words.",
        "We present a monolingual Thai SB based on a maximum entropy (ME) classifier (Ratnaparkhi 1996; Reynar and Ratnaparkhi, 1997) which is suitable for sentence-breaking SMT training data and runtime inputs.",
        "Our model uses a four token window of Thai lemmas, plus categorical features, to describe the proximal environment of the space token under consideration, allowing runtime classification of space tokens with possibly unseen contexts.",
        "As our SB model relies on Thai WB, we review our approach to this problem, plus related preprocessing, in the next section.",
        "Section 2 also discusses the complementary operation to WB, namely, the re-spacing of Thai text generated by SMT output.",
        "Section 3 details our SB model and evaluates its performance.",
        "We describe the integration of this work with our large-scale SMT system in Section 4.",
        "We draw conclusions in Section 5."
      ]
    },
    {
      "heading": "2. Pre-and Post-processing",
      "text": [
        "As will be shown in Section 3, our sentence breaker relies on Thai WB.",
        "In turn, with the aim of minimizing WB errors, we perform Unicode character sequence normalization prior to WB.",
        "As output byproducts, our WB analysis readily identifies certain types of named entities which we propagate into our THA-ENG SMT; in this section, we briefly summarize these preliminary processing steps, and we conclude the section with a discussion of Thai text re-spacing.",
        "Thai orthography uses an alphabet of 44 consonants and a number of vowel glyphs and tone marks.",
        "The four Thai tone marks and some Thai vowel characters are super and/or subscripted with respect to a base character.",
        "For example, the □ sequence consists of three code points:",
        "3 o o .",
        "When two or more of these combining marks are present on the same base character, the ordering of these code points in memory should be consistent so that orthographically identical entities are recognized as equivalent by computer systems.",
        "However, some computer word processors do not enforce the correct sequence or do not properly indicate incorrect sequences to the user visually.",
        "This often results in documents with invalid byte sequences.",
        "Correcting these errors is desirable for SMT inputs.",
        "In order to normalize Thai input character sequences to a canonical Unicode form, we developed a finite state transducer (FST) which detects and repairs a number of sequencing errors which render Thai text either orthographically invalid, or not in a correct Unicode sequence.",
        "For example, a superscripted Thai tone mark should follow a super-or subscripted Thai vowel when they both apply to the same consonant.",
        "When the input has the tone mark and the vowel glyph swapped, the input can be fully repaired:",
        "Other cases are ambiguous.",
        "The occurrence of multiple adjacent vowel glyphs is an error where the intention may not be clear.",
        "We retain the first-appearing glyph, unless it is a pre-posed vowel, in which case we retain the last-appearing instance.",
        "These two treatments are contrasted in Figure 2.",
        "Miscoding (Figure 3) is another variety of input error that is readily repaired.",
        "Within the Infoquest Thai newswire corpus, a low-noise corpus, about 0.05% of the lines exhibit at least one of the problems mentioned here.",
        "For some chunks of broad-range web scraped data, we observe rates as high as 4.1%.",
        "This measure is expected to under-represent the utility of the filter to WB, since Thai text streams, lacking intra-word spacing and permitting two unwritten vowels, have few realignment checkpoints, allowing tokenization state machines to linger in misaligned states.",
        "Thai text does not normally use the space character to separate words, except in certain specific contexts.",
        "Although Unicode offers the Zero-Width Space (ZWSP) as one solution for indicating word breaks in Thai, it is infrequently used.",
        "Programmatic tokenization has become a staple of Thai computational linguistics.",
        "The problem has been well studied, with precision and recall near 95% (Haruechaiyasak et al.",
        "2008).",
        "In our SMT application, both the sentence breaker and the SMT system itself require Thai WB, and we use the same word breaker for these tasks (although the system design currently prohibits directly passing tokens between these two components).",
        "Our method is to apply postprocessing heuristics to the output of Uniscribe (Bishop et al.",
        "2003), which is provided as part of the Microsoft® WindowsTM operating system interface.",
        "Our heuristics fall into two categories: \"re-gluing\" words that Uniscribe broke too aggressively, and a smaller class of cases of further breaking of words that Uniscribe did not break.",
        "Re-gluing is achieved by comparing Uniscribe output against a Thai lexicon in which desired breaks within a word are tagged.",
        "Underbreaking by Uniscribe is less common and is restricted to a number of common patterns which are repaired explicitly.",
        "In written Thai, certain types of entities employ prescriptive whitespace patterns.",
        "By removing these recognized patterns from consideration, SB precision can be improved.",
        "Furthermore, because our re-gluing procedure requires a lookup of every syllable proposed by Uniscribe, it is efficient to consider, during WB, additional processing that can be informed by the same lookup.",
        "Accordingly, we briefly mention some of the entity types that our WB identifies, focusing on those that incorporate distinctive spacing patterns.",
        "Person names in Thai adhere to a convention for the use of space characters.",
        "This helps Thai readers to identify the boundaries of multisyllable surnames that they may not have seen before.",
        "The following grammar summarizes the prescriptive conventions for names appearing in Thai text:",
        "<name-entity> ::= <honorific> <full-name> <full-name> ::= <first-name> [<last-name>] <first-name> ::= <name-text> space <last-name> ::= <name-text> space <name-text> ::= <thai-alphabetic-char> + <thai-alphabetic-char> ::= n | n | a | a | ...",
        "Figure 4.",
        "Name entity recognition grammar",
        "The re-glue lookup also determines if a syllable matches one of the following predefined special categories: name-introducing honorific (h), Thai or foreign given name (g), token which is likely to form part of a surname (s), or token which aborts the gathering of a name (i.e. is unlikely to form part of a name).",
        "Figure 5 shows a Thai name appearing within a text fragment, with Uniscribe detected token boundaries indicated by slashes.",
        "In the third row we have identified the special category, if any, for each token.",
        "The fourth line shows the English translation gloss, or <oov> if none.",
        "The bottom row is the desired translation output.",
        "Our name identifier first notes the presence of an honorific {h} ITIEJ followed by a pattern of tokens {g0-gn}, {s0-sn} and spaces {sp0, sp1} that is compatible with a person name and surname of sensible length.",
        "Next, we determine which of those tokens in the ranges {g} and {s} following the honorific do not have a gloss translation (i.e., are not found in the lexicon).",
        "These tokens are indicated by <oov> in the gloss above.",
        "When the number of unknown tokens exceeds a threshold, we hypothesize that these tokens form a name.",
        "The lack of lexical morphology in Thai facilitates this method because token (or syllable) lookup generally equates with the lookup of a stemmed lemma.",
        "Our WB also identifies Thai calendar dates, as these also exhibit a pattern which incorporates spaces.",
        "As a prerequisite to identifying dates, we map Thai orthographic digits {o a la P) d & \"e) eiJ Ga ft} to Arabic digits 0 through 9, respectively.",
        "For example, our system would interpret the input text la&do as equivalent to \"2540.\"",
        ".../tu/fu/W/ /14/ flinnu/ /la&do/ /nas/...",
        "...on I March l4th, 1997 | and...",
        "Figure 6.",
        "Date entity recognition",
        "Figure 6 shows a fragment of Thai text which contains a calendar date for which our system will emit a single token.",
        "As shown in the example, our system detects and adjusts for the use of Thai Buddhist year dates when necessary.",
        "Gathering of disparate and optional parts of the Thai date is summarized by the grammar in Figure 7.",
        "Figure 7.",
        "Date recognition grammar",
        "in",
        "141ËJ",
        "im",
        "i",
        "m",
        "in",
        "in",
        "h",
        "g0",
        "g1",
        "g2",
        "s1",
        "s2",
        "s3 sp1",
        "that",
        "<AOO>",
        "hi",
        "beloved",
        "<AOO>",
        "stable",
        "<AOO>",
        "<AOO>",
        "said",
        "...that",
        "Mr.",
        "_",
        "Chiranut",
        "_",
        "Winichotkun",
        "said...",
        "To conclude this section, we mention an operation complementary to Thai WB, whereby Thai words output by an SMT system must be re-spaced in accordance with Thai prescriptive convention.",
        "As will be mentioned in Section 4.2, for each input sentence, our English-Thai system has access to an English dependency parse tree, as well as links between this tree and a Thai transfer dependency tree.",
        "After using these links to transfer syntactic information to the Thai tree, we are able to apply prescriptive spacing rules (Wathabunditkul 2003) as closely as possible.",
        "Human evaluation showed satisfactory results for this process."
      ]
    },
    {
      "heading": "3. Maximum Entropy Sentence-Breaking",
      "text": [
        "We now turn to a description of our statistical sentence-breaking model.",
        "We train an ME classifier on features which describe the proximal environment of the space token under consideration and use this model at runtime to classify space tokens with possibly unseen contexts.",
        "Under the ME framework, let B={sb, nsb} represent the set of possible classes we are interested in predicting for each space token in the input stream.",
        "Let C={linguistic contexts} represent the set of possible contexts that we can observe, which must be encoded by binary features, fj(b, c), 1 < j <k, such as:",
        "1 if the previous word is English and b = nsb.",
        "0 otherwise.",
        "This feature helps us learn that the space after an English word is usually not a sentence boundary.",
        "This feature enables us to learn that spaces which follow an honorific are less likely to mark sentence boundaries.",
        "Assume the joint probabilityp(b,c) is modeled by where we have k free parameters {a,-} to estimate and Z is a normalization factor to make H^cPOfr,c) = 1 The ME learning algorithm finds a solution {a,-} representing the most uncertain commitment that satisfies the observed distribution p(ô, c) of the training data",
        "SX*».",
        "C)/>(i>.",
        "C) = S p(ù, C)/;(ù, C),1 < j < fe .",
        "This is solved via the Generalized Iterative Scaling algorithm (Darroch and Ratcliff 1972).",
        "At run-time, a space token is considered an sb, if and only if p(sb|c) > 0.5, where",
        "The core context of our model, { w, x, y, z}, is a window spanning two tokens to the left (positions w and x) and two tokens to the right (positions y and z) of a classification candidate space token.",
        "The possible values of each of the window positions { w, x, y, z} are shown in Table 1, where the first match to the token at the designated position is assigned as the feature value for that position.",
        "Foreign-text tokens plus any intervening space are merged, so a single \"ascii\" feature may represent an arbitrary amount of nonThai script with interior space.",
        "Figure 8 shows an example sentence that has been tokenized.",
        "Token boundaries are indicated by slashes.",
        "Although there are three space tokens in the original input, we extract four contexts.",
        "The shaded boxes in the source text – and the shaded line in the figure – indicate the single sb context that is synthesized by wrapping, to be described in Section 3.4.",
        "For each context, in addition to the { w, x, y, z} features, we extract two more features indicated by { l ,r} in Figure 8.",
        "They are the number of e distance to the previous honorific ess than 15 tokens and b = nsb 0 otherwise.",
        "tokens between the previous space token (wrapping as necessary) and the current one, and the number of tokens between the current space token and the next space token (wrapping as necessary).",
        "These features do not distinguish whether the bounding space token is sb or nsb.",
        "This is because, processing left-to-right, it is permissible to use a feature such as \"number of tokens since last sb,\" but not \"number of tokens until next sb,\" which would be available during training but not at runtime.",
        "c",
        "token characteristic",
        "yk",
        "Yamok (syllable reduplication) symbol *)",
        "space",
        "oft",
        "Thai numeric digits",
        "num",
        "Arabic numeric digits",
        "ABC",
        "Sequence of all capital ASCII characters",
        "cnn",
        "single character (derived from hex)",
        "ckkmmnn",
        "single character (derived from UTF8 hex)",
        "ascii",
        "any amount of non-Thai text",
        "(Thai text)",
        "Thai word (derived from lemma)",
        "anöfusnTjäioaouiJij R1C1 gnuflaoTflifluanafusm'j aïoâouijij A1",
        "\"R1C1 reference style was converted to A1 reference style.\"",
        "Figure 8.",
        "A Thai sentence and the training contexts extracted.",
        "Highlighting shows the context for sb.",
        "In addition to the above core features, our model emits certain extra features only if they appear:",
        "• An individual feature for each English punctuation mark, since these are sometimes used in Thai.",
        "For example, there is one feature for the sentence end period (i.e. full-stop);",
        "• The current nest depth for paired glyphs with directional variation, such as brackets, braces, and parentheses;",
        "• The current parity value for paired glyphs without directional distinction such as \"straight\" quotation marks.",
        "The following example illustrates paired directional glyphs (in this case, parentheses):",
        ".../yuSnas'/ /(/îhsivifl/ /Tviêj/)/ /innei/ /iHaiHCj/fi/... ...Unilever (Thailand) Ltd. disclosed that...",
        "nsb I ( ihavifl Tviej ) 1",
        "Figure 9.",
        "Text fragment illustrating paired directional glyphs and the context for the highlighted space",
        "In Figure 9, the space between llssiVlPf \"country\" and TviEJ \"Thai,\" generates an nsb context which includes the features shown, where \"pn\" is an extra feature which indicates the parenthesis nesting level.",
        "This feature helps the model learn that spaces which occur within parentheses are likely to be nsb.",
        "Parity features for the non-directional paired glyphs, which do nest, are true binary features.",
        "Since these features have only two possible values (inside or outside), they are only emitted when their value is \"inside,\" that is, when the space under consideration occurs between such a pair.",
        "Thai corpora which are marked with sentence breaks are required for training.",
        "We assembled a corpus of 361,802 probable sentences.",
        "This corpus includes purchased, publicly available, and web-crawled content.",
        "In total it contains 911,075 spaces, a figure which includes one intersentence space per sentence, generated as described below.",
        "For SB training, paragraphs are first tokenized into words as described in Section 2.2.",
        "This process does not introduce new spaces between tokens; only original spaces in the text are classified as sb/nsb and used for the context features described below.",
        "To keep this distinction clear, token boundaries are indicated by a slash rather than space in the examples shown in this paper.",
        "For 91% of our training sentences, the paragraphs from which they originate are inaccessible.",
        "In feature extraction for each of these sentences, we wrap the sentence's head around to its tail to obtain its sb context.",
        "In other words, for a sentence of tokens t0-tn-1, the context of sb (the last space) is given by { W=tn-2, X=tn-1, J=t), }.",
        "This process was illustrated in Figure 8.",
        "Although not an ideal substitute for sentences in context, this ensures that we extract at least one sb context per sentence.",
        "The number of nsb contexts extracted per sentence is equal to the number of interior space tokens in the original sentence.",
        "Sentence wrapping is not needed when training with sentence-delimited paragraph sources.",
        "Contexts sb and nsb are extracted from the token stream of the entire paragraph and wrapping is used only to generate one additional sb for the entire paragraph.",
        "b",
        "c=w",
        "c=x",
        "c=y",
        "c=z",
        "c=/",
        "c=r",
        "nsb",
        "So",
        "ABC",
        "sp",
        "5",
        "1",
        "nsb",
        "sp",
        "ABC",
        "Qn",
        "uiJao",
        "1",
        "9",
        "nsb",
        "So",
        "ABC",
        "sp",
        "9",
        "1",
        "sb",
        "ABC",
        "snafus",
        "m?",
        "1",
        "5",
        "Although evaluation against a single-domain corpus does not measure important design requirements of our system, namely resilience to broad-domain input texts, we evaluated against the ORCHID corpus (Charoenporn et al.",
        "1997) for the purpose of comparison with the existing literature.",
        "Following the methodology of the studies cited below, we use 10-fold x10% averaged testing against the ORCHID corpus.",
        "Our results are consistent with recent work using the Winnow algorithm, which itself compares favorably with the probabilistic POS tri-gram approach.",
        "Both of these studies use evaluation metrics, attributed to Black and Taylor (1997), which aim to more usefully measure sentence-breaker utility.",
        "Accordingly, the following definitions are used in Table 2:",
        "space-correct :",
        "false break= (#correct sb+#correct total # of space toke",
        "#sb false positives total # of space tokens",
        "It was generally possible to reconstruct precision and recall figures from these published results and we present a comprehensive table of results.",
        "Reconstructed values are marked with a dagger and the optimal result in each category is marked in boldface.",
        "Finally, we would be remiss in not acknowledging the general hazard of assigning sentence breaks in a language such as Thai, where source text authors may intentionally include or omit spaces in order to create syntactic or semantic ambiguity.",
        "We defer to Mittrapiyanuruk and Sornlertlamvanich (2000) and Aroonmanakun (2007) for informed commentary on this topic."
      ]
    },
    {
      "heading": "4. SMT System and Integration",
      "text": [
        "The primary application for which we developed the Thai sentence breaker described in this work is the Microsoft® BING™ general-domain machine translation service.",
        "In this section, we provide a brief overview of this large-scale SMT system, focusing on Thai-specific integration issues.",
        "Like many multilingual SMT systems, our system is based on hybrid generative/discriminative models.",
        "Given a sequence of foreign words, /, its best translation is the sequence of target words, e, that maximizes where the translation model p(/|e) is computed on dozens to hundreds of features.",
        "The target language model (LM), p(e), is represented by a smoothed n-grams (Chen 1996) and sometimes more than one LM is adopted in practice.",
        "To achieve the best performance, the log likelihoods evaluated by these features/models are linearly combined.",
        "After p(/|e) and p(e) are trained, the combination weights At are tuned on a held-out dataset to optimize an objective function, which we set to be the BLEU score (Papineni et al.",
        "where { r} is the set of gold translations for the given input source sentences.",
        "To learn At we use the algorithm described by Och (2003), where the decoder output at any point is approximated using n-best lists, allowing an optimal line search to be employed.",
        "Since we have a high-quality real-time rule-based English parser available, we base our English-to-Thai translation (ENG-THA) on the \"treelet\" concept suggested in Menezes and Quirk (2008).",
        "This approach parses the source language into a dependency tree which includes part-of-speech labels.",
        "Mittrapiyanuruk et al.",
        "Charoenpornsawat et al.",
        "Our result",
        "method",
        "POS Trigram",
        "Winnow",
        "MaxEnt",
        "#sb in reference",
        "10528",
        "1086+",
        "2133",
        "#space tokens",
        "33141",
        "3801",
        "7227",
        "nsb-precision",
        "90.27+",
        "91.48+",
        "93.18",
        "nsb-recall",
        "87.18+",
        "97.56+",
        "94.41",
        "sb-precision",
        "74.35+",
        "92.69+",
        "86.21",
        "sb-recall",
        "79.82",
        "77.27",
        "83.50",
        "\"space-correct\"",
        "85.26",
        "89.13",
        "91.19",
        "\"false-break\"",
        "8.75",
        "1.74",
        "3.94",
        "Lacking a Thai parser, we use a purely statistical phrasal translator after Pharaoh (Koehn 2004) for THA-ENG translation, where we adopt the name and date translation described in Sections 2.3 and 2.4.",
        "We also experimented with phrasal ENG-THA translation.",
        "Though we actually achieved a slightly better BLEU score than treelet for this translation direction, qualitative human evaluation by native speaker informants was mixed.",
        "We adopted the treelet ENG-THA in the final system, for its better re-spacing (Section 2.5).",
        "Naturally, our system relies on parallel text corpora to learn the mapping between two languages.",
        "The parallel corpus contains sentence pairs, corresponding to translations of each other.",
        "For Thai, quality corpora are generally not available in sufficient quality for training a generaldomain SMT system.",
        "For the ENG-THA pair, we resort to Internet crawls as a source of text.",
        "We first identify paired documents, break each document into sentences, and align sentences in one document against those in its parallel document.",
        "Bad alignments are discarded.",
        "Only sentence pairs with high alignment confidence are kept in our parallel corpus.",
        "Our sentence alignment algorithm is based on Moore (2002).",
        "For our ENG-THA translation system, we assembled three resources: a parallel training corpus, a development bitext (also called the lambda set) for training the feature combination weights {!",
        "(}, and a test corpus for BLEU and human evaluation.",
        "Both the lambda and the test sets have single reference translations per sentence.",
        "Although it is well known that language translation pairs are not symmetric, we use these same resources to build our THA-ENG translation system due to the lack of additional corpora.",
        "Our parallel MT corpus consists of approximately 725,000 English-Thai sentence pairs from various sources.",
        "Additionally we have 9.6 million Thai sentences, which are used to train a Thai 4-gram LM for ENG-THA translation, together with the Thai sentences in the parallel corpus.",
        "Trigrams and 4-grams that occur only once are pruned, and n-gram backoff weights are renormalized after pruning, with the surviving KN smoothed probabilities intact (Kneser and trained for THA-ENG translation, on a total of 45.6M English sentences.",
        "For both the lambda and test sets, THA LM incurs higher out-of-vocabulary (OOV) rates (1.6%) than ENG LM (0.7%), due to its smaller training set and thus smaller lexicon.",
        "Both translation directions define the maximum phrase/treelet length to be 4 and the maximum reordering jump to be 4 as well.",
        "To evaluate our end-to-end performance, we compute case insensitive 4-gram BLEU scores.",
        "Translation outputs are WB first according to the Thai/English tokenizer, before BLEU scores are computed.",
        "The BLEU scores on the test sets are shown in Table 4.",
        "We are not aware of any previously published BLEU results for either direction of this language pair.",
        "Figures 10 and 11 illustrate sample outputs for the each translation direction, with reference translations.",
        "INPUT: tuflssmflTwüfinaTüTrfibsonfu <a<u& Mum ffn",
        "OUTPUT: In Thailand a Orchid approximately 175 type if extinct from Thailand.",
        "It means extinct from the world.",
        "REF: In Thailand, there are about 175 species of Orchid.",
        "If they disappear from Thailand, they will be gone from the world.",
        "BLEU",
        "THA-ENG",
        "0.233",
        "ENG-THA",
        "0.194",
        "Data Set",
        "#Sentences",
        "(ENG||THA) training",
        "725K",
        "(ENG,THA) lambda",
        "2K",
        "(ENG,THA) test",
        "5K",
        "THA LM text",
        "10.3M",
        "ENG LM text",
        "45.6M",
        "INPUT: In our nation the problems and barriers we face are just problems and barriers of law not selection or development.",
        "OUTPUT: tuibsivieiînfiîjaom flnjwnuasaiJéîi'j'jfivim iwM^aüiM£jofl^^MiuasaiJa?",
        "?flMaongMwiüT^iaanMla",
        "REF: tufl5sm0îJaomflfljw^llas:slJ^il55Pl nifluiifijwi afliiss™io<>nunf|Wij~m ueiTmfluflfijwiafliii'j'jfitum'j"
      ]
    }
  ]
}
