{
  "info": {
    "authors": [
      "Fang Kong",
      "Guodong Zhou"
    ],
    "book": "EMNLP",
    "id": "acl-D10-1086",
    "title": "A Tree Kernel-Based Unified Framework for Chinese Zero Anaphora Resolution",
    "url": "https://aclweb.org/anthology/D10-1086",
    "year": 2010
  },
  "references": [
    "acl-C08-1088",
    "acl-D07-1057",
    "acl-D07-1076",
    "acl-P00-1022",
    "acl-P02-1014",
    "acl-P03-1023",
    "acl-P04-1043",
    "acl-P06-1006",
    "acl-W03-1024"
  ],
  "sections": [
    {
      "text": [
        "A Tree Kernel-based Unified Framework for Chinese Zero Anaphora Resolution",
        "Fang Kong Guodong Zhou*",
        "JiangSu Provincial Key Lab for Computer Information Processing Technology School of Computer Science and Technology Soochow University {kongfang, gdzhou}@suda.edu.cn",
        "This paper proposes a unified framework for zero anaphora resolution, which can be divided into three sub-tasks: zero anaphor detection, anaphoricity determination and antecedent identification.",
        "In particular, all the three subtasks are addressed using tree kernel-based methods with appropriate syntactic parse tree structures.",
        "Experimental results on a Chinese zero anaphora corpus show that the proposed tree kernel-based methods significantly outperform the feature-based ones.",
        "This indicates the critical role of the structural information in zero anaphora resolution and the necessity of tree kernel-based methods in modeling such structural information.",
        "To our best knowledge, this is the first systematic work dealing with all the three subtasks in Chinese zero anaphora resolution via a unified framework.",
        "Moreover, we release a Chinese zero anaphora corpus of 100 documents, which adds a layer of annotation to the manually-parsed sentences in the Chinese Treebank (CTB) 6.0."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "As one of the most important techniques in discourse analysis, anaphora resolution has been a focus of research in Natural Language Processing (NLP) for decades and achieved much success in English recently (e.g.",
        "Soon et al.",
        "2001; Ng and Cardie 2002; Yang et al.",
        "2003, 2008; Kong et al.",
        "2009).",
        "However, there is little work on anaphora resolution in Chinese.",
        "A major reason for this phe-",
        "Corresponding author",
        "nomenon is that Chinese, unlike English, is a prodrop language, whereas in English, definite noun phrases (e.g. the company) and overt pronouns (e.g. he) are frequently employed as referring expressions, which refer to preceding entities.",
        "Kim (2000) compared the use of overt subjects in English and Chinese.",
        "He found that overt subjects occupy over 96% in English, while this percentage drops to only 64% in Chinese.",
        "This indicates the prevalence of zero anaphors in Chinese and the necessity of zero anaphora resolution in Chinese anaphora resolution.",
        "Since zero anaphors give little hints (e.g. number or gender) about their possible antecedents, zero anaphora resolution is much more challenging than traditional anaphora resolution.",
        "Although Chinese zero anaphora has been widely studied in the linguistics research (Li and Thompson 1979; Li 2004), only a small body of prior work in computational linguistics deals with Chinese zero anaphora resolution (Converse 2006; Zhao and Ng 2007).",
        "Moreover, zero anaphor detection, as a critical component for real applications of zero anaphora resolution, has been largely ignored.",
        "This paper proposes a unified framework for Chinese zero anaphora resolution, which can be divided into three sub-tasks: zero anaphor detection, which detects zero anaphors from a text, ana-phoricity determination, which determines whether a zero anaphor is anaphoric or not, and antecedent identification, which finds the antecedent for an anaphoric zero anaphor.",
        "To our best knowledge, this is the first systematic work dealing with all the three subtasks via a unified framework.",
        "Moreover, we release a Chinese zero anaphora corpus of 100 documents, which adds a layer of annotation to the manually-parsed sentences in the Chinese Treebank (CTB) 6.0.",
        "This is done by assigning anaphoric/non-anaphoric zero anaphora labels to the null constituents in a parse tree.",
        "Finally, this paper illustrates the critical role of the structural information in zero anaphora resolution and the necessity of tree kernel-based methods in modeling such structural information.",
        "The rest of this paper is organized as follows.",
        "Section 2 briefly describes the related work on both zero anaphora resolution and tree kernelbased anaphora resolution.",
        "Section 3 introduces the overwhelming problem of zero anaphora in Chinese and our developed Chinese zero anaphora corpus, which is available for research purpose.",
        "Section 4 presents our tree kernel-based unified framework in zero anaphora resolution.",
        "Section 5 reports the experimental results.",
        "Finally, we conclude our work in Section 6."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "This section briefly overviews the related work on both zero anaphora resolution and tree kernelbased anaphora resolution.",
        "Although zero anaphors are prevalent in many languages, such as Chinese, Japanese and Spanish, there only have a few works on zero anaphora resolution.",
        "Zero anaphora resolution in Chinese Converse (2006) developed a Chinese zero anaphora corpus which only deals with zero anaphora category \"-NONE- *pro*\" for dropped subjects/objects and ignores other categories, such as \"-NONE- *PRO*\" for non-overt subjects in non-finite clauses.",
        "Besides, Converse (2006) proposed a rule-based method to resolve the anaphoric zero anaphors only.",
        "The method did not consider zero anaphor detection and anaphoric identification, and performed zero anaphora resolution using the Hobbs algorithm (Hobbs, 1978), assuming the availability of golden anaphoric zero anaphors and golden parse trees.",
        "Instead, Zhao and Ng (2007) proposed feature-based methods to zero anaphora resolution on the same corpus from Convese (2006).",
        "However, they only considered zero anaphors with explicit noun phrase referents and discarded those with split antecedents or referring to events.",
        "Moreover, they focused on the subtasks of anaphoricity determination and antecedent identification.",
        "For zero ana-phor detection, a simple heuristic rule was employed.",
        "Although this rule can recover almost all the zero anaphors, it suffers from very low precision by introducing too many false zero anaphors and thus leads to low performance in anaphoricity determination, much due to the imbalance between positive and negative training examples.",
        "Zero anaphora resolution in Japanese Seki et al.",
        "(2002) proposed a probabilistic model for the subtasks of anaphoric identification and antecedent identification with the help of a verb dictionary.",
        "They did not perform zero anaphor detection, assuming the availability of golden zero anaphors.",
        "Besides, their model needed a large-scale corpus to estimate the probabilities to prevent them from the data sparseness problem.",
        "Isozaki and Hirao (2003) explored some ranking rules and a machine learning method on zero anaphora resolution.",
        "However, they assumed that zero anaphors were already detected and each zero anaphor's grammatical case was already determined by a zero anaphor detector.",
        "Iida et al.",
        "(2006) explored a machine learning method for the subtask of antecedent identification using rich syntactic pattern features, assuming the availability of golden anaphoric zero anaphors.",
        "Sasano et al.",
        "(2008) proposed a fully-lexicalized probabilistic model for zero anaphora resolution, which estimated case assignments for the overt case components and the antecedents of zero ana-phors simultaneously.",
        "However, this model needed case frames to detect zero anaphors and a large-scale corpus to construct these case frames automatically.",
        "For Japanese zero anaphora, we do not see any reports about zero anaphora categories.",
        "Moreover, all the above related works we can find on Japanese zero anaphora resolution ignore zero anaphor detection, focusing on either anaphoricity determination or antecedent identification.",
        "Maybe, it is easy to detect zero anaphors in Japanese.",
        "However, it is out of the scope of our knowledge and this paper.",
        "Zero anaphora resolution in Spanish",
        "As the only work we can find, Ferrandez and Peral (2000) proposed a hand-engineered rule-based method for both anaphoricity determination and antecedent identification.",
        "That is, they ignored zero anaphor detection.",
        "Besides, they only dealt with zero anaphors that were in the subject position.",
        "Although there is no research on tree kernel-based zero anaphora resolution in the literature, tree kernel-based methods have been explored in traditional anaphora resolution to certain extent and achieved comparable performance with the dominated feature-based ones.",
        "One main advantage of kernel-based methods is that they are very effective at reducing the burden of feature engineering for structured objects.",
        "Indeed, the kernel-based methods have been successfully applied to mine structural information in various NLP techniques and applications, such as syntactic parsing (Collins and Duffy 2001; Moschitti 2004), semantic relation extraction (Zelenko et al.",
        "2003; Zhao and Grishman 2005; Zhou et al.",
        "2007; Qian et al.",
        "2008), and semantic role labeling (Moschitti 2004).",
        "Representative works in tree kernel-based anaphora resolution include Yang et al.",
        "(2006) and convolution tree kernel on anaphora resolution of pronouns.",
        "In particular, a document-level syntactic parse tree for an entire text was constructed by attaching the parse trees of all its sentences to a new-added upper node.",
        "Examination of three parse tree structures using different construction schemes (Min-Expansion, Simple-Expansion and Full-Expansion) on the ACE 2003 corpus showed promising results.",
        "However, among the three constructed parse tree structures, there exists no obvious overwhelming one, which can well cover structured syntactic information.",
        "One problem with this tree kernel-based method is that all the constructed parse tree structures are context-free and do not consider the information outside the subtrees.",
        "To overcome this problem, Zhou et al.",
        "(2008) proposed a dynamic-expansion scheme to automatically construct a proper parse tree structure for anaphora resolution of pronouns by taking predicate and antecedent competitor-related information into consideration.",
        "Besides, they proposed a context-sensitive convolution tree kernel to compute the similarity between the parse tree structures.",
        "Evaluation on the ACE 2003 corpus showed that the dynamic-expansion scheme can well cover necessary structural information in the parse tree for anaphora resolution of pronouns and the context-sensitive convolution tree kernel much outperformed other tree kernels."
      ]
    },
    {
      "heading": "3. Task Definition",
      "text": [
        "This section introduces the phenomenon of zero anaphora in Chinese and our developed Chinese zero anaphora corpus.",
        "A zero anaphor is a gap in a sentence, which refers to an entity that supplies the necessary information for interpreting the gap.",
        "Figure 1 illustrates an example sentence from Chinese TreeBank (CTB) 6.0 (File ID=001, Sentence ID=8).",
        "In this example, there are four zero anaphors denoted as <£>i (i=1, 2, ...4).",
        "Generally, zero anaphors can be understood from the context and do not need to be specified.",
        "A zero anaphor can be classified into either anaphoric or non-anaphoric, depending on whether it has an antecedent in the discourse.",
        "Typically, a zero anaphor is non-anaphoric when it refers to an extra linguistic entity (e.g. the first or second person in a conversion) or its referent is unspecified in the context.",
        "Among the four anaphors in Figure 1, zero anaphors <£> 1 and <£> 4 are non-anaphoric while zero anaphors <£>2 and <£>3 are anaphoric, referring to noun phrase \"jH^Efr^J/building action\" and noun phrase \"ir^lfSj^c/new district managing committee\" respectively.",
        "Chinese zero anaphora resolution is very difficult due to following reasons: 1) Zero anaphors give little hints (e.g. number or gender) about their possible antecedents.",
        "This makes antecedent identification much more difficult than traditional anaphora resolution.",
        "2) A zero anaphor can be either anaphoric or non-anaphoric.",
        "In our corpus described in Section 3.2, about 60% of zero anaphors are non-anaphoric.",
        "This indicates the importance of anaphoricity determination.",
        "3) Zero anaphors are not explicitly marked in a text.",
        "This indicates the necessity of zero anaphor detection, which has been largely ignored in previous research and has proved to be difficult in our later experiments.",
        "standardize ftiS | rhtt~ building market",
        "(the example is : Mmmm^,fà±&M3cmJlML, frEt^étëfëH^^flïfôW^Efé.^-âfit ÄW^pT^l^lSiSfÄWtft/ In order to standardize the building action and prevent the inorder phenomenon, the standing committee of new zone annouced a series of files to standardize building market based on the related provisions of China and Shanghai in time, and the realities of the development of Pudong are considered. )",
        "Due to lack of an available zero anaphora corpus for research purpose, we develop a Chinese zero anaphora corpus of 100 documents from CTB 6.0, which adds a layer of annotation to the manually-parsed sentences.",
        "Hoping the public availability of this corpus can push the research of zero anaphora resolution in Chinese and other languages.",
        "Table 1: Statistics on different categories of zero anaphora (AZA and ZA indicates anaphoric zero ana-phor and zero anaphor respectively) represents a null constituent and thus the occurrence of a zero anaphor.",
        "In our developed corpus, we need to annotate anaphoric zero anaphors using those null constituents with the special tag of \"NONE-\".",
        "ID",
        "Category",
        "Description",
        "AZ As",
        "ZAs",
        "1",
        "-NONE-",
        "Used in topicalization and object preposing constructions",
        "6",
        "742",
        "2",
        "-NONE*",
        "Used in raising and passive constructions",
        "1",
        "2",
        "3",
        "-NONE-*PRO*",
        "Used in control structures.",
        "The *PRO* cannot be substituted by an overt constituent.",
        "219",
        "399",
        "4",
        "-NONE-*pro*",
        "for dropped subject or object.",
        "394",
        "449",
        "5",
        "-NONE-",
        "*RNR*",
        "Used for right node raising (Cataphora)",
        "0",
        "36",
        "6",
        "Others",
        "Other unknown empty categories",
        "92",
        "92",
        "Total (100 documents, 35089 words)",
        "712",
        "1720",
        "Table 1 gives the statistics on all the six categories of zero anaphora.",
        "Since we do not consider zero cataphora in the current version, we simply redeem them non-anaphoric.",
        "It shows that among 1720 zero anaphors, only 712 (about 40%) are anaphoric.",
        "This suggests the importance of ana-phoricity determination in zero anaphora resolution.",
        "Table 3 further shows that, among 712 anaphoric zero anaphors, 598 (84%) are intra-sentential and no anaphoric zero anaphors have their antecedents occurring two sentences before._",
        "Figure 3 shows an example in our corpus corresponding to Figure 2.",
        "For a non-anaphoric zero anaphor, we replace the null constituent with \"E-i NZA\", where i indicates the category of zero anaphora, with \"1\" referring to \"-NONE *T*\" etc.",
        "For an anaphoric zero anaphor, we replace it with \"E-x-y-z-i AZA\", where x indicates the sentence id of its antecedent, y indicates the position of the first word of its antecedent in the sentence, z indicates the position of the last word of its antecedent in the sentence, and i indicates the category id of the null constituent."
      ]
    },
    {
      "heading": "4. Tree Kernel-based Framework",
      "text": [
        "This section presents the tree kernel-based unified framework for all the three subtasks in zero anaphora resolution.",
        "For each sub-task, different parse tree structures are constructed.",
        "In particular, the context-sensitive convolution tree kernel, as proposed in Zhou et al.",
        "(2008), is employed to compute the similarity between two parse trees via the SVM toolkit SVMLight.",
        "In the tree kernel-based framework, we perform the three sub-tasks, zero anaphor detection, ana-phoricity determination and antecedent identification in a pipeline manner.",
        "That is, given a zero anaphor candidate Z, the zero anaphor detector is first called to determine whether Z is a zero ana-phor or not.",
        "If yes, the anaphoricity determiner is then invoked to determine whether Z is an anaphoric zero anaphor.",
        "If yes, the antecedent identifier is finally awaked to determine its antecedent.",
        "In the future work, we will explore better ways of integrating the three subtasks (e.g. joint learning).",
        "At the first glance, it seems that a zero anaphor can occur between any two constituents in a parse tree.",
        "Fortunately, an exploration of our corpus shows that a zero anaphor always occurs just before a predicate phrase node (e.g. VP).",
        "This phenomenon has also been employed in Zhao and Ng (2007) in generating zero anaphor candidates.",
        "In particular, if the predicate phrase node occurs in a coordinate structure or is modified by an adverbial node, we only need to consider its parent.",
        "As shown in Figure 1, zero anaphors may occur immediately to the left ofÂîQ/guide, föfih/avoid, LBM/appear, MM /according to, inû /combine, LBc?",
        "/promulgate, which cover the four true zero anaphors.",
        "Therefore, it is simple but reliable in applying above heuristic rules to generate zero anaphor candidates.",
        "Given a zero anaphor candidate, it is critical to construct a proper parse tree structure for tree kernel-based zero anaphor detection.",
        "The intuition behind our parser tree structure for zero anaphor detection is to keep the competitive information about the predicate phrase node and the zero ana-phor candidate as much as possible.",
        "In particular, the parse tree structure is constructed by first keeping the path from the root node to the predicate phrase node and then attaching all the immediate verbal phrase nodes and nominal phrase nodes.",
        "Besides, for the sub-tree rooted by the predicate phrase node, we only keep those paths ended with verbal leaf nodes and the immediate verbal and nominal nodes attached to these paths.",
        "Figure 4 shows an example of the parse tree structure corresponding to Figure 1 with the zero anaphor candidate 02 in consideration.",
        "Sentence distance",
        "AZAs",
        "0",
        "598",
        "1",
        "114",
        ">=2",
        "0",
        "During training, if a zero anaphor candidate has a counterpart in the same position in the golden standard corpus (either anaphoric or non-anaphoric), a positive instance is generated.",
        "Otherwise, a negative instance is generated.",
        "During testing, each zero anaphor candidate is presented to the learned zero anaphor detector to determine whether it is a zero anaphor or not.",
        "Besides, since a zero anaphor candidate is generated when a predicate phrase node appears, there may be two or more zero anaphor candidates in the same position.",
        "However, there is normally one zero anaphor in the same position.",
        "Therefore, we just select the one with maximal confidence as the zero anaphor in the position and ignore others, if multiple zero anaphor candidates occur in the same position.",
        "Figure 4: An example parse tree structure for zero ana-phor detection with the predicate phrase node and the zero anaphor candidate ®2 in black Anaphoricity determination",
        "To determine whether a zero anaphor is anaphoric or not, we limit the parse tree structure between the previous predicate phrase node and the following predicate phrase node.",
        "Besides, we only keep those verbal phrase nodes and nominal phrase nodes.",
        "Figure 5 illustrates an example of the parse tree structure for anaphoricity determination, corresponding to Figure 1 with the zero anaphor 02 in consideration.",
        "phenomenon",
        "Figure 5: An example parse tree structure for anaphoric-ity determination with the zero anaphor 0 2 in consideration",
        "To identify an antecedent for an anaphoric zero anaphor, we adopt the Dynamic Expansion Tree, as proposed in Zhou et al.",
        "(2008), which takes predicate-and antecedent competitor-related information into consideration.",
        "Figure 6 illustrates an example parse tree structure for antecedent identification, corresponding to Figure 1 with the anaphoric zero anaphor 0 2 and the antecedent candidate \"jH^tfr Ä/building action\" in consideration.",
        "Figure 6: An example parse tree structure for antecedent identification with the anaphoric zero anaphor 02 and the antecedent candidate \"ilSïffÂ/buûding action\" in consideration",
        "In this paper, we adopt a similar procedure as Soon et al.",
        "(2001) in antecedent identification.",
        "BeAnaphoricity determination sides, since all the anaphoric zero anaphors have their antecedents at most one sentence away, we only consider antecedent candidates which are at most one sentence away.",
        "In particular, a document-level parse tree for an entire document is constructed by attaching the parse trees of all its sentences to a new-added upper node, as done in Yang et al.",
        "(2006), to deal with inter-sentential ones."
      ]
    },
    {
      "heading": "5. Experimentation and Discussion",
      "text": [
        "We have systematically evaluated our tree kernel-based unified framework on our developed Chinese zero anaphora corpus, as described in Section 3.2.",
        "Besides, in order to focus on zero anaphor resolution itself and compare with related work, all the experiments are done on golden parse trees provided by CTB 6.0.",
        "Finally, all the performances are achieved using 5-fold cross validation.",
        "Zero anaphor detection",
        "Table 4 gives the performance of zero anaphor detection, which achieves 70.05%, 83.24% and 76.08 in precision, recall and F-measure, respectively.",
        "Here, the lower precision is much due to the simple heuristic rules used to generate zero anaphors candidates.",
        "In fact, the ratio of positive and negative instances reaches about 1:12.",
        "However, this ratio is much better than that (1:30) using the heuristic rule as described in Zhao and Ng (2007).",
        "It is also worth to point out that lower precision higher recall is much beneficial than higher precision lower recall as higher recall means less filtering of true zero anaphors and we can still rely on anaphoricity determination to filter out those false zero ana-phors introduced by lower precision in zero ana-phor detection.___",
        "Table 5 gives the performance of anaphoricity determination.",
        "It shows that anaphoricity determination on golden zero anaphors achieves very good performance of 89.83%, 84.21% and 86.93 in precision, recall and F-measure, respectively, although useful information, such as gender and number, is not available in anaphoricity determination.",
        "This indicates the critical role of the structural information in anaphoricity determination of zero anaphors.",
        "It also shows that anaphoricity determination on automatic zero anaphor detection achieves 77.96%, 53.97% and 63.78 in precision, recall and F-measure, respectively.",
        "In comparison with ana-phoricity determination on golden zero anaphors, anaphoricity determination on automatic zero ana-phor detection lowers the performance by about 23 in F-measure.",
        "This indicates the importance and the necessity for further research in zero anaphor detection.",
        "Antecedent identification",
        "Table 6 gives the performance of antecedent identification given golden zero anaphors.",
        "It shows that antecedent identification on golden anaphoric zero anaphors achieves 88.93%, 68.36% and 77.29 in precision, recall and F-measure, respectively.",
        "It also shows that antecedent identification on automatic anaphoricity determination achieves 80.38%, 47.28% and 59.24 in precision, recall and F-measure, respectively, with a decrease of about 8% in precision, about 21% in recall and about 18% in F-measure, in comparison with antecedent identification on golden anaphoric zero anaphors.",
        "This indicates the critical role of anaphoricity determination in antecedent identification.",
        "Overall: zero anaphora resolution Table 7 gives the performance of overall zero anaphora resolution with automatic zero anaphor detection, anaphoricity determination and antecedent identification.",
        "It shows that our tree kernelbased framework achieves 77.66%, 31.74% and 45.06 in precision, recall and F-measure.",
        "In comparison with Table 6, it shows that the errors caused by automatic zero anaphor detection decrease the performance of overall zero anaphora resolution by about 14 in F-measure, in comparison with golden zero anaphors.",
        "P%",
        "R%",
        "F",
        "golden zero anaphors",
        "89.83",
        "84.21",
        "86.93",
        "zero anaphor detection",
        "77.96",
        "53.97",
        "63.78",
        "P%",
        "R%",
        "F",
        "golden anaphoric zero ana-phors",
        "88.90",
        "68.36",
        "77.29",
        "anaphoricity determination",
        "80.38",
        "47.28",
        "59.54",
        "P%",
        "R%",
        "F",
        "70.05",
        "83.24",
        "76.08",
        "Figure 7 shows the learning curve of zero anaphora resolution with the increase of the number of the documents in experimentation, with the horizontal axis the number of the documents used and the vertical axis the F-measure.",
        "It shows that the F-measure is about 42.5 when 20 documents are used in experimentation.",
        "This figure increases very fast to about 45 when 50 documents are used while further increase of documents only slightly improves the performance.",
        "Figure 7: Learning curve of zero anaphora resolution over the number of the documents in experimentation",
        "Table 8 shows the detailed performance of zero anaphora resolution over different sentence distance between a zero anaphor and its antecedent.",
        "It is expected that both the precision and the recall of intra-sentential resolution are much higher than those of inter-sentential resolution, largely due to the much more dependency of intra-sentential an-",
        "Table 9 shows the detailed performance of zero anaphora resolution over the two major zero anaphora categories, \"-NONE- *PRO*\" and \"NONE- *pro*\".",
        "It shows that our tree kernel-based framework achieves comparable performance on them, both with high precision and low recall.",
        "This is in agreement with the overall performance.",
        "ID I Category I P% I R% I F major zero anaphora categories",
        "As a representative in Chinese zero anaphora resolution, Zhao and Ng (2007) focused on anaphoric-ity determination and antecedent identification using feature-based methods.",
        "In this subsection, we will compare our tree kernel-based framework with theirs in details.",
        "Zhao and Ng (2007) used a private corpus from Converse (2006).",
        "Although their corpus contains 205 documents from CBT 3.0, it only deals with the zero anaphors under the zero anaphora category of \"-NONE- *pro*\" for dropped subjects/objects.",
        "Furthermore, Zhao and Ng (2007) only considered zero anaphors with explicit noun phrase referents and discarded zero anaphors with split antecedents (i.e. split into two separate noun phrases) or referring to entities.",
        "As a result, their corpus is only about half of our corpus in the number of zero anaphors and anaphoric zero anaphors.",
        "Besides, our corpus deals with all the types of zero anaphors and all the categories of zero anaphora except zero cataphora.",
        "Zhao and Ng (2007) applied feature-based methods on anaphoricity determination and antecedent identification with most of features structural in nature.",
        "For zero anaphor detection, they used a very simple heuristic rule to generate zero anaphor candidates.",
        "Although this rule can recover almost all the zero anaphors, it suffers from very low precision by introducing too many false zero anaphors and thus may lead to low performance in anaphoricity determination, much due to the imbalance between positive and negative training examples with the ratio up to about 1:30.",
        "In comparison, we propose a tree kernel-based unified framework for all the three subtasks in zero anaphora resolution.",
        "In particular, different parse tree structures are constructed for different sub-tasks.",
        "Besides, a context sensitive convolution tree kernel is employed to directly compute the similarity between the parse trees.",
        "For fair comparison with Zhao and Ng (2007), we duplicate their system and evaluate it on our developed Chinese zero anaphora corpus, using the same J48 decision tree learning algorithm in Weka and the same feature sets for anaphoricity determination and antecedent identification.",
        "P%",
        "R%",
        "F",
        "77.66",
        "31.74",
        "45.06",
        "Sentence distance",
        "P%",
        "R%",
        "F",
        "0",
        "85.12",
        "33.28",
        "47.85",
        "1",
        "46.55",
        "23.64",
        "31.36",
        "2",
        "-",
        "-",
        "-",
        "Table 10 gives the performance of the feature-based method, as described in Zhao and Ng (2007), in anaphoricity determination on our developed corpus.",
        "In comparison with the tree kernel-based method in this paper, the feature-based method performs about 16 lower in F-measure, largely due to the difference in precision (63.61% vs 89.83%), when golden zero anaphors are given.",
        "It also shows that, when our tree kernel-based zero ana-phor detector is employed , the feature-based method gets much lower precision with a gap of about 31%, although it achieves slightly higher",
        "Table 10: Performance of the feature-based method (Zhao and Ng 2007) in anaphoricity determination on our developed corpus",
        "Table 11: Performance of the feature-based method (Zhao and Ng 2007) in antecedent identification on our developed corpus",
        "Table 11 gives the performance of the feature-based method, as described in Zhao and Ng (2007), in antecedent identification on our developed corpus.",
        "In comparison with our tree kernel-based method, it shows that 1) when using golden anaphoric zero anaphors, the feature-based method performs about 11%, 17% and 15 lower in precision, recall and F-measure, respectively; 2) when golden zero anaphors are given and feature-based anaphoricity determination is applied, the feature-based method performs about 5%, 18% and 17 lower in precision, recall and F-measure, respectively; and 3) when tree kernel-based zero anaphor detection and feature-based anaphoricity determination are applied, the feature-based method performs about 7%, 8% and 10 lower in precision, recall and F-measure, respectively.",
        "In summary, above comparison indicates the critical role of the structural information in zero anaphora resolution, given the fact that most of features in the feature-based methods in Zhao and Ng (2007) are also structural, and the necessity of tree kernel methods in modeling such structural information, even if more feature engineering in the feature-based methods may improve the performance to a certain extent."
      ]
    },
    {
      "heading": "6. Conclusion and Further Work",
      "text": [
        "This paper proposes a tree kernel-based unified framework for zero anaphora resolution, which can be divided into three sub-tasks: zero anaphor detection, anaphoricity determination and antecedent identification.",
        "The major contributions of this paper include: 1) We release a wide-coverage Chinese zero anaphora corpus of 100 documents, which adds a layer of annotation to the manually-parsed sentences in the Chinese Treebank (CTB) 6.0.",
        "2) To our best knowledge, this is the first systematic work dealing with all the three subtasks in Chinese zero anaphora resolution via a unified framework.",
        "3) Employment of tree kernel-based methods indicates the critical role of the structural information in zero anaphora resolution and the necessity of tree kernel methods in modeling such structural information.",
        "In the future work, we will systematically evaluate our framework on automatically-generated parse trees, construct more effective parse tree structures for different subtasks of zero anaphora resolution, and explore joint learning among the three sub-tasks.",
        "Besides, we only consider zero anaphors driven by a verb predicate phrase node in this paper.",
        "In the future work, we will consider other situations.",
        "Actually, among the remaining 7% zero anaphors, about 5% are driven by a preposition phrase (PP) node, and 2% are driven by a noun phrase (NP) node.",
        "However, our preliminary experiments show that simple inclusion of those PP-driven and NP-driven zero anaphors will largely increase the imbalance between positive and negative instances, which significantly decrease the performance.",
        "Finally, we will devote more on further developing our corpus, with the ultimate mission of annotating all the documents in CBT 6.0.",
        "P%",
        "R%",
        "F",
        "golden anaphoric zero anaphors",
        "77.45",
        "51.97",
        "62.20",
        "golden zero anaphpors and feature-based anaphoricity determination",
        "75.17",
        "29.69",
        "42.57",
        "overall: tree kernel-based zero anaphor detection and feature-based anaphoricity determination",
        "70.67",
        "23.64",
        "35.43"
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported by Projects 60873150, 90920004 and 61003153 under the National Natural Science Foundation of China."
      ]
    }
  ]
}
