{
  "info": {
    "authors": [
      "Lijun Feng",
      "Martin Jansche",
      "Matt Huenerfauth",
      "Noémie Elhadad"
    ],
    "book": "COLING – POSTERS",
    "id": "acl-C10-2032",
    "title": "A Comparison of Features for Automatic Readability Assessment",
    "url": "https://aclweb.org/anthology/C10-2032",
    "year": 2010
  },
  "references": [
    "acl-A00-2018",
    "acl-D08-1020",
    "acl-E09-1027",
    "acl-J08-1001",
    "acl-N04-1025",
    "acl-N07-1055",
    "acl-N07-1058",
    "acl-P05-1065",
    "acl-P06-2103",
    "acl-W08-0909"
  ],
  "sections": [
    {
      "text": [
        "Several sets of explanatory variables - including shallow, language modeling, POS, syntactic, and discourse features - are compared and evaluated in terms of their impact on predicting the grade level of reading material for primary school students.",
        "We find that features based on in-domain language models have the highest predictive power.",
        "Entity-density (a discourse feature) and POS-features, in particular nouns, are individually very useful but highly correlated.",
        "Average sentence length (a shallow feature) is more useful - and less expensive to compute - than individual syntactic features.",
        "A judicious combination of features examined here results in a significant improvement over the state of the art."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Readability Assessment quantifies the difficulty with which a reader understands a text.",
        "Automatic readability assessment enables the selection of appropriate reading material for readers of varying proficiency.",
        "Besides modeling and understanding the linguistic components involved in readability, a readability-prediction algorithm can be leveraged for the task of automatic text simplification: as simplification operators are applied to a text, the readability is assessed to determine whether more simplification is needed or a particular reading level was reached.",
        "Identifying text properties that are strongly correlated with text complexity is itself complex.",
        "In",
        "Martin Jansche",
        "Google, Inc. jansche@acm.org Noemie Elhadad",
        "this paper, we explore a broad range of text properties at various linguistic levels, ranging from discourse features to language modeling features, part-of-speech-based grammatical features, parsed syntactic features and well studied shallow features, many of which are inspired by previous work.",
        "We use grade levels, which indicate the number of years of education required to completely understand a text, as a proxy for reading difficulty.",
        "The corpus in our study consists of texts labeled with grade levels ranging from grade 2 to 5.",
        "We treat readability assessment as a classification task and evaluate trained classifiers in terms of their prediction accuracy.",
        "To investigate the contributions of various sets of features, we build prediction models and examine how the choice of features influences the model performance.",
        "Many traditional readability metrics are linear models with a few (often two or three) predictor variables based on superficial properties of words, sentences, and documents.",
        "These shallow features include the average number of syllables per word, the number of words per sentence, or binned word frequency.",
        "For example, the Flesch-Kincaid Grade Level formula uses the average number of words per sentence and the average number of syllables per word to predict the grade level (Flesch, 1979).",
        "The Gunning FOG index (Gunning, 1952) uses average sentence length and the percentage of words with at least three syllables.",
        "These traditional metrics are easy to compute and use, but they are not reliable, as demonstrated by several recent studies in the field (Si and Callan, 2001; Petersen and Ostendorf, 2006; Feng et al., 2009).",
        "With the advancement of natural language processing tools, a wide range of more complex text properties have been explored at various linguistic levels.",
        "Si and Callan (2001) used unigram language models to capture content information from scientific web pages.",
        "Collins-Thompson and Callan (2004) adopted a similar approach and used a smoothed unigram model to predict the grade levels of short passages and web documents.",
        "Heilman et al.",
        "(2007) continued using language modeling to predict readability for first and second language texts.",
        "Furthermore, they experimented with various statistical models to test their effectiveness at predicting reading difficulty (Heilman et al., 2008).",
        "Schwarm/Petersen and Ostendorf (Schwarm and Ostendorf, 2005; Petersen and Ostendorf, 2006) used support vector machines to combine features from traditional reading level measures, statistical language models and automatic parsers to assess reading levels.",
        "In addition to lexical and syntactic features, several researchers started to explore discourse level features and examine their usefulness in predicting text readability.",
        "Pitler and Nenkova (2008) used the Penn Discourse Treebank (Prasad et al., 2008) to examine discourse relations.",
        "We previously used a lexical-chaining tool to extract entities that are connected by certain semantic relations (Feng et al., 2009).",
        "In this study, we systematically evaluate all above-mentioned types of features, as well as a few extensions and variations.",
        "A detailed description of the features appears in Section 3.",
        "Section 4 discusses results of experiments with classifiers trained on these features.",
        "We begin with a description of our data in the following section."
      ]
    },
    {
      "heading": "2. Corpus",
      "text": [
        "We contacted the Weekly Reader corporation, an on-line publisher producing magazines for elementary and high school students, and were granted access in October 2008 to an archive of their articles.",
        "Among the articles retrieved, only those for elementary school students are labeled with grade levels, which range from 2 to 5.",
        "We selected only this portion of articles (1629 in total) for the study.",
        "These articles are intended to build children's general knowledge and help them practice reading skills.",
        "While preprocessing the texts, we found that many articles, especially those for lower grade levels, consist of only puzzles and quizzes, often in the form of simple multiple-choice questions.",
        "We discarded such texts and kept only 1433 full articles.",
        "Some distributional statistics of the final corpus are listed in Table 1."
      ]
    },
    {
      "heading": "3. Features",
      "text": [
        "We implement four subsets of discourse features: entity-density features, lexical-chain features, coreference inference features and entity grid features.",
        "The coreference inference features are novel and have not been studied before.",
        "We previously studied entity-density features and lexical-chain features for readers with intellectual disabilities (Feng et al., 2009).",
        "Entity-grid features have been studied by Barzilay and Lapata (2008) in a stylistic classification task.",
        "Pitler and Nenkova (2008) used the same features to evaluate how well a text is written.",
        "We replicate this set of features for grade level prediction task.",
        "Conceptual information is often introduced in a text by entities, which consist of general nouns and named entities, e.g. people's names, locations, organizations, etc.",
        "These are important in text comprehension, because established entities form basic components of concepts and propositions, on which higher level discourse processing is based.",
        "Our prior work illustrated the importance of entities in text comprehension (Feng et al., 2009).",
        "docs.",
        "words/document",
        "words/sentence",
        "mean",
        "std.",
        "dev.",
        "mean",
        "std.",
        "dev.",
        "174",
        "128.27",
        "106 .",
        "03",
        "9.54",
        "2.32",
        "289",
        "171.96",
        "106 .",
        "05",
        "11.39",
        "2.42",
        "428",
        "278.03",
        "187.58",
        "13.67",
        "2.65",
        "542",
        "335.56",
        "230.25",
        "15.28",
        "3.21",
        "During reading, a more challenging task with entities is not just to keep track of them, but to resolve the semantic relations among them, so that information can be processed, organized and stored in a structured way for comprehension and later retrieval.",
        "In earlier work (Feng et al., 2009), we used a lexical-chaining tool developed by Galley and McKeown (2003) to annotate six semantic relations among entities, e.g. synonym, hypernym, hyponym, etc.",
        "Entities that are connected by these semantic relations were linked through the text to form lexical chains.",
        "Based on these chains, we implemented six features, listed in Table 3, which",
        "Relations among concepts and propositions are often not stated explicitly in a text.",
        "Automatically resolving implicit discourse relations is a hard problem.",
        "Therefore, we focus on one particular type, referential relations, which are often established through anaphoric devices, e.g. pronominal references.",
        "The ability to resolve referential relations is important for text comprehension.",
        "We use OpenNLP to resolve coreferences.",
        "Entities and pronominal references that occur across the text and refer to the same person or object are extracted and formed into a coreference chain.",
        "Based on the chains extracted, we implement seven features as listed in Table 4.",
        "The chain length, chain span and active chains are defined in a similar way to the lexical chain features.",
        "Inference distance is the difference between the index of the referent and that of its pronominal reference.",
        "If the same referent occurs more than once in a chain, the index of the closest occurrence is used when computing the inference distance.",
        "Coherent texts are easier to read.",
        "Several computational models have been developed to represent and measure discourse coherence (Lapata and Barzilay, 2005; Soricut and Marcu, 2006; Elsner et al., 2007; Barzilay and Lapata, 2008) for NLP tasks such as text ordering and text generation.",
        "Although these models are not intended directly for readability research, Barzilay and Lapata (2008) have reported that distributional properties of local entities generated by their grid models are useful in detecting original texts from their simplified versions when combined with well studied lexical and syntactic features.",
        "This approach was subsequently pursued by Pitler and Nenkova (2008) in their readability study.",
        "Barzilay and Lapata's entity grid model is based on the assumption that the distribution of entities in locally coherent texts exhibits certain regularities.",
        "Each text is abstracted into a grid that captures the distribution of entity patterns at the level of sentence-to-sentence transitions.",
        "The entity grid is a two-dimensional array, with one dimension corresponding to the salient entities in the text, and the other corresponding to each sentence of the text.",
        "Each grid cell contains the grammatical role of the specified entity in the specified sentence: whether it is a subject (S), object (O), neither of the two (X), or absent from the sentence (-).",
        "We use the Brown Coherence Toolkit (v0.2) (El-sner et al., 2007), based on (Lapata and Barzilay, 2005), to generate an entity grid for each text in our corpus.",
        "The distribution patterns of entities are traced between each pair of adjacent sentences, resulting in 16 entity transition patterns.",
        "We then compute the distribution probability of each entity transition pattern within a text to form 16 entity-grid-based features."
      ]
    },
    {
      "heading": "1. percentage of named entities per document",
      "text": []
    },
    {
      "heading": "2. percentage of named entities per sentences",
      "text": []
    },
    {
      "heading": "3. percentage of overlapping nouns removed",
      "text": []
    },
    {
      "heading": "4. average number of remaining nouns per sentence",
      "text": []
    },
    {
      "heading": "5. percentage of named entities in total entities",
      "text": []
    },
    {
      "heading": "6. percentage of remaining nouns in total entities",
      "text": [
        "We hypothesized that the number of entities introduced in a text relates to the working memory burden on their targeted readers - individuals with intellectual disabilities.",
        "We defined entities as a union of named entities and general nouns (nouns and proper nouns) contained in a text, with overlapping general nouns removed.",
        "Based on this, we implemented four kinds of entity-density features: total number of entity mentions per document, total number of unique entity mentions per document, average number of entity mentions per sentence, and average number of unique entity mentions per sentence.",
        "We believe entity-density features may also relate to the readability of a text for a general audience.",
        "In this paper, we conduct a more refined analysis of general nouns and named entities.",
        "To collect entities for each document, we used OpenNLP's name-finding tool to extract named entities; general nouns are extracted from the output of Charniak's Parser (see Section 3.3).",
        "Based on the set of entities collected for each document, we implement 12 new features.",
        "We list several of these features in in Table 2."
      ]
    },
    {
      "heading": "1. total number of lexical chains per document",
      "text": []
    },
    {
      "heading": "2. avg. lexical chain length",
      "text": []
    },
    {
      "heading": "3. avg. lexical chain span",
      "text": []
    },
    {
      "heading": "4. num. of lex. chains with span > half doc. length",
      "text": []
    },
    {
      "heading": "5. num. of active chains per word",
      "text": []
    },
    {
      "heading": "6. num. of active chains per entity",
      "text": []
    },
    {
      "heading": "1. total number of coreference chains per document",
      "text": []
    },
    {
      "heading": "2. avg. num. of coreferences per chain",
      "text": []
    },
    {
      "heading": "3. avg. chain span",
      "text": []
    },
    {
      "heading": "4. num. of coref. chains with span > half doc. length",
      "text": []
    },
    {
      "heading": "5. avg. inference distance per chain",
      "text": []
    },
    {
      "heading": "6. num. of active coreference chains per word",
      "text": []
    },
    {
      "heading": "7. num. of active coreference chains per entity",
      "text": [
        "we use in our current study.",
        "The length of a chain is the number of entities contained in the chain, the span of chain is the distance between the index of the first and last entity in a chain.",
        "A chain is defined to be active for a word or an entity if this chain passes through its current location.",
        "Our language-modeling-based features are inspired by Schwann and Ostendorf's (2005) work, a study that is closely related to ours.",
        "They used data from the same data - the Weekly Reader - for their study.",
        "They trained three language models (unigram, bigram and trigram) on two paired complex/simplified corpora (Britannica and Litera-cyNet) using an approach in which words with high information gain are kept and the remaining words are replaced with their parts of speech.",
        "These language models were then used to score each text in the Weekly Reader corpus by perplexity.",
        "They reported that this approach was more successful than training LMs on text sequences of word labels alone, though without providing supporting statistics.",
        "It's worth pointing out that their LMs were not trained on the Weekly Reader data, but rather on two unrelated paired corpora (Britannica and Lit-eracyNet).",
        "This seems counter-intuitive, because training LMs directly on the Weekly Reader data would provide more class-specific information for the classifiers.",
        "They justified this choice by stating that splitting limited Weekly Reader data for training and testing purposes resulted in unsuccessful performance.",
        "We overcome this problem by using a hold-one-out approach to train LMs directly on our Weekly Reader corpus, which contains texts ranging from Grade 2 to 5.",
        "We use grade levels to divide the whole corpus into four smaller subsets.",
        "In addition to implementing Schwarm and Osten-dorf's information-gain approach, we also built LMs based on three other types of text sequences for comparison purposes.",
        "These included: word-token-only sequence (i.e., the original text), POS-only sequence, and paired word-POS sequence.",
        "For each grade level, we use the SRI Language Modeling Toolkit (with Good-Turing discounting and Katz backoff for smoothing) to train 5 language models (1- to 5-gram) using each of the four text sequences, resulting in 4 x 5 x 4 = 80 perplexity features for each text tested.",
        "Schwarm and Ostendorf (2005) studied four parse tree features (average parse tree height, average number of SBARs, noun phrases, and verb phrases per sentences).",
        "We implemented these and additional features, using the Charniak parser (Char-niak, 2000).",
        "Our parsed syntactic features focus on clauses (SBAR), noun phrases (NP), verb phrases (VP) and prepositional phrases (PP).",
        "For each phrase, we implement four features: total number of the phrases per document, average number of phrases per sentence, and average phrase length measured by number of words and characters respectively.",
        "In addition to average tree height, we implement two non-terminal-node-based features: average number of non-terminal nodes per parse tree, and average number of non-terminal nodes per word (terminal node).",
        "Part-of-speech-based grammatical features were shown to be useful in readability prediction (Heil-man et al., 2007; Leroy et al., 2008).",
        "To extend prior work, we systematically studied a number of common categories of words and investigated to what extent they are related to a text's complexity.",
        "We focus primarily on five classes of words (nouns, verbs, adjectives, adverbs, and prepositions) and two broad categories (content words, function words).",
        "Content words include nouns, verbs, numerals, adjectives, and adverbs; the remaining types are function words.",
        "The part of speech of each word is obtained from examining the leaf node based on the output of Charniak's parser, where each leaf node consists of a word and its part of speech.",
        "We group words based on their POS labels.",
        "For each class of words, we implement five features.",
        "For example, for the adjective class, we implemented the following five features: percent of adjectives (tokens) per document, percent of unique adjectives (types) per document, ratio of unique adjectives per total unique words in a document, average number of adjectives per sentence and average number of unique adjectives per sentence.",
        "Shallow features refer to those used by traditional readability metrics, such as Flesch-Kincaid Grade Level (Flesch, 1979), SMOG (McLaughlin, 1969), Gunning FOG (Gunning, 1952), etc.",
        "Although recent readability studies have strived to take advantage of NLP techniques, little has been revealed about the predictive power of shallow features.",
        "Shallow features, which are limited to superficial text properties, are computationally much less expensive than syntactic or discourse features.",
        "To enable a comparison against more advanced features, we implement 8 frequently used shallow features as listed in Table 5."
      ]
    },
    {
      "heading": "1. average number of syllables per word",
      "text": [
        "2 percentage of poly-syll.",
        "words per doc.",
        "3 average number of poly-syll.",
        "words per sent."
      ]
    },
    {
      "heading": "4. average number of characters per word",
      "text": [
        "5 Chall-Dale difficult words rate per doc."
      ]
    },
    {
      "heading": "6. average number of words per sentence",
      "text": []
    },
    {
      "heading": "7. Flesch-Kincaid score",
      "text": []
    },
    {
      "heading": "8. total number of words per document",
      "text": [
        "For comparison, we replicated 6 out-of-vocabulary features described in Schwarm and Ostendorf (2005).",
        "For each text in the Weekly Reader corpus, these 6 features are computed using the most common 100, 200 and 500 word tokens and types based on texts from Grade 2.",
        "We also replicated the 12 perplexity features implemented by Schwarm and Ostendorf (2005) (see Section 3.2)."
      ]
    },
    {
      "heading": "4. Experiments and Discussion",
      "text": [
        "Previous studies on reading difficulty explored various statistical models, e.g. regression vs. classification, with varying assumptions about the measurement of reading difficulty, e.g. whether labels are ordered or unrelated, to test the predictive power of models (Heilman et al., 2008; Petersen and Ostendorf, 2009; Aluisio et al., 2010).",
        "In our research, we have used various models, including linear regression; standard classification (Logistic Regression and SVM), which assumes no relation between grade levels; and ordinal regression/ classification (provided by Weka, with Logistic Regression and SMO as base function), which assumes that the grade levels are ordered.",
        "Our experiments show that, measured by mean squared error and classification accuracy, linear regression models perform considerably poorer than classification models.",
        "Measured by accuracy and F-measure, ordinal classifiers perform comparable or worse than standard classifiers.",
        "In this paper, we present the best results, which are obtained by standard classifiers.",
        "We use two machine learning packages known for efficient high-quality multi-class classification: LIBSVM (Chang and Lin, 2001) and the Weka machine learning toolkit (Hall et al., 2009), from which we choose Logistic Regression as classifiers.",
        "We train and evaluate various prediction",
        "Feature Set LIBSVM Logistic Regress.",
        "models using the features described in Section 3.",
        "We evaluate classification accuracy using repeated 10-fold cross-validation on the Weekly Reader corpus.",
        "Classification accuracy is defined as the percentage of texts predicted with correct grade levels.",
        "We repeat each experiment 10 times and report the mean accuracy and its standard deviation.",
        "We first discuss the improvement made by extending our earlier entity-density features (Feng et al., 2009).",
        "We used LIBSVM to train and test models on the Weekly Reader corpus with our earlier features and our new features respectively.",
        "With earlier features only, the model achieves 53.66% accuracy.",
        "With our new features added, the model performance is 59.63%.",
        "Table 6 presents the classification accuracy of models trained with discourse features.",
        "We see that, among four subsets of discourse features, entity-density features perform significantly better than the other three feature sets and generate the highest classification accuracy (LIBSVM: 59.63%, Logistic Regression: 57.59%).",
        "While Logistic Regression results show that there is not much performance difference among lexical chain, coreference inference, and entity grid features, classification accuracy of LIBSVM models indicates that lexical chain features and entity grid features are better in predicting text readability than coreference inference features.",
        "Combining all discourse features together does not significantly improve accuracy compared with models trained only with entity-density features.",
        "Table 7 compares the performance of models generated using our approach and our replication of Schwann and Ostendorf's (2005) approach.",
        "In our approach, features were obtained from language",
        "Original features 4 Expanded features 21",
        "models trained on the Weekly Reader corpus.",
        "Not surprisingly, these are more effective than LMs trained on the Britannica and LiteracyNet corpora, in Schwarm and Ostendorf's approach.",
        "Our results support their claim that LMs trained with information gain outperform LMs trained with POS labels.",
        "However, we also notice that training LMs on word labels alone or paired word/POS sequences achieved similar classification accuracy to the IG approach, while avoiding the complicated feature selection of the IG approach.",
        "Table 8 compares a classifier trained on the four parse features of Schwarm and Ostendorf (2005) to a classifier trained on our expanded set of parse features.",
        "The LIBSVM classifier with the expanded feature set scored 7 points higher than the one trained on only the original four features, improving from 50.68% to 57.79%.",
        "Table 9 shows a detailed comparison of particular parsed syntactic features.",
        "The two non-terminal-node-based features (average number of non-terminal nodes per tree and average number of non-terminal nodes per word) have higher discriminative power than average tree height.",
        "Among SBARs, NPs, VPs and PPs, our experiments show that VPs and NPs are the best predictors.",
        "The classification accuracy generated by models trained with various POS features is presented in Table 10.",
        "We find that, among the five word classes investigated, noun-based features gener-",
        "Logistic Regress,",
        "Nouns Verbs Adjectives Adverbs Prepositions Content words Function words all combined",
        "POS features ate the highest classification accuracy, which is consistent with what we have observed earlier about entity-density features.",
        "Another notable observation is that prepositions demonstrate higher discriminative power than adjectives and adverbs.",
        "Models trained with preposition-based features perform close to those trained with noun-based features.",
        "Among the two broader categories, content words (which include nouns) demonstrate higher predictive power than function words (which include prepositions),",
        "We present some notable findings on shallow features in Table 11.",
        "Experimental results generated by models trained with Logistic Regression show that average sentence length has dominating predictive power over all other shallow features.",
        "Features based on syllable counting perform much worse.",
        "The Flesch-Kincaid Grade Level score uses a fixed linear combination of average words per sentence and average syllables per word.",
        "Combining those two features (without fixed coefficients) results in the best overall accuracy, while using the Flesch-Kincaid score as a single feature is significantly worse.",
        "A trivial baseline of predicting the most frequent grade level (grade 5) predicts 542 out of 1433 texts (or 37.8%) correctly.",
        "With this in mind, we first compare our study with the widely-used Flesch-Kincaid Grade Level formula, which is a linear function of average words per sentence and average syllables per word that aims to predict the grade level of a text directly.",
        "Since this is a fixed formula with known coefficients, we evaluated it directly on our entire Weekly Reader corpus without cross-validation.",
        "We obtain the predicted grade level of a text by rounding the Flesch-Kincaid score to the nearest integer.",
        "For only 20 out of 1433 texts the predicted and labeled grade levels agree, resulting in a poor accuracy of 1.4%.",
        "By contrast, using the Flesch-Kincaid score as a feature of a simple logistic regression model achieves above 50% accuracy, as discussed in Section 4.5.",
        "The most closely related previous study is the work of Schwarm and Ostendorf (2005).",
        "However, because their experiment design (85/15 training/test data split) and machine learning tool (SVMhght) differ from ours, their results are not directly comparable to ours.",
        "To make a comparison, we replicated all the features used in their study and then use LIBSVM and Weka's Logistic Regression to train two models with the replicated features and evaluate them on our Weekly Reader corpus using 10-fold cross-validation.",
        "Using the same experiment design, we train classifiers with three combinations of our features as listed in Table 12.",
        "\"All features\" refers to a naive combination of all features.",
        "\"AddOneBest\" refers to a subset of features selected by a group-wise add-one-best greedy feature selection.",
        "\"WekaFS\" refers to a subset of features chosen by Weka's feature selection filter.",
        "\"WekaFS\" consists of 28 features selected au-",
        "Feature Set",
        "LIBSVM",
        "Logistic Regress,",
        "Feature Set",
        "Logistic Regress,",
        "Non-term.-node ratios 53.02±0",
        ".571",
        "51.80 ± 0.171",
        "Avg, words per sent,",
        "52.17 ± 0.193",
        "Average tree height",
        "44.26 ± 0",
        ".914",
        "43.45 ± 0.269",
        "Avg, syll, per word",
        "42.51 ± 0.264",
        "SBARs",
        "44.42 ± 1",
        ".074",
        "43.50 ± 0.386",
        "above two combined",
        "53.04 ± 0.514",
        "NPs",
        "51.56 ± 1",
        ".054",
        "48.14 ± 0.408",
        "Flesch-Kincaid score",
        "50.83 ± 0.144",
        "VPs",
        "53.07 ± 0",
        ".597",
        "48.67 ± 0.484",
        "Avg, poly-syll, words per sent,",
        "45.70 ± 0.306",
        "PPs",
        "49.36 ± 1",
        ".277",
        "46.47 ± 0.374",
        "all 8 features combined",
        "52.34 ± 0.242",
        "all combined",
        "57.79 ± 1",
        ".023",
        "54.11 ± 0.473",
        "baseline accuracy (majority class) 37.8 Flesch-Kincaid Grade Level 1.4",
        "tomatically by Weka's feature selection filter using a best-first search method.",
        "The 28 features include language modeling features, syntactic features, POS features, shallow features and out-of-vocabulary features.",
        "Aside from 4 shallow features and 5 out-of-vocabulary features, the other 19 features are novel features we have implemented for this paper.",
        "As Table 12 shows, a naive combination of all features results in classification accuracy of 72%, which is much higher than the current state of the art (63%).",
        "This is not very surprising, since we are considering a greater variety of features than any previous individual study.",
        "Our WekaFS classifier uses roughly the same number of features as the best published result, yet it has a higher accuracy (70.06%).",
        "Our best results were obtained by group-wise add-one-best feature selection, resulting in 74% classification accuracy, a big improvement over the state of the art."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We examined the usefulness of features at various linguistic levels for predicting text readability in terms of assigning texts to elementary school grade levels.",
        "We implemented a set of discourse features, enriched previous work by creating several new features, and systematically tested and analyzed the impact of these features.",
        "We observed that POS features, in particular nouns, have significant predictive power.",
        "The high discriminative power of nouns in turn explains the good performance of entity-density features, based primarily on nouns.",
        "In general, our selected POS features appear to be more correlated to text complexity than syntactic features, shallow features and most discourse features.",
        "For parsed syntactic features, we found that verb phrases appear to be more closely correlated with text complexity than other types of phrases.",
        "While SBARs are commonly perceived as good predictors for syntactic complexity, they did not prove very useful for predicting grade levels of texts in this study.",
        "In future work, we plan to examine this result in more detail.",
        "Among the 8 shallow features, which are used in various traditional readability formulas, we identified that average sentence length has dominating predictive power over all other lexical or syllable-based features.",
        "Not surprisingly, among language modeling features, combined features obtained from LMs trained directly on the Weekly Reader corpus show high discriminative power, compared with features from LMs trained on unrelated corpora.",
        "Discourse features do not seem to be very useful in building an accurate readability metric.",
        "The reason could lie in the fact that the texts in the corpus we studied exhibit relatively low complexity, since they are aimed at primary-school students.",
        "In future work, we plan to investigate whether these discourse features exhibit different discriminative power for texts at higher grade levels.",
        "A judicious combination of features examined here results in a significant improvement over the state of the art.",
        "Feature Set",
        "# Feat.",
        "LIBSVM",
        "Logistic Reg.",
        "Schwarm",
        "25",
        "63.18 ± 1.664",
        "60.50 ± 0.477",
        "All features",
        "273",
        "72.21 ± 0.821",
        "63.71 ± 0.576",
        "AddOneBest",
        "122",
        "74.01 ± 0.847",
        "69.22 ± 0.411",
        "WekaFS",
        "28",
        "70.06 0.777",
        "65.46 0.336"
      ]
    }
  ]
}
