{
  "info": {
    "authors": [
      "Rou Song",
      "Yuru Jiang",
      "Jingyi Wang"
    ],
    "book": "Proceedings of the Joint Conference on Chinese Language Processing",
    "id": "acl-W10-4104",
    "title": "On Generalized-Topic-Based Chinese Discourse Structure",
    "url": "https://aclweb.org/anthology/W10-4104",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "On Generalized-Topic-Based Chinese Discourse Structure *"
      ]
    },
    {
      "heading": null,
      "text": [
        "Song Rou Jiang Yuru2,4 Wang JingyiBeijing Language and Culture UniversityBeijing University of Polytechnic TechnologyBeijing Forest UniversityBeijing University of Information Science and technologyAbstract: Due to the lack of external formal marks, components in Chinese discourse can hardly be categorized into the traditional syntactic system.",
        "In fact, Chinese is a typical topic-prominent language, so it should rather be analyzed from the point of topic.",
        "This paper, targeting at computer processing, raises the concepts of punctuation clause, generalized topic, discourse structure and topic clause, and reveals the properties of Chinese discourse structure based on generalized topic.",
        "The applicability of this theory has been validated in an initial experiment.",
        "Keywords: Punctuation Clause, Generalized Topic, Discourse Structure, Topic Clause.",
        "1.",
        "Punctuation Clause, Generalized Topic and Discourse Structure",
        "The traditional study on syntax is based on individual sentences and the formal marks of syntactic components.",
        "But due to the lack of external formal marks, the concept of sentence in Chinese is not clear and the boundary of sentences is difficult to be defined.",
        "What's more, there are no formal means to discriminate variant types of syntactic structures.",
        "Therefore, the traditional parsing often meets difficulty when it comes to Chinese.",
        "This paper does not intend to provide a comprehensive analysis of the achievements and deficiency of the work done by the scholars in this field before.",
        "The study is rather based on the factual language phenomena in Chinese and oriented to computer processing of the language.",
        "In this paper, some concepts, including punctuation clause, generalized topic, discourse structure and topic clause, are defined, and some properties of Chinese discourse structure are raised, and initial verification done in practical application.",
        "The basic unit of a Chinese discourse is punctuation clause (PClause).",
        "A PClause is a string of words separated by comma, semicolon, period, exclamation mark, question mark or quotation marks.",
        "Since PClauses can be identified with formal marks, and their internal structure and their relations with each other are restrained, therefore the basic conditions of processing them with computers are satisfied.",
        "(®Suddenly,©he heard the sound of water in the washroom.©the police officers and the special policemen kicked the door open,@wrestled the man in the washroom on the floor and handcuffed him, ©after identifying,©was nobody but Ye Chengjian. )",
        "This is a discourse fragment composed of 6 punctuation clauses.",
        "(®Ye Chengjian confessed murders in Zhuhai, seducing and blackmailing a Taiwan businessman named You, © and the four armed robbery in Macao,© and identified the places where he illegally hid",
        "This study is supported by National Natural Science Foundation of China, subject No.",
        "60872121 With a purpose to show the structure of PClauses in Chinese, the translation of Chinese works may not appear very standard in English.",
        "The same applies hereinafter.",
        "the guns.)",
        "This is a discourse fragment composed of 3 punctuation clauses.",
        "The discourse structure in Chinese is a kind of syntactic structure of a PClause sequence, which is composed of a generalized topic and a number of comments.",
        "Generalized topic refers to a syntactic component of a PClause.",
        "The subsequent parts of the punctuation clause after it and the neighbor PClauses may be comments about it.",
        "Usually a generalized topic is nominal, functioning as the subject, object or attributive in the clause in traditional grammar.",
        "In this case, the comments answer \"what\" and \"how\" about the topic.",
        "The generalized topic can also be verbal, playing the part of the central component of a verb phrase.",
        "In some cases, the generalized topic can even be adverbial or an individual preposition.",
        "That's why the word \"generalized\" is adopted.",
        "For sake of simplicity, generalized topic will simply be referred to as topic in later sections.",
        "E.g. 1.3.",
        "(Adopted from A Tale of Old Man Xing and His Dog, by Zhang Xianliang)",
        "(She collected her needlework, went into the house, swept the kang, got on it and sat down, lowered her head, let her hands dangle between her knees and waited quietly like a prisoner in the hearing room.)",
        "In this example, each of the seven PClauses has the topic \"jÉ(she)\" as appears in the first PClause, and make comment about \"jÉ(she)\", answering the questions about her behavior and what she is like.",
        "They compose a discourse structure.",
        "The first PClause is composed of one topic and one comment, while the rest have comment only but no topic.",
        "This discourse structure can be expressed below.",
        "{*[4£^7-ft^4fl%, {She [collected her needlework,",
        "ii:£l|JLjiL, went into the house,",
        "fcfatelte, swept the kang,",
        "Jijte^&^^jte^, got on it and sat down, jlMM^i^, lowered her head,",
        "$j-f-#M§t.$j#MLlB], let her hand dangle between her knees,",
        "\\% – ^i^^^r^\\%^.3- – ^j^^-^a ]} waited quietly like a prisoner in the hearing room.]}",
        "For sake of visual cognition, the PClauses are put in different lines and are indented after the topic that they comment.",
        "This way of expression is called indented newline representation.",
        "What is quoted by the \"[]\"marks is some comments, the left of which is the topic.",
        "And what is quoted by the \"{}\"marks is the discourse structure.",
        "E.g. 1.4.",
        "(Adopted from Fortress Besieged by Chien Chung-Shu)",
        "These two PClauses both comment on what \"^K^(she was wearing only)\".",
        "\"K^(was wearing only)\" is one topic, and \"#sC&£M^)(a scarlet top)\", and \"^j£&tt^M#(navy blue, skin-tight shorts)\" are two comments, answering the question of what was being worn only.",
        "The topic and its two comments, when combined together, constitute a discourse structure, which is in turn the comment of \"jÉ(she)\", answering the question of what she was like.",
        "In other words, this discourse structure and \"she\" constitute an external discourse structure.",
        "E.g. 1.5.",
        "(Adopted from Fortress Besieged by Chien Chung-Shu) {Hung-chien[{was so horrified that[his forehead nearly shrank into his eyebrows, (as) his eyebrows rose up to his hairline,]}]}",
        "These two PClauses both comment on the extent of his being horrified.",
        "The verbal structure of verb + auxiliary \"(TFf# (was so horrified)\" is the topic.",
        "The topic and its two comments constitute a discourse structure, which is in turn the comment of \"M^(Hung-chien)\".",
        "E.g. 1.6.",
        "(Adopted from A Tale of Old Man Xing and His Dog, by Zhang Xianliang)",
        "The two PClauses comment on what \"^^HH^PT(more than 300 people all)\".",
        "The generalized topic \"^(all)\" has two comments \"?£#\"f^t,(need feeding)\" and \"t^f^?",
        "(need clothing)\".",
        "They both answer \"all\" what.",
        "\"^(all)\" and the two comments constitutes a discourse structure, commenting on what \"^^HH^PT(more than 300 people all)\" were like.",
        "The two form external discourse structure.",
        "E.g. 1.7.",
        "(Adopted from Preamble of CONSTITUTION OF THE PEOPLE'S REPUBLIC OF",
        "{This Constitution, [{in legal form, [affirms the achievements of the struggles of the Chinese people of all nationalities,",
        "(and) defines the basic system and basic tasks of the state;]} (it) is the fundamental law of the state, (and) has supreme legal authority. ]}",
        "The adverbial \"^^^^^^(in legal form)\" in the first PClause is the generalized topic.",
        "The section after it \">$HA7^ffl4^^A&^^^Ä^(affirms the achievements of the struggles of the Chinese people of all nationalities)\" and the second PClause \"^tTSf^^^^l^^^ft^ (defines the basic system and basic tasks of the state)\" are its two comments, answering what is done \"in legal form\".",
        "These three constitute a discourse structure.",
        "This structure, together with the third and the fourth PClauses, are all comments on the subject of the first PClause \"A^^(this Constitution)\" , answering what \"A^^(this Constitution)\" is about.",
        "These three comments, together with \"A^^(this Constitution)\" form the external discourse structure.",
        "E.g. 1.8.",
        "(Adopted from Fortress Besieged by Chien Chung-Shu) {^^[{te^IUNfAJj,, {The students[{took[grades as too cheap,",
        "The preposition \"ff>\" in the first PClause is the generalized topic.",
        "\"^IMM-f-AJJ^took grades as too cheap)\" and \"^i^lHfA^^(took courses as too easy)\" comment on what and its result.",
        "These three then constitute a discourse structure, making comments on \"^^(the students)\" .",
        "They form the external discourse structure.",
        "E.g. 1.9.",
        "(Adopted from Royal Tramp (Lu Ding Ji) by Louis Cha)",
        "Gu Yanwu bought at the town{a piece of court bulletin,",
        "[(it) listed in detail the names of the criminals accused in the case of Ming Dynasty history.]}",
        "The discourse structures in other examples of this section are embedding, while this example is of overlapping type.",
        "The first PClause \"I|/!j&ÄSMlTJ5cT – fö\"K$jß(Gu Yanwu bought at the town a piece of court bulletin)\" is a discourse structure.",
        "The object \" – ^&F$l(a piece of court bulletin)\" is not the topic in this PClause, but it is the topic of the second PClause \"±W#M^£ – ^4I$tiiifAlft&£(it listed in detail the names of the criminals accused in the case of Ming Dynasty history)\" and the two form another discourse structure.",
        "The two structures are overlapping, they share one component \" – ifrKP^a court bulletin)\"."
      ]
    },
    {
      "heading": "2.. The static property of Chinese discourse structure",
      "text": [
        "From the examples in the previous section, we can notice the characteristics of Chinese discourse structure:",
        "(1) A generalized topic and a comment group constitute a discourse structure.",
        "A comment group is composed of a number of comments.",
        "(2) A comment can be the part of a PClause that follows the topic, or a whole PClause, or another discourse structure.",
        "Therefore, the discourse structure is embedded in a recursive way to the right.",
        "Using Context-Free Grammar, the rules are",
        "Here PClauseTail is the tail of the PClause where the generalized topic appears.",
        "In these rules, ®-© are generating rules for discourse structure, comment group and comment respectively.",
        "@®@ are the generating rules for generalized topic, PClause tail and PClauses.",
        "The right part of these rules is related to terminal symbols and is not listed here.",
        "Statistics on the corpora show that in genuine Chinese texts, there are a large number of PClauses whose subject is missing.",
        "This phenomenon is regarded as zero anaphora or elision in traditional language study.",
        "But as a matter of fact, the nature of this phenomenon is that there is more than one comment that corresponds to a topic.",
        "Since it is a topic, it is natural that there are a lot of comments.",
        "There are pauses between the comments and the result is that several PClauses are formed.",
        "Neither is this phenomenon zero anaphora nor ellipses, but topic sharing.",
        "Take 1.8 as an example.",
        "The following is its generating process (the numbers following the arrow are rule ID).",
        "DiscourseStructure",
        " – ®GeneralizedTopic CommentGroup – ©A^E,& CommentGroup – ©A^E,& Comment CommentGroup – ©A^E,& DiscourseStructure CommentGroup – ® GeneralizedTopic CommentGroup CommentGroup – © A^E,* ^È^éé/i^ CommentGroup CommentGroup – ©A^E,* M'&fèééJiÂ, Comment CommentGroup CommentGroup – ©A£* ^*#ééi^ PClauseTail CommentGroup CommentGroup",
        "®",
        "DiscourseStructure – GeneralizedTopic CommentGroup",
        "CommentGroup – Comment",
        "®",
        "CommentGroup – Comment CommentGroup",
        "®",
        "Comment – PClauseTail",
        "Comment – PClause",
        "Comment – DiscourseStructure",
        "®",
        "GeneralizedTopic – ",
        "©",
        "PClauseTail – ",
        "©",
        "PClause – ",
        "^p^-A'Ör^K CommentGroup ^p^-A'Ör^K Comment CommentGroup ^p^-A'Ör^K PClause CommentGroup",
        "^MM£^hAS]^éé#-A*, CommentGroup",
        "This nature describes the internal relations of a discourse structure.",
        "Therefore it is termed static nature.",
        "This nature can cover most examples in the preceding section except example 1.9.",
        "This is because the overlapping type of the discourse structure in the example 1.9 can not be represented by Context-Free Grammar.",
        "3.",
        "Dynamic Property of Chinese Topic Clause 3.1.",
        "Topic Structure and Topic Clause",
        "In this paper, the structure formed by a comment and its topic is called a topic structure.",
        "A topic structure as comment can be combined with an external topic and form an external topic structure.",
        "If the topic of a comment is the outmost layer of a discourse structure, it is then called the topic clause.",
        "In most cases, every PClause corresponds to a topic clause.",
        "E.g.3.1.",
        "(Adopted from the Biology Section of China Encyclopedia)",
        "ci ^^Wii-/^!^]^^-, (the spawning season of neoceratodus forsteri is quiet long)",
        "c2 9-10 ^^&^o (usually September and October are most productive period) c3 (eggs are big) c5 JWîUltM, (have gelatinous membrane) c6 it^'fA (are not sticky)",
        "Here, the outmost topic is \"Ä^MÄ (neoceratodus forsteri)\".",
        "The topic clause of c1 is c1 itself.",
        "The comment is \"/^fflTOfl^the spawning season of is quiet long)\".",
        "c2\" – Mâtil 9 – 10 JJÄffESfj (usually September and October are most productive period)\"is a comment, and its topic is\"/fE$PKj(the spawning season)\".",
        "The topic structure composed of the two is the comment on \"Äri'HMÄ (neoceratodus forsteri)\", therefore 'ÄHM&^M – l&liA 9 – 10 ÜÄBiSF is the topic clause of c2 o",
        "c3\"fPA(eggs are big)\"is the comment on the topic \"ÂîîH'IMÂ(neoceratodus forsteri)\".",
        "The topic clause of c3 is \"Ä^IMÄlPA\".",
        "c4\"$Plê 6 – 7 -HA^ggs are 6-7 mm in diameter)\" is the comment on the topic \"Ätj'l'IMÄ (neoceratodus forsteri)\".",
        "The topic clause of c4 is \"ÂîfflMÂfPfê 6 – 7 #|\"o",
        "c5\"JII$M)SI(have gelatinous membrane)\"is the comment on the topic \"$P(eggs)\".",
        "The topic structure \"fPJII$M)]|l(eggs have gelatinous membrane)\" composed of the two is the comment on \"Ätj'l'IMÄ (neoceratodus forsteri)\".",
        "And the topic clause of c5 is \"Ä^MÄ0ÄKME\"o",
        "c6\"^^tt(are not sticky)\" is the comment on the topic \"$P(eggs)\".",
        "The topic structure \"fP^fè'ÏÉ (eggs are not sticky)\" composed of the two is the comment on \"Ä^MÄ(neoceratodus forsteri)\".",
        "And the topic clause of c6 is \"ÄlWififttt\"o",
        "c7\"#P/fe^|È^ltJfB|(the eggs are laid among plants)\" is the comment on the topic \"Ätj'l'IMÄ (neoceratodus forsteri)\".",
        "The topic clause of c7 is \"ftlWÄi^ftit^\"o",
        "c8\" – $|3^y)ïA7jC/i;(some sink deep in the water)\"is the comment on the topic \"fP(eggs)\", The topic structure \"0 – $|3^y)ïA7jC/i;(eggs some sink deep in the water)\" composed of the two is the comment on the topic \"Ä^MÄ(neoceratodus forsteri)\".",
        "And the topic clause of c8 is \"Ätj'l'IMÄfP – $13",
        "The purpose of analyzing a PClause sequence is to find out its discourse structure.",
        "If the topic clause of every PClause is constructed, the topic of each comment at every layer is then found out, and consequently the entire discourse structure will be clear.",
        "The next section provides an approach to finding out the topic clause of PClauses.",
        "The topic clause of PClause ci of Ex.3.1 is marked as ci'.",
        "They are listed below.",
        "ci' .",
        "â^Wi/*^^!^-, (the spawning season of neoceratodus forsteri is quiet long)",
        "usually September and October are most productive period)",
        "C3' .â^Willl^, (neoceratodus forsteri' s eggs are big) C5' .â^'Wi^^iîi^M, (neoceratodus forsteri' s eggs have gelatinous membrane) C6' .â^Wi^^^'lA (neoceratodus forsteri' s eggs are not sticky) C7' .",
        "â^Wi^/AA^^lB], (neoceratodus forsteri' s eggs are laid among plants) Cs' .",
        "â^^i^ – ^^^A^Âo (some eggs of neoceratodus forsteri sink deep in the water)",
        "The generation of each ci' is exemplified below.",
        "The topic of c2 is \"/^fPJ^the spawning season)\" in c1'.",
        "Delete the part of c1' right to the topic and replace it with c2, and we will have c2' ;",
        "The topic of c3 is \"Ä^MÄ(neoceratodus forsteri')\" in c2'.",
        "Delete the part of c2' right to the topic and replace it with c3, and we will have c3'.",
        "The topic of c4 is \"Ä^MÄ(neoceratodus forsteri')\" in c3'.",
        "Delete the part of c3' right to the topic and replace it with c4, and we will have c4'.",
        "The topic of c5 is \"fP(eggs)\" in c4'.",
        "Delete the part of c4' right to the topic and replace it with c5, and we will have c5'.",
        "The topic of c6 is \"$P(eggs)\" in c5'.",
        "Delete the part of c5' right to the topic and replace it with c6, and we will have c6'.",
        "The topic of c7 is \"Ä^MÄ(neoceratodus forsteri')\" in c6'.",
        "Delete the part of c6' right to the topic and replace it with c7, and we will have c7'.",
        "The topic of c8 is \"fP(eggs)\" in c7'.",
        "Delete the part of c7' right to the topic and replace it with c8, and we will have c8'.",
        "Generally, given a PClause sequence (c1,...,cn} , if the first PClause is a complete structure of topic-comment, then (1) the topic clause of the first PClause is the PClause itself;",
        "(2) if the topic of a subsequent PClause is missing, then the topic should be in the topic clause of its previous PClause; (3) the topic clause of every subsequent PClause can be generated recursively by stack operation.",
        "Note the topic clause of ci as ci and the topic clause of ci+1 as ci+1 ', ( 3.1 ) if the topic of ci+1 is missing, and ci '= ocAß , where A is the topic of ci+1, then (3.2) if the topic of ci+1 is not missing, then ci+1'= ci+1.",
        "If we regard the beginning and the end of a topic clause as the bottom and the top of a stack respectively, then the removal and connection of the components in the generation process of topic clause are typical stack operations.",
        "Therefore the recursive law of such generation can be called the stack model",
        "The stack model can not only applied to embedded discourse structure, but also some overlapping structures such as instance 1.4.",
        "Details are not given here.",
        "Our investigation into corpora (about 340,000 Chinese characters) of different registers shows that more than 95% PClauses meet the model.",
        "From the stack model, it can be seen that the key to generate the topic clause of a PClause is to identifying which component of the topic clause of the previous PClause is its topic.",
        "This would require to uncover the constraints for forming the discourse structure."
      ]
    },
    {
      "heading": "4.. Constraints on Discourse Structure",
      "text": [
        "A topic structure is composed of a topic and its comments.",
        "Therefore mostly it is acceptable.",
        "A topic clause is not only acceptable, but also complete with necessary syntactic and semantic components.",
        "Taking advantage of this nature, the filtering of topic-seeking for a PClause can be boiled down to the judgment of the acceptability and completeness of a single clause.",
        "For example, the topic clause of PClause 7 in example 3.1 is:",
        "c7 '.",
        "â^Wi^/ZiA^^fâ], (neoceratodus forsteri' s eggs are laid among plants) and PClause c8 is",
        " – ^^XA^Ä.",
        "(some sink deep in the water)",
        "According to the stack model, the options for the topic clause of c8 are:",
        "(1) – f^SAÜo (some sink deep in the water)",
        "( suppose that the topic of c8 is not missing )",
        "(2) â^^i – #^XAi^.",
        "(neoceratodus forsteri some sink deep in the water)",
        "(suppose that the topic of c8 is \"Ä^MÄ(neoceratodus forsteri)\")",
        "(3) â^^i^ – f^XAi^.",
        "(neoceratodus forsteri' eggs some sink deep in the water)",
        "(suppose that the topic of c8 is \"$P(eggs)\")",
        "(4) â^^i^/f – f^XAi^.",
        "(neoceratodus forsteri' eggs some are laid sink deep in the water)",
        "(suppose that the topic of c8 is \"^A(be laid)\")",
        "(5) â^#i^/fA# – f^XAi^.",
        "(neoceratodus forsteri' eggs some are laid plant sink deep in the water)",
        "(suppose that the topic of c8 is \"lit^(plant)\")",
        "(6) â^#i^/fA#t^ – f^XAiâ.",
        "(neoceratodus forsteri' eggs some are laid among plant sink deep in the water)",
        "( suppose that the topic of c8 is \"tf§] (middle)\" ) Chinese intuition tells us that (1) is not complete, and (4)(5)(6) are not acceptable, so the candidates are (2) and (3) only.",
        "We see that if we can formalize our intuition, we can considerably narrow down the scope of options.",
        "The topic and the comment of a topic clause are often from different PClauses, and the components in a topic clause that have discourse functions (such as discourse conjunctions) can affect the acceptability of the topic clause.",
        "This problem needs to be addressed in separate study.",
        "E.g. 4.1.^^T – ^^â,4^^/Â.",
        "(He bought a wallet, (it) is a brand product.)",
        "The topic of the second PClause could be \"fe(he)\" or \"^^(a wallet)\".",
        "We can eliminate the first possibility by using semantic constraints, because a person can not be a product.",
        "An investigation into corpora shows that the syntactic relations of the topic and the comments are of the following types:",
        "(1) If the relation of a topic and its comment in the same PClause is subject-predicate, then the same relation is true of it with its comments in other PClauses (see example 1.3);",
        "(2) If the relation of a topic and its comment in the same PClause is predicate-object, preposition-object or attribute-central, then the relation of it and its comment in other PClauses is of the same type or subject-predicate type (see example 1.4 and 1.8).",
        "(3) If the relation of a topic and its comment in the same PClause is adverbial-central or predicate-complement, then its relation with its comment in other PClauses is the same (see example 1.5, 1.6 and 1.7).",
        "(4) If a component is not the topic of the PClause where it is appears, but is the topic of other PClauses, then it must be the object or attribute in the PClause where it appears and its relation with the comments in other PClauses is subject-predicate (see example 1.9).",
        "In addition, adjectives, numbers in partition in respect of quantity and some adverbs (such a adverbs indicating degree) cannot function as general topics.",
        "4.4 Context Constraints",
        "The topic of the second PClause could be \"fe(he)\" or \"^^A(a friend)\".",
        "Whether it is \"he is generous with money\" or \"his friend is generous with money\", it will present no problem either semantically or syntactically.",
        "However, abundant instances and analyses show that if (1) the structure of the topic clause of the previous PClause is SVO;",
        "(2) the core verb of the topic clause of the previous PClause has a sense of \"owing\" or \"introducing\"; and (3) the second PClause is an adjective phrase but does not fall into the category of mental state then the topic of the second PClause is the object rather than the subject of the topic clause.",
        "According to this constraint, the topic of the second PClause is \"^^A(a friend)\" 4.5.",
        "Cognition Constraints",
        "Theoretically, there is no limit to the size of a discourse structure.",
        "Countless layers could be embedded or overlapped.",
        "For example, we could have the following discourse structure.",
        "(The circumference ratio's integer part is 3, the first number in the fraction part is 1, followed by 4, followed by 1, followed by 5",
        "Here \"@IJI]^ (circumference ratio)\", \"1\", \"4\", \"1\", \"5\" all are topics.",
        "They could go on with no limit.",
        "But the study on factual corpora have discovered that the maximum layer of embedding or overlapping is 5, and if we shall return from the deeper layers, the maximum number of the layers that can be jumped back is 3.",
        "This has much to do with people's cognition ability.",
        "The following is an example of 5 layers of embedding and overlapping with 3 layers of maximum return.",
        "The underlined words are the generalized topics.",
        "The numbers in the brackets to the right of the PClauses indicating the depth of the embedding and overlapping.",
        "PClause \"fxffliP^Krelease them)\" reaches the fifth layer in depth, but the next PClause \"llr)#iâ:^ï;èJ\\ï(when the authorities started investigating)\" returns to layer2, retreating 3 layers.",
        "Ex.",
        "4.4.",
        "(Adopted from Royal Tramp by Louis Cha) ^llti^Àfe^^fe'Jitl^^Bt, ( 0 ) (Cheng Weifan, on the long boat journey from Hangzhou to Nanxun) ÄJfL##, ( 1 ) (thought things over) £j^-#Jljjt, ( 1 ) (had come up with a good plan.)",
        "^£jjSÜf «^-##B-^» ilt/fëtLÂ., ( 1 ) (thought the book had already been in circulation for some time) Ri-I^JLB^^T^, (2) (It was therefore too late for concealment) ^^^ – ^It^&if-^f, (2) (the only expedient left was to play a trick) – Â>Jf^îî^4^&-#lif, ( 3 ) (on one hand, send people to go to the bookshops all over the country)",
        "( 4 ) (buy back and then destroy all copies of the book) – ^fe^^X, ( 3 ) (on the other hand, work day and night) ^•ttifÄä., ( 4 ) (make a new printing mould) ^l&W^&4L*t, ( 4 ) (remove all the offensive bits) jrgpi/f-ft, (4) (reprint the book)",
        "##'f^h (5) (release them) J[Vffîi?L-^-Ht, ( 2 ) (when the authorities started investigating)",
        "5.",
        "Initial Application of Discourse Structure based on General Topic",
        "The herein discussed Chinese discourse structure based on general topic has been initially applied and tested in the analyses of encyclopedia texts.",
        "The entries in encyclopedia are expository, covering people, places, species, events, devices and terms etc.",
        "in various subjects.",
        "Because the different aspects of an object must be exposed, the leading role of the topic is very obvious.",
        "It frequently occurs that many PClauses are used to comment on one topic, and the comments on different aspects of an object are often presented as embedded or overlapping structures.",
        "In order to mine the information of the object described, it is necessary to analyze the governing scope of a topic.",
        "In other words, it is necessary to locate the object commented by every PClause.",
        "Therefore the discourse structure must be analyzed.",
        "Take 3.1 for example, we must be clear about for \"what\" September and October are the active period, the eggs of \"what\" are big, the eggs of \"what\" are 6-7 mm in diameter, \"what\" has gelatinous membranes and so on.",
        "The experiment object of the paper is the entries about various fishes in the biology volume of China Encyclopedia.",
        "The objective is the find the topic clause of every Pclause.",
        "There are 224 entries about fishes in this volume, each one with a title, viz. the name of the order, family, genera and species of a fish.",
        "The first PClause in the text does not mention the name, but introduces the genera information of it.",
        "The name is not necessarily mentioned in later Pclauses.",
        "For example,",
        "Neoceratodus forsteri; Queensland lungfish",
        "(A member of the family Ceratodontidae and order Ceratodontiformes (see picture of Neoceratodus forsteri).",
        "(It) is the biggest extant lungfish species in the world.",
        "(Its)Body length (is) about 125 centimeters, (it) weighs as much as 10 kilograms.",
        "(Its) Body is elongated, covered with big and thin round scales .)",
        "In the experiment, the entry names (both in Chinese and English) and bracketed information are deleted.",
        "But the entry title is added to the left of the first PClause, connected by a \"Jit(is) \".",
        "For example, the first PClause of the above example of neoceratodus forsteri is changed into ÄäffifTÄÄäJSW 1 \", the rest remains unchanged.",
        "The experiment selected 3999 PClauses of 86 entries as training data, and 577 PCauses of 13 entries as open-test data.",
        "The input of the experiment is the topic clause of a PClause and its next PClause, and the output is the topic clause of the second PClause.",
        "In other words, the target of the experiment is to decide the topic of the PClause within a limited scope under the scheme of stack model.",
        "For the training data, each PClause is replenished manually into a topic clause, and then the words are segmented.",
        "In this way, the training topic clause set G is obtained.",
        "The principle of testing is described below.",
        "For each tested PClause c and the topic clause d of its proceeding PClause, word segmentation is done separately.",
        "String d is cut at different places, the tails are replaced with c every time.",
        "Thus a number of candidate topic clauses of c are obtained.",
        "Then the similarity reckoning is made about the candidate topic clauses and the topic clauses in G. The one with the maximum similarity is chosen as the result for output.",
        "In order to solve the problem of data sparse in the calculation, semantic generalization is made about related words.",
        "The semantic categories employed are: subjects of fishes ( e.g. neoceratodus forsteri, alopias), part (e.g. head, scale, fin), position (e.g. back, abdomen), location ( e.g. front, upper), shape (e.g. fusiformis, cylindrical), size (e.g. big, short), color (e.g. red, light blue).",
        "environment (e.g. pond, near sea), geographical region(e.g. the Pacific, Huanghai), season(e.g. early spring, autumn), number (e.g. 3, 1-3) etc.",
        "Verbs are rarely generalized.",
        "The result of the initial experiment showed the accuracy rate for open test was 78%.",
        "If add the title of a text to the beginning of every PClause in the text, 66% accuracy rate can be got as a baseline.",
        "The result of the experiment is not high indeed and there is room for improvement.",
        "Since the experiment principle was the similarity of the topic clauses, in essence only the stack model and the acceptability of topic clause are used.",
        "Semantic constraints, syntactic constraints, context constraints and cognitive constraints are not employed.",
        "In addition, word segmentation is not entirely correct, and the semantic generalization is quite rough.",
        "78% accuracy rate of under such rough conditions has initially proved the applicability of the theoretical system."
      ]
    },
    {
      "heading": "6.. Discussion",
      "text": [
        "This paper employs discourse structure of topic-comment in analyzing Chinese, takes PClauses as the basic discourse unit, and extends the concept of topic to generalized topic.",
        "As a result, the properties of Chinese discourse structure are proposed.",
        "Investigations into large amount of language data have proved that this theoretical system is natural and applicable to Chinese, which is also backed up by initial experiment.",
        "Of course, the theory need to be improved, and the various types of constraints under the theory framework need to be further uncovered.",
        "More and detailed study needs to be done along this path."
      ]
    }
  ]
}
