{
  "info": {
    "authors": [
      "Micah Hodosh",
      "Peter Young",
      "Cyrus Rashtchian",
      "Julia Hockenmaier"
    ],
    "book": "Proceedings of the Fourteenth Conference on Computational Natural Language Learning",
    "id": "acl-W10-2920",
    "title": "Cross-Caption Coreference Resolution for Automatic Image Understanding",
    "url": "https://aclweb.org/anthology/W10-2920",
    "year": 2010
  },
  "references": [
    "acl-C04-1051",
    "acl-D09-1120",
    "acl-J07-4004",
    "acl-P01-1008",
    "acl-P07-1107",
    "acl-P07-1126",
    "acl-P08-1032",
    "acl-W09-2206"
  ],
  "sections": [
    {
      "text": [
        "Cross-caption coreference resolution for automatic image understanding",
        "Micah Hodosh Peter Young Cyrus Rashtchian Julia Hockenmaier",
        "Recent work in computer vision has aimed to associate image regions with keywords describing the depicted entities, but actual image 'understanding' would also require identifying their attributes, relations and activities.",
        "Since this information cannot be conveyed by simple keywords, we have collected a corpus of \"action\" photos each associated with five descriptive captions.",
        "In order to obtain a consistent semantic representation for each image, we need to first identify which NPs refer to the same entities.",
        "We present three hierarchical Bayesian models for cross-caption coreference resolution.",
        "We have also created a simple ontology of entity classes that appear in images and evaluate how well these can be recovered."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Many photos capture a moment in time, telling a brief story of people, animals and objects, their attributes, and their relationship to each other.",
        "Although different people may give different interpretations to the same picture, people can readily interpret photos and describe the entities and events they perceive in complex sentences.",
        "This level of image understanding still remains an elusive goal for computer vision: although current methods may be able to identify the overall scene (Quattoni and Torralba, 2009) or some specific classes of entities (Felzenszwalb et al., 2008), they are only starting to be able to identify attributes of entities (Farhadi et al., 2009), and are far from recovering a complete semantic interpretation of the depicted situation.",
        "Like natural language processing, computer vision requires suitable training data, and there are currently no publicly available data sets that would enable the development of such systems.",
        "Photo sharing sites such as Flickr allow users to annotate images with keywords and other descriptions, and vision researchers have access to large collections of images annotated with keywords (e.g. the Corel collection).",
        "A lot of recent work in computer vision has been aimed at predicting these keywords (Blei et al., 2003; Barnard et al., 2003; Feng and Lapata, 2008; Deschacht and Moens, 2007; Jeon et al., 2003).",
        "But keywords alone are not expressive enough to capture relations between entities.",
        "Some research has used the text that surrounds an image in a news article as a proxy (Feng and Lapata, 2008; Deschacht and Moens, 2007).",
        "However, in many cases, the surrounding text or a user-provided caption does not simply describe what is depicted in the image (since this is usually obvious to the human reader for which this text is intended), but provides additional information.",
        "We have collected a corpus of 8108 images associated with several simple descriptive captions.",
        "In contrast to the text near an image on the web, the captions in our corpus provide direct, if partial and slightly noisy, descriptions of the image content.",
        "Our data set differs from paraphrase corpora (Barzilay and McKeown, 2001; Dolan et al., 2004) in that the different captions of an image are produced independently by different writers.",
        "There are many ways of describing the same image, because it is often possible to focus on different aspects of the depicted situation, and because certain aspects of the situation may be unclear to the human viewer.",
        "One of our goals is to use these captions to obtain a semantic representation of each image that is consistent with all of its captions.",
        "In order to obtain such a representation, it is necessary to identify the entities that appear in the image, and to perform cross-caption coreference resolution, i.e. to identify all mentions of the same entity in the five captions associated with an image.",
        "In this paper, we compare different meth-",
        "A golden retriever (animal) is playing with a smaller black and brown dog(ANiMAL) in a pink collar (clothing).",
        "A smaller black dog (animal) is fighting with a larger brown dog (animal) in a forest (nat_background).",
        "A smaller black and brown dog (animal) is jumping on a large orange dog (animal).",
        "Brown dog (animal) with mouth (body_part) open near head(BODY_PART) of black and tan dog (animal).",
        "Two dogs (animal) playing near the woods (nat_background).",
        "Figure 1: An image with five captions from our corpus.",
        "Coreference chains and ontological classes are indicated in color.",
        "ods of cross-caption coreference resolution on our corpus.",
        "In order to facilitate further computer vision research, we have also defined a set of coarsegrained ontological classes that we use to automatically categorize the entities in our data set."
      ]
    },
    {
      "heading": "2. A corpus of action images and captions",
      "text": [
        "Image collection and sentence annotation We have constructed a corpus consisting of 8108 photographs from Flickr.com, each paired with five one-sentence descriptive captions written by Amazon's Mechanical Turk workers.",
        "We downloaded a few thousand images from each of six selected Flickr groups.",
        "To facilitate future computer vision research on our data, we filtered out images in black-and-white or sepia, as well as images with watermarks, signatures, borders or other obvious editing.",
        "Since our collection focuses on images depicting actions, we then filtered out images of scenery, portraits, and mood photography.",
        "This was done independently by two members of our group and adjudicated by a third.",
        "We paid Turk workers $0.10 to write one descriptive sentence for each of five distinct and randomly chosen images that were displayed one at a time.",
        "We required a small qualification test that examined the workers' English grammar and spelling and we restricted the task to U.S. workers (see Rashtchian et al.",
        "(2010) for more details).",
        "Our final corpus contains five sentences for each of our 8108 images, totaling 478,317 word tokens, and an average sentence length of 11.8 words.",
        "We first spell-checked these sentences, and used OpenNLP to POS-tag them.",
        "We identified NPs using OpenNLP's chunker, followed by a semiautomatic procedure to correct for a number of systematic chunking errors that could easily be corrected.",
        "We randomly selected 200 images for further manual annotation, to be used as test and development data in our experiments.",
        "Gold standard coreference annotation We manually annotated NP chunks, ontological classes, and cross-caption coreference chains for each of the 200 images in our test and development data.",
        "Each image was annotated independently by two annotators and adjudicated by a third.",
        "The development set contains 1604 mentions.",
        "On average, each caption has 3.2 mentions, and each image has 5.9 coreference chains (distinct entities).",
        "Ontological annotation of entities In order to understand the role entities mentioned in the sentences play in the image, we have defined a simple ontology of entity classes (Table 1).",
        "We distinguish entities that constitute the background of an image from those that appear in the foreground.",
        "These entities can be animate (people or animals) or inanimate.",
        "For inanimate objects, we distinguish static objects from \"movable\" objects.",
        "We also distinguish man-made from natural objects and backgrounds, since this matters for computer vision algorithms.",
        "We have labeled the entity mentions in our test and development data with classes from this ontology.",
        "Again, two of us annotated each image's mentions, and adjudication was performed by a single person.",
        "Our ontology is similar to, but smaller than the one proposed by Hollink and Worring (2005) for video retrieval, which in turn is based on Hoogs et al.",
        "(2003) and",
        "Hunter (2001)."
      ]
    },
    {
      "heading": "3. Predicting image entities from captions",
      "text": [
        "same entity, or even seemingly contradictory modifiers (\"orange\" vs. \"brown\" dog).",
        "In order to predict what entities appear in an image from its captions, we need to identify how many entities each sentence describes, and what role these entities play in the image (e.g. person, animal, background).",
        "Because we have five sentences associated with each image, we also need to identify which noun phrases in the different captions of the same image refer to the same entity.",
        "Because the captions were generated independently, there are no discourse cues such as anaphora to identify coreference.",
        "This creates problems for standard coreference resolution systems trained on regular text.",
        "Our data also differs from standard corefer-ence data sets in that entities are rarely referred to by proper nouns.",
        "Our first task is to identify which noun phrases may refer to the same entity.",
        "We do this by identifying the set of entity types that each NP may refer to.",
        "We use WordNet (Fellbaum, 1998) to identify the possible entity types (WordNet synsets) of each head noun.",
        "Since the salient entities in each image are likely to be mentioned by more than one caption writer, we then aim to restrict those types to those that may be shared by some head nouns in the other captions of the same image.",
        "This gives us an inventory of entity types for each mention, which we use to identify coreferences, restricted by the constraint that all coreferent mentions refer to an entity of the same type."
      ]
    },
    {
      "heading": "4. Using WordNet to identify entity types",
      "text": [
        "WordNet (Fellbaum, 1998) provides a rich ontology of entity types that facilitates our coreference task.",
        "We use WordNet to obtain a lexicon of possible entity types for each mention (based on their lexical heads, assumed to be the last word with a nominal POS tag).",
        "We first generate a set of candidate synsets based solely on the lexical heads, and then generate lexicon entries based on relations between the candidates.",
        "WordNet synsets provide us with synonyms, and hypernym/hyponym relations.",
        "For each mention, we generate a list of candidate synsets.",
        "We require that the candidates are one of the first four synsets reported and that their frequency is to be at least one-tenth of the most frequent synset.",
        "We limit candidates to ones with \"physical_entity#n#1\", \"event#n#1\", or \"vi-sual_property#n#1\" as a hypernym, in order to ensure that the synset describes something that is de-pictable.",
        "To avoid word senses that refer to a person in a metaphorical fashion, (e.g. pig meaning slovenly person or red meaning communist), we ignore synsets that refer to people if the word has a synset that is an animal or color.",
        "In general, we would like for mentions to be able to take on more specific word senses.",
        "For example, we would like to be able to identify that \"woman\" and \"person\" may refer to the same entity, whereas \"man\" and \"woman\" typically would not.",
        "However, we also do not want a type inventory that is too large or too fine-grained.",
        "Once the candidate synsets are generated, we consider all pairs of nouns (ni, n2) that occur in different captions of the same image and examine all corresponding pairs of candidate synsets (si, s2).",
        "If s2 is a synonym or hypernym of si, it is possible that two captions have different words describing the same entity, so we add si and s2to the lexicon of ni.",
        "Adding s2 to ni's lexicon allows it to act as an umbrella sense covering other nouns describing the same entity.",
        "We add s2 to the lexicon of n2 (since if ni is using the sense si , then n2 must be using the sense s2) and if ni occurs at least five times in the corpus, we add si to the lexicon of n2.",
        "Ontological Class",
        "Examples",
        "animal",
        "dog, horse, cow",
        "background_man-made",
        "street, pool, carpet",
        "backgrouncLnatural",
        "ocean, field, air",
        "body_part",
        "hair, mouth, arms",
        "clothing",
        "shirt, hat, sunglasses",
        "event",
        "trick, sunset, game",
        "fixed_object_man-made",
        "furniture, statue, ramp",
        "fixed_object_natural",
        "rock, puddle, bush",
        "image_attribute",
        "camera, picture, closeup",
        "material .man-made",
        "paint, frosting",
        "material.natural",
        "water, snow, dirt",
        "movable_man-made",
        "ball, toy, bowl",
        "movable_natural",
        "leaves, snowball",
        "nondepictable",
        "something, Batman",
        "orientation",
        "front, top, [the] distance",
        "part_of",
        "edge, side, top, tires",
        "person",
        "family, skateboarder",
        "property_of",
        "shadow, shade, theme",
        "vehicle",
        "surfboard, bike, boat",
        "writing",
        "graffiti, map"
      ]
    },
    {
      "heading": "5. A heuristic coreference algorithm",
      "text": [
        "Based on WordNet candidate synsets, we define a heuristic algorithm that finds the optimal entity assignment for the mentions associated with each image.",
        "This algorithm is based on the principles driving our generative model described below, and on the observation that salient entities will be mentioned in many captions and that captions tend to use similar words to describe the same entity.",
        "Simple heuristic algorithm:",
        "1.",
        "For each noun, choose the synset that appears in the most number of captions of an image, and break ties by choosing the synset that covers the fewest distinct lemmatized nouns.",
        "2.",
        "Group all of the noun phrase chunks that share a synset into a single coreference chain."
      ]
    },
    {
      "heading": "6. Bayesian coreference models",
      "text": [
        "Since we cannot afford to manually annotate our entire data set with coreference information, we follow Haghighi and Klein (2007)'s work on unsupervised coreference resolution, and develop a series of generative Bayesian models for our task.",
        "In our first model, based on Haghighi and Klein's baseline Dirichlet Process model, each image i corresponds to the set of observed mentions w!from across its captions.",
        "Image i has a hidden global topic Ti, drawn from a distribution with a GEM prior with hyperparameter 7 as explained by Teh et al.",
        "(2006).",
        "In a Dirichlet process, the GEM distribution is an infinite analog of the Dirichlet distribution, allowing for a potentially infinite number of mixture components.",
        "P(Ti = t) is proportional to 7 if t is a new component, or to the number of times t has been drawn before otherwise.",
        "Given a topic choice Ti = t, entity type assignments Zj for all mentions Wj in image i are in turn drawn from a topic-specific multinomial 0t over all possible entity types E that was drawn from a Dirichlet prior with hyperparameter ß.",
        "Similarly, given an entity type Zi = z, each corresponding (observed) head word Wj is drawn from an entity type-specific multinomial 0z over all possible words V, drawn from a finite Dirichlet prior with hyperparameter a.",
        "The set of all images belonging to the same topic is analogous to an individual document in Haghighi and Klein's baseline model.",
        "All headwords of the same entity type are assumed to be coreferent, similar to Haghighi and Klein's model.",
        "As described in section 4, we use WordNet to identify the subset of types that can actually produce the given words.",
        "Therefore, similar to the way Andrzejewski and Zhu (2009) handled a priori knowledge of topics, we will define an indicator variable bij that is 1 iff the WordNet information allows word i to be produced from entity set j and 0 otherwise.",
        "We find arg maxZ TP(Z, T|X) with Gibbs sampling.",
        "Here, Z and T are the collection of type and topic assignments, with Z-j = Z – {Zj j and Ti = T – {Ti j.",
        "This style of notation will be extended analogously to other variables.",
        "Let ne>xrepresent the number of times word x is produced from entity e across all topics and let pj be the number of images assigned to topic j.",
        "Let mt,erepresent the number of times entity type e is generated by topic t. Each iteration consists of two steps: first, each Zi is resampled, fixing T; and then each Ti is resampled based on Z."
      ]
    },
    {
      "heading": "1.. Sampling Zj:",
      "text": []
    },
    {
      "heading": "2.. Sampling Ti:",
      "text": [
        "I pj Otherwise",
        "Image 21: Caption 1: {x2i,i:a golden retriever; X2i,2 :a smaller black and brown dog; X2i,3.a pink collar} Caption 2: {X2i,4\\a smaller black dog; X2i,5:a larger brown dog; X2i,e\\a forest} Caption 3: {X2i,7\\small black and brown dog; X2i,8\\a large orange dog} Caption 4: {X2i,9\\brown dog; X2i,io:mouth; X2i,ii:head; X2i,i2\\black and tan dog} Caption 5: {X2i,i3\\two dogs; X2i,i4\\the woods}",
        "Figure 2: Models 1 and 2 as Chinese restaurant franchises: each image topic is a franchise, each image is a restaurant, each entity is a table, each mention is a customer.",
        "Model 2 adds attributes (in italics).",
        "Model 0 does not have an explicit representation of entities beyond their type and thus cannot distinguish multiple entities of the same type in an image.",
        "Although Model 1 also represents mentions only by their head words (and thus cannot distinguish black dog from brown dog), it creates explicit entities based on the Chinese restaurant franchise interpretation of the hierarchical Dirich-let Process model (Teh et al., 2006).",
        "Figure 2 (ignoring the modifiers / attributes for now) illustrates the Chinese restaurant franchise interpretation of our model.",
        "Using this metaphor, there are a series of restaurants (= images), each consisting of a potentially infinite number of tables (= entities), that are frequented by customers (= entity mentions) who will be seated at the tables.",
        "Restaurants belong to franchises (= image topics).",
        "Each table is served one dish (= entity type, e.g. Dog, C lothing) shared by all the customers.",
        "The head word of a mention xi;j is generated in the following manner: customer j enters restaurant i (belonging to franchise Ti) and sits down at one of the existing tables with probability proportional to the number of other customers there, or sits at a new table with probability proportional to a constant.",
        "A dish (Dog) from a potentially infinite menu is served to each new table a, with probability proportional to the total number of tables it is served at in the franchise Ti (or to a constant if it is a new dish).",
        "The (observed) head word of the mention xj;i (dog, retriever) is then drawn from the multinomial distribution over words defined by the entity type (Dog) at the table.",
        "The menu (set of dishes) available to each restaurant and table is restricted by our lexicon of WordNet synsets for each mention.",
        "More formally, each image topic t defines a distribution over entities drawn from a global GEM prior with hyperparameter k. Therefore, the probability of an entity a is proportional to the number of its existing mentions in images of the same topic, or to k, if it is previoulsy unmentioned.",
        "The type of each entity, ea, is drawn from a topic-dependent multinomial with global Dirich-let prior.",
        "The head words of mentions are generated by their entity type as in Model 0.",
        "Mentions assigned to the same entity are considered to be coreferent.",
        "Based on the nature of our corpus, we again assume that two words cannot be coreferent within a sentence, restrict the distribution to not allow inter-sentence coreference and renormalize the values accordingly.",
        "There are three parts to our resampling procedure: resampling the entity assignment for each word, resampling the entity type for each entity, and resampling the topic of each image.",
        "The kth word of image i, sentence j, will now be wj k; is the entity type of entity a in image i; aj k is the entity that word k of sentence j is produced from in image i, and Zj k represents that entity's type.",
        "a is the set of all current entity assignments and e are the type assignments for entities.",
        "m is now defined as the number of entities of a certain type being drawn for an image, n is defined as before and ci;(l is the number of times entity a is expressed in image i.",
        "Topics are resampled as in Model 0.",
        "Entity Assignment Resampling Entity assignments for words are resampled one sentence at a time in the order the headwords appear in the sentence.",
        "For each word in the sentence, entity assignments are defined by the distribution of Figure 3.",
        "The headword is assigned to an existing entity with probability proportional to the number of entities already assigned to that entity and the probability that the entity emits that word.",
        "The word is assigned to a new entity with a newly drawn entity type with probability proportional k, the probability that the entity type is for an image ofthe given topic (normalized overWordNet's possible entities for the word), and the probability the drawn type produces the word.",
        "pj a = 1 iff entity a of image i does not appear in sentence j and pj a = 0 otherwise.",
        "a-(i j'k'|k'^k) represents removing the kth or later words in sentence j of image i Entity Type Resampling Fixing the assignments, the type of each entity is redrawn based on the distribution in Figure 3.",
        "It is proportional to the probability that a certain entity type is in an image of a given topic and, independently for each of the words, the probability that the given word expresses the type.",
        "the number of times entity type e is expressed as word x not counting the words attached to the currently entity being re-sampled and m ''a is the number of times an entity of type e appears in an image of topic t not counting the current entity being resampled.",
        "The probability of a given image belonging to a topic is proportional the number of images already in the topic (or 7) followed by the probability that each of the entities in the image were drawn from that topic.",
        "Certain entities cannot be distinguished simply by head word alone, such in the example in Figure 2.",
        "Model 2 augments Model 1 with the ability to generate modifiers.",
        "In addition to an entity type, each entity draws an attribute from a global distribution drawn from a GEM distribution with hyperparameter r\\.",
        "An attribute is a multinomial distribution, on possible modifier words, drawn from a Dirichlet prior with parameter Z.",
        "From the attribute, each modifier word is drawn independently.",
        "Therefore given an attribute b and a set of modifiers d: P(d|b) oc Yided(sd + Z) where sd is number of times modifier d is produced by attribute b.",
        "In addition, the probability of a certain attribute b given all other assignments is given by:",
        "P(bi = blb-i'a) oc i n, If its a new attribute I rb, Otherwise",
        "where rb is the number of entities with attribute b.",
        "As in Model 1, mentions assigned to the same entity are considered coreferent.",
        "Consider the \"smaller black dog\" mention in Figure 2.",
        "When the mention is being resampled, the attribute choice for each table will bias the probability distribution towards the table whose attribute is more likely to produce \"smaller\" and \"black\" .",
        "Therefore, the model can now better distinguish the two dogs in the image.",
        "The addition of modifiers only directly effects the distribution when resampling entity assignments since attributes are independent of entity types, image topics, and headwords of noun phrases.",
        "The sampling distribution are again shown in Figure 3.",
        "In a separate sampling step, it is now necessary to resample the attribute assigned to each entity: The probability of drawing a certain attribute is illustrated in Figure 3 with Da as the set of all the modifiers of all the noun phrases currently assigned to entity a of image i, and s-d' as the number of times attribute b produces modifier d without the current assignment of entity a of image i.",
        "The topic assignments for each image are initialized to correspond to the Flickr groups the images were taken from.",
        "Each mention was initialized as its own entity with type and attribute sampled from a uniform distribution.",
        "As our training is unsupervised, each of the models were ran on the entire dataset.",
        "For Model 0, after burn-in, 20 samples of Z were taken spaced 200 iterations apart, while for Model 1 samples were taken spaced 100 apart, and 25 apart for Model 2.",
        "The implementation of Model 2 ran too slow to effectively judge when burn in occurred, impacting the results.",
        "The values of parameters a, ß, 7, k, r, Z, and the number of initial attributes were hand-tuned based on the average performance on our annotated development subset of 100 images."
      ]
    },
    {
      "heading": "7. Evaluation of coreference resolution",
      "text": [
        "We evaluate each of the generative models and the heuristic coreference algorithm on the annotated test subset of our corpus consisting of 100 images with both the OpenNLP chunking and the gold standard chunking.",
        "We report our scores based on the MUC evaluation metric.",
        "The results are reported in Table 2 as the average scores across all the samples of two independent runs of each model.",
        "We also present results on Model 0 without using WordNet where every word can be an expression of one of 200 fake entity sets.",
        "The same table also shows the performance of a baseline model and the upper bound on performance imposed by WordNet.",
        "A baseline model: In our baseline model, two noun phrases in captions of the same image are coreferent if they share the same head noun.",
        "Upper bound on performance: Although WordNet synsets provide a good indication of whether two mentions can refer to the same entity or not, they may also be overly restrictive in other cases.",
        "We measure the upper bound on performance that our reliance on WordNet imposes by finding the best-scoring coreference assignment that is consistent with our lexicon.",
        "This achieves an F-score of 90.2 on the test data with gold chunks.",
        "Performance increases in each subsequent model.",
        "The heuristic beats each of the models, but in some sense it is an extreme version of Model 1.",
        "Both it and Model 1 attempt to produce entity sets that cover as many captions as possible, while minimizing the number of distinct words involved.",
        "The heuristic locally forces this case, at the expense of no longer being a generative model."
      ]
    },
    {
      "heading": "8. Ontological Class Prediction",
      "text": [
        "As a further step towards understanding the semantics of images, we develop a model that labels each entity with one of the ontological classes defined in section 2.",
        "The immediate difficulty of this task is that our ontology includes not only semantic distinctions, but also spatial and visual ones.",
        "While it may be easy to tell which words are animals and which are people, there is only a fine distinction at the language level whether an object is movable, fixed, or part of the background.",
        "We define our task as a classification problem, where each entity must be assigned to one of twenty classes defined by our ontology.",
        "We use a Maximum Entropy classifier, implemented in the Mallet toolkit (McCallum, 2002), and define the following text features:",
        "NP Chunk: We include all the words in the NP chunk, unfiltered.",
        "WordNet Synsets and Hypernyms: The most likely synset is either the first one that appears in WordNet or one of the ones predicted by our coref-erence system.",
        "For each of these possibilities, we include all of that synset's hypernyms.",
        "Syntactic Role: We parsed our captions with the C&C parser (Clark and Curran, 2007), and record whether the word appears as a direct object of a verb, as the object of a preposition, as the subject of the sentence, or as a modifier.",
        "If it is a modifier, we also add the head word of the phrase being modified.",
        "We use two baselines.",
        "The naive baseline categorizes words by selecting the most frequent class of the word.",
        "If no instances of the word have occurred, it uses the overall most frequent class.",
        "The WordNet baseline works by finding the most frequent class amongst the most relevant synsets for a word.",
        "It calculates the class frequency for each synset by assuming each word has the sense of its first synset and incrementing the frequency of the first synset and its hypernyms.",
        "When categorizing a word, it finds the set of closest hypernyms of the word that have a non-zero frequency, and chooses the class with the greatest sum of frequency counts amongst those hypernyms.",
        "We train the MaxEnt classifier using semi-supervised learning.",
        "Initially, we train a classifier using the 500 sentence gold standard development set.",
        "For each class, we use the top 5% of the labels to label the unlabeled data and provide additional training data.",
        "We then retrain the classifier on the newly labeled examples and the development set, and run it on the test set.",
        "For each coref-erence chain in the test set, we relabel all of the mentions in the chain to use the majority class, if a clear majority exists.",
        "If no such majority exists, we leave the labels as is.",
        "The MaxEnt classifier experiments were conducted by varying the source of the synset assigned to each word.",
        "For each of our coreference systems, we report two scores (Table 3).",
        "The first is the average accuracy when using the output from two runs of each model with about 20 samples per run, and the second uses the output that performs best on the coreference task when scored on the development data.",
        "Discussion Although we use WordNet to classify our entity mentions, we designed our ontology by considering only the images and their captions, with no particular mapping to WordNet in mind.",
        "Therefore, these experiments provide of a proof of concept for the semi-supervised labeling of a corpus using any semantic/visual ontology.",
        "Overall, Model 2 had the best performance for this task.",
        "This demonstrates that the additional features of Model 2 force synset selections that are consistent across the entire corpus, and are sensitive to the modifiers appearing with them.",
        "The WordNet heuristic selects synsets in a fairly arbitrary manner - all other things being equal, the synsets are chosen without reference to what other synsets are chosen by similar clusters of nouns."
      ]
    },
    {
      "heading": "9. Evaluating entity prediction",
      "text": [
        "Together, the coreference resolution algorithm and ontology classification model provide us with a set of distinct, ontologically-categorized entities appearing in each image.",
        "We perform a final experiment to evaluate how well our models can recover the mentioned entities and their ontological types for each image.",
        "We now represent each entity as a tuple (L, c), where L is its coreference chain, and c is the ontological class of these mentions.",
        "We compute the precision and recall between the predicted and gold standard tuples for each image.",
        "We consider a tuple (L',c') correctly predicted only when a copy of (L',c') occurs both in the set of predicted tuples and the set of gold standard tuples.",
        "Then, as usual, for precision we",
        "Model",
        "OpenNLP chunks",
        "Gold chunks",
        "Rec.",
        "Prec.",
        "F1",
        "Rec.",
        "Prec.",
        "F1",
        "Baseline",
        "57.3",
        "89.5",
        "69.9",
        "64.1",
        "96.2",
        "77.0",
        "Upper bound",
        "82.1",
        "100",
        "90.2",
        "WN Heuristic",
        "70.6",
        "84.8",
        "77.0",
        "80.4",
        "90.6",
        "85.2",
        "Model 0 w/o WN",
        "79.7",
        "59.8",
        "68.4",
        "85.1",
        "62.7",
        "72.2",
        "Model 0",
        "66.8",
        "83.1",
        "74.1",
        "75.9",
        "90.3",
        "82.5",
        "Model 1",
        "69.6",
        "83.8",
        "76.0",
        "78.0",
        "90.8",
        "83.9",
        "Model 2",
        "69.2",
        "84.4",
        "76.1",
        "77.9",
        "91.5",
        "84.1",
        "Classifier (synset prediction)",
        "Accuracy (gold chunks)",
        "Naive Baseline",
        "72.0",
        "WordNet Baseline",
        "81.0",
        "MaxEnt (1st-synset)",
        "84.4",
        "MaxEnt (WN heuristic)",
        "82.7",
        "Avg.",
        "a",
        "Best-Coref",
        "MaxEnt (Model 1)",
        "83.9 0.5",
        "84.5",
        "MaxEnt (Model 2)",
        "84.1 0.4",
        "85.3",
        "Table 4: Overall entity recovery.",
        "We measure how many entities we identify correctly (requiring complete recovery of their coreference chains and correct prediction of their ontological class.",
        "normalize the number of overlapping tuples by the number of predicted tuples, and for recall, by the number of gold standard tuples.",
        "We report average precision and recall over all images in our test set.",
        "We report scores for four different pairs of ontological class and coreference chain predictions.",
        "As a baseline, we use the ontological classes predicted by the our naive baseline and the chains predicted by the \"same-words-are-coreferent\" coref-erence resolution baseline.",
        "We also report results using the classes and chains predicted by Model 1, Model 2, and the WordNet Heuristic Algorithm.",
        "The influence of the different coreference algorithms comes from the entity types that are used to determine corefer-ence chains, and that also correspond to WordNet candidate synsets.",
        "In other words, although the final coreference chain may be predicted by two different models, the synsets they use to do so may differ, affecting the synset and hypernym features used for ontological prediction.",
        "We present results in Table 4 for these four different set-ups.",
        "The synsets chosen by the different corefer-ence algorithms clearly have different applicability when it comes to ontological class prediction.",
        "Although Model 2 performs comparably to Model 1 and does worse than the WordNet heuristic algorithm for coreference chain prediction, it certainly does better on this task.",
        "Since our end goal is creating a unified semantic representation, this final task judges the effectiveness of our models to capture the most detailed entity information.",
        "The success of Model 2 means that the incorporation of adjectives informs the proper choice of synsets that are useful in predicting ontological classes."
      ]
    },
    {
      "heading": "10. Conclusion",
      "text": [
        "As a first step towards automatic image understanding, we have collected a corpus of images as-",
        "incomplete coreference chaining both completely change the semantics of an image.",
        "sociated with several simple descriptive captions, which provide more detailed information about the image than simple keywords.",
        "We plan to make this data set available for further research in computer vision and natural language processing.",
        "In order to enable the creation of a semantic representation of the image content that is consistent with the captions in our data set, we use WordNet and a series of Bayesian models to perform cross-caption coreference resolution.",
        "Similar to Haghighi and Klein (2009), who find that linguistic heuristics can provide very strong baselines for standard coreference resultion, relatively simple heuristics based on WordNet alone perform surprisingly well on our task, although they are outperformed by our Bayesian models for overall entity prediction.",
        "Since our generative models are based on Dirichlet Process priors, they are designed to favor a small number of unique entities per image.",
        "In the heuristic algorithm, this bias is built in explicitly, resulting in slightly higher performance on the coreference resolution task.",
        "However, while the generative models can use global information to learn what entity type each word is likely to represent, the heuristic is unable to capture any non-local information about the entities, and thus provides less useful input for the prediction of ontological classes.",
        "Future work will aim to improve on these results by overcoming the upper bound on performance imposed by WordNet, and through a more sophisticated model of modifiers.",
        "We will also investigate how image features can be incorporated into our model to improve performance on entity detection.",
        "Ultimately, identifying the depicted entities from multiple image captions will require novel ways to correctly handle the semantics of plural NPs (i.e. that one caption's \"two dogs\" consist of another's \"golden retreiver\" and \"smaller black dog\" ).",
        "We foresee similar challenges when dealing with verbs and events.",
        "The creation of an actual semantic representation of the image content is a challenging problem in itself, since the different captions often focus on different aspects of the depicted situation, or provide different interpretation of ambiguous situations.",
        "We believe that this poses many interesting challenges for natural language processing, and will ultimately require ways to integrate the information conveyed in the caption with visual features extracted from the image.",
        "Model",
        "Recall",
        "Precision",
        "F-score",
        "Baseline",
        "28.4",
        "20.6",
        "23.9",
        "WordNet Heuristic",
        "48.3",
        "43.9",
        "46.0",
        "Model 1 (avg)",
        "51.7",
        "42.8",
        "46.8",
        "Model 1 (best-coref)",
        "50.9",
        "45.4",
        "48.0",
        "Model 2 (avg)",
        "52.2",
        "42.7",
        "47.0",
        "Model 2 (best-coref)",
        "52.3",
        "46.0",
        "49.0"
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This research was funded by NSF grant IIS 0803603 INT2-Medium: Understanding the Meaning of Images.",
        "We are grateful for David Forsyth and Dan Roth's advice, and for Alex Sorokins support with MTurk."
      ]
    }
  ]
}
