{
  "info": {
    "authors": [
      "Stephan Gouws",
      "G-J van Rooyen",
      "Herman A. Engelbrecht"
    ],
    "book": "Proceedings of the 2nd Workshop on the People’s Web Meets NLP: Collaboratively Constructed Semantic Resources",
    "id": "acl-W10-3506",
    "title": "Measuring Conceptual Similarity by Spreading Activation over Wikipedia’s Hyperlink Structure",
    "url": "https://aclweb.org/anthology/W10-3506",
    "year": 2010
  },
  "references": [
    "acl-W09-3206"
  ],
  "sections": [
    {
      "text": [
        "Measuring Conceptual Similarity by Spreading Activation over Wikipedia's Hyperlink Structure",
        "Stephan Gouws, G-J van Rooyen, and Herman A. Engelbrecht",
        "Stellenbosch University",
        "{stephan,gvrooyen,hebrecht}@ml.sun.ac.za",
        "Keyword-matching systems based on simple models of semantic relatedness are inadequate at modelling the ambiguities in natural language text, and cannot reliably address the increasingly complex information needs of users.",
        "In this paper we propose novel methods for computing semantic relatedness by spreading activation energy over the hyperlink structure of Wikipedia.",
        "We demonstrate that our techniques can approach state-of-the-art performance, while requiring only a fraction of the background data."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The volume of information available to users on the World Wide Web is growing at an exponential rate (Lyman and Varian, 2003).",
        "Current keyword-matching information retrieval (IR) systems suffer from several limitations, most notably an inability to accurately model the ambiguities in natural language, such as synonymy (different words having the same meaning) and polysemy (one word having multiple different meanings), which is largely governed by the context in which a word appears (Metzler and Croft, 2006).",
        "In recent years, much research attention has therefore been given to semantic techniques of information retrieval.",
        "Such systems allow for sophisticated semantic search, however, require the use of a more difficult-to-understand query-syntax (Tran et al., 2008).",
        "Furthermore, these methods require specially encoded (and thus costly) ontologies to describe the particular domain knowledge in which the system operates, and the specific interrelations of concepts within that domain.",
        "In this paper, we focus on the problem of computationally estimating similarity or relatedness between two natural-language documents.",
        "A novel technique is proposed for computing semantic similarity by spreading activation over the hyperlink structure of Wikipedia, the largest free online encyclopaedia.",
        "New measures for computing similarity between individual concepts (inter-concept similarity, such as \"France\" and \"Great Britain\"), as well as between documents (inter-document similarity) are proposed and tested.",
        "It will be demonstrated that the proposed techniques can achieve comparable inter-concept and inter-document similarity accuracy on similar datasets as compared to the current state of the art Wikipedia Link-based Measure (WLM) (Witten and Milne, 2008) and Explicit Semantic Analysis (ESA) (Gabrilovich and Markovitch, 2007) methods respectively.",
        "Our methods outperform WLM in computing inter-concept similarity, and match ESA for inter-document similarity.",
        "Furthermore, we use the same background data as for WLM, which is less than 10% of the data required for ESA.",
        "In the following sections we introduce work related to our work and an overview of our approach and the problems that have to be solved.",
        "We then discuss our method in detail and present several experiments to test and compare it against other state-of-the-art methods."
      ]
    },
    {
      "heading": "2. Related Work and Overview",
      "text": [
        "Although Spreading Activation (SA) is foremost a cognitive theory modelling semantic memory (Collins and Loftus, 1975), it has been applied computationally to IR with various levels of success (Preece, 1982), with the biggest hurdle in this regard the cost of creating an associative network or knowledge base with adequate conceptual coverage (Crestani, 1997).",
        "Recent knowledge-based methods for computing semantic similarity between texts based on Wikipedia, such as Wikipedia Link-based Measure (WLM) (Witten and Milne, 2008) and Explicit Semantic Analysis (ESA) (Gabrilovich and Markovitch, 2007), have been found to outperform earlier WordNet-based methods (Bu-danitsky and Hirst, 2001), arguably due to Wikipedia's larger conceptual coverage.",
        "WLM treats the anchor text in Wikipedia articles as links to other articles (all links are treated equally), and compare concepts based on how much overlap exists in the out-links of the articles representing them.",
        "ESA discards the link structure and uses only the text in articles to derive an explicit concept space in which each dimension represents one article/concept.",
        "Text is categorised as vectors in this concept space and similarity is computed as the cosine similarity of their ESA vectors.",
        "The most similar work to ours is Yeh (2009) in which the authors derive a graph structure from the inter-article links in Wikipedia pages, and then perform random walks over the graph to compute relatedness.",
        "In Wikipedia, users create links between articles which are seen to be related to some degree.",
        "Since links relate one article to its neighbours, and by extension to their neighbours, we extract and process this hyperlink structure (using SA) as an Associative Network (AN) (Berger et al., 2004) of concepts and links relating them to one another.",
        "The SA algorithm can briefly be described as an iterative process of propagating real-valued energy from one or more source nodes, via weighted links over an associative network (each such a propagation is called a pulse).",
        "The algorithm consists of two steps: First, one or more pulses are triggered, and second, termination checks determine whether the process should continue or halt.",
        "This process of activating more and more nodes in the network and checking for termination conditions are repeated pulse after pulse, until all termination conditions are met, which results in a final activation state for the network.",
        "These final node activations are then translated into a score of relatedness between the initial nodes.",
        "Our work presents a computational implementation of SA over the Wikipedia graph.",
        "We therefore overcome the cost of producing a knowledge base of adequate coverage by utilising the collaboratively-created knowledge source Wikipedia.",
        "However, additional strategies are required for translating the hyperlink structure of Wikipedia into a suitable associative network format, and for this new techniques are proposed and tested."
      ]
    },
    {
      "heading": "3. Extracting the Hyperlink Graph Structure",
      "text": [
        "One article in Wikipedia covers one specific topic (concept) in detail.",
        "Hyperlinks link a page A to a page B, and are thus directed.",
        "We can model Wikipedia's hyperlink structure using standard graph theory as a directed graph G, consisting of a set of vertices V, and a set of edges E. Each edge eij G E connects two vertices Vi,Vj G V. For consistency, we use the term node to refer to a vertex (Wikipedia article) in the graph, and link to refer to an edge (hyperlink) between such nodes.",
        "In this model, each Wikipedia article is seen to represent a single concept, and the hyperlink structure relates these concepts to one another.",
        "In order to compute relatedness between two concepts Viand Vj, we use spreading activation and rely on the fundamental principle of an associative network, namely that it connects nodes that are associated with one another via real-valued links denoting how strongly the objects are related.",
        "Since Wikipedia was not created as an associative network, but primarily as an online encyclopaedia, none of these weights exist, and we will have to deduce these (see Fanout constraint in Section 4).",
        "Links into pages are used, since this leads to better results (Witten and Milne, 2008).",
        "The Wikipedia graph structure is represented in an adjacency list structure, i.e. for each node Vj we store its list of neighbour nodes in a dictionary using vj's id as key.",
        "This approach is preferred over an adjacency matrix structure, since most articles are linked to by only 34 articles on average, which would lead to a very sparse adjacency matrix structure.",
        "4 Adapting Spreading Activation for Wikipedia's Hyperlink Structure",
        "Each pulse in the Spreading Activation (SA) process consists of three stages: 1) pre-adjustment, 2) spreading, and 3) post-adjustment (Crestani, 1997).",
        "During pre-and post-adjustment, some form of activation decay is optionally applied to the active nodes.",
        "This serves both to avoid retention of activation from previous pulses, and, from a connectionist point of view, models 'loss of interest when nodes are not continually activated.",
        "Let aj;in denote the total energy input (activation) for node Vj, and N(v) the set of Vj's neighbour nodes with incoming links to v%.",
        "Also, let aj)OUt denote the output activation of a node Vj connected to node v%, and let Wj denote the weight of connection between node Vj and Vj.",
        "For a node Vj, we can then describe the pure model of spreading activation as follows:",
        "vj EN (vi)",
        "This pure model of SA has several significant problems, the most notable being that activation can saturate the entire network unless certain constraints are imposed, namely limiting how far activation can spread from the initially activated nodes (distance constraint), and limiting the effect of very highly-connected nodes (fan-out constraint) (Crestani, 1997).",
        "In the following three sections we discuss how these constraints were implemented in our model for SA.",
        "Distance constraint",
        "For every pulse in the spreading process, a node s activation value is multiplied by a global network decay parameter 0 < d < 1.",
        "We therefore substitute wjj in Equation 1 for wjj d. This decays activation exponentially in the path length.",
        "For a path length of one, activation is decayed by d, for a path length of two, activation is decays by dd = d, etc.",
        "This penalises activation transfer over longer paths.",
        "We also include a maximum path length parameter Lp max which limits how far activation can spread.",
        "Fan-out constraint",
        "As noted above, in an associative network, links have associated real-valued weights to denote the strength of association between the two nodes they connect (i.e. wjj in Equation 1).",
        "These weights have to be estimated for the Wikipedia hyperlink graph, and for this purpose we propose the use of three weighting schemes:",
        "In pure Energy Distribution (ED), a node Vj's weight w is made inversely proportional to its in-degree (number of neighbours N(Vj) > 1 with incoming links to Vj).",
        "Thus ED(Vj, Vj) = wjj = |N(1v.)|.",
        "This reduces the effect of very connected nodes on the spreading process (constraint 2 above).",
        "For instance, we consider a path connecting two nodes via a general article such as USA (connected to 322,000 articles) not nearly as indicative of a semantic relationship, as a path connecting them via a very specific concept, such as Hair Pin (only connected to 20 articles).",
        "Inverse Link-Frequency (ILF) is inspired by the term-frequency inverse document-frequency (tf-idf) heuristic (Salton and McGill, 1983) in which a term s weight is reduced as it is contained in more documents in the corpus.",
        "It is based on the idea that the more a term appears in documents across the corpus, the less it can discriminate any one of those documents.",
        "We define a node Vj's link-frequency as the number of nodes that Vj is connected to |N(Vj)| divided by the number of possible nodes it could be connected to in the entire Wikipedia graph",
        "and therefore give the log-smoothed inverse link-frequency of node Vj as:",
        "As noted above for pure energy distribution, we consider less connected nodes as more specific.",
        "If one node connects to another via a very specific node with a low in-degree, iN^Fyi is very large and ILF(vj) > 1, thus boosting that specific link's weight.",
        "This has the effect of 'boosting' paths (increasing their contribution) which contain nodes that are less connected, and therefore more meaningful in our model.",
        "To evaluate the effect of this boosting effect described above, we also define a third normalised weighting scheme called the Normalised Inverse Link-Frequency (NILF), 0 < NILF(vj) < 1:",
        "ILF reaches a maximum of log |G| when IN(t>j)| = 1 (see Equation 2).",
        "We therefore divide by log |G| to normalise its range to [0,1].",
        "Threshold constraint",
        "Finally, the above-mentioned constraints are enforced through the use of a threshold parameter 0 < T < 1.",
        "Activation transfer to a next node ceases when a node's activation value drops below a certain threshold T."
      ]
    },
    {
      "heading": "5. Strategies for Interpreting Activations",
      "text": [
        "After spreading has ceased, we are left with a vector of nodes and their respective values of activation (an activation vector).",
        "We wish to translate this activation vector into a score resembling strength of association or relatedness between the two initial nodes.",
        "We approach this problem using two different approaches, the Target Activation Approach (TAA) and the Agglomerative Approach (AA).",
        "These approaches are based on two distinct hypotheses, namely: Relatedness between two nodes can be measured as either 1) the ratio of initial energy that reaches the target node, or 2) the amount of overlap between their individual activation vectors by spreading from both nodes individually.",
        "Target Activation Approach (TAA)",
        "To measure the relatedness between Vj and Vj, we set aj to some initial value Kinit (usually 1.0), and all node activations including aj = 0.",
        "After the SA process has terminated, Vj is activated with some aj,in.",
        "Relatedness is computed as the ratio simTAA(vi, Vj) - |gt.",
        "Agglomerative Approach (AA)",
        "The second approach is called the Agglomerative Approach since we agglomerate all activations into one score resembling relatedness.",
        "After spreading has terminated, relatedness is computed as the amount of overlap between the individual nodes' activation vectors, using either the cosine similarity (AA-cos), or an adapted version of the information theory based WLM (Wit-ten and Milne, 2008) measure.",
        "Assume the same set of initial nodes Vj and Vj.",
        "Let Ak be the N-dimensional vector of real-valued activation values obtained by spreading over the N nodes in the graph from node Vk(called an activation vector).",
        "We use akx to denote the element at position x in Ak.",
        "Furthermore, let Vk = (Vfci,VkM} denote the set of M nodes activated by spreading from Vk, i.e. the set of identifiers of nodes with non-zero activations in Ak after spreading has terminated (and therefore M < N).",
        "We then define the cosine Agglomerative Approach (henceforth called AA-cos) as simAA,cos (Aj, Aj )",
        "For our adaptation of the Wikipedia Link-based Measure (WLM) approach to spreading activation, we define the WLM Agglomerative Approach (henceforth called AA-wlm) as",
        "SimAA,wlm(Vi, Vj)",
        "with |G| representing the number of nodes in the entire Wikipedia hyperlink graph.",
        "Note that the AA-wlm method does not take activations into account, while the AA-cos method does."
      ]
    },
    {
      "heading": "6. Spreading Activation Algorithm",
      "text": [
        "Both the TAA and AA approaches described above rely on a function to spread activation from one node to all its neighbours, and iteratively to all their neighbours, subject to the constraints listed.",
        "TAA stops at this point and computes relatedness as the ratio of energy received to energy sent between the target and source node respectively.",
        "However, AA repeats the process from the target node and computes relatedness as some function (cosine or information theory based) of the two activation vectors, as given by Equation 4 and Equation 5.",
        "We therefore define Spread_Unidir() as shown in Algorithm 1.",
        "Prior to spreading from some node Vj, its activation value aj is set to some initial activation value Kinit (usually 1.0).",
        "The activation vector A is a dynamic node-value-pair list, updated in-place.",
        "P is a dynamic list of nodes in the path to v to avoid cycles."
      ]
    },
    {
      "heading": "7. Parameter Optimisation: Inter-concept Similarity",
      "text": [
        "The model for SA as introduced in this paper relies on several important parameters, namely the spreading strategy (TAA, AA-cos, or AA-wlm), weighting scheme (pure ED, ILF, and NILF), maximum path length Lp max, network decay d, and threshold T. These parameters have a large influence on the accuracy of the proposed technique, and therefore need to be optimised.",
        "Experimental Method",
        "In order to compare our method with results reported by Gabrilovich and Markovitch (2007) and Witten and Milne (2008), we followed the same approach by randomly selecting Algorithm 1 Pseudo code to spread activation depth-first from node v up to level Lp max, using global decay d, and threshold T, given an adjacency list graph structure G and a weighting scheme W such that 0 < Wj G W < 1.",
        "Require: G,Lpmax,d,T",
        "function spread_unidir(vt, A, P) if (vi,ai) e A or at < T then > Threshold",
        "return end if",
        "Add vt to P > To avoid cycles for vj e N(vt) do > Process neighbours if (vj, aj ) e A then",
        "if vj e P and |P| < Lp,max then a* = aj + at * wij * d Replace (vj ,aj ) e A with (vj, aj* ) spread_unidir(vj, A, P)",
        "end if end for return end function",
        "50 word-pairs from the WordSimilarity-353 dataset (Gabrilovich, 2002) and correlating our method's scores with the human-assigned scores.",
        "To reduce the possibility of overestimating the performance of our technique on a sample set that happens to be favourable to our technique, we furthermore implemented a technique of repeated holdout (Witten and Frank, 2005):",
        "Given a sample test set of N pairs of words with human-assigned ratings of relatedness, randomly divide this set into k parts of roughly equal size.",
        "Hold out one part of the data and iteratively evaluate the performance of the algorithm on the remaining k – 1 parts until all k parts have been held out once.",
        "Finally, average the algorithm's performance over all k runs into one score resembling the performance for that set of parameters.",
        "Since there are five parameters (spreading strategy, weighting scheme, path length, network decay, and threshold), a grid search was implemented by holding three of the five parameters constant, and evaluating combinations of decay and threshold by stepping over the possible parameter space using some step size.",
        "A coarsegrained grid search was first conducted with step",
        "Table 1: Spreading results by spreading strategy (TAA=Target Activation Approach, AA=Agglomerative Approach, Lp max = maximum path length used, ED=energy distribution only, ILF=Inverse Link Frequency, NILF=normalised ILF.)",
        "Best results in bold.",
        "size of 0.1 over d and a logarithmic scale over T, thus T = {0, 0.1, 0.01, 0.001,10-9}.",
        "The best values for d and T were then chosen to conduct a finer-grained grid search.",
        "Influence of the different Parameters",
        "The spreading strategy determines how activations resulting from the spreading process are converted into scores of relatedness or similarity between two nodes.",
        "Table 1 summarises the best results obtained for each of the three strategies, with the specific set of parameters that were used in each run.",
        "Results are better using the AA (pmax = 0.70 for AA-cos) than using the TAA (pmax = 0.56).",
        "Secondly, the AA-cos spreading strategy significantly outperforms the AA-wlm strategy over this sample set (pmax,wlm = 0.60 vs pmax,cos = 0.70).",
        "These results compare favourably to similar inter-concept results reported for WLM (Witten and Milne, 2008) (p = 0.69) and ESA (Gabrilovich and Markovitch, 2007) (p = 0.75).",
        "Maximum path length Lp maxis related to how far one node can spread its activation in the network.",
        "We extend the first-order link model used by WLM, by approaching the link structure as an associative network and by using spreading activation.",
        "To evaluate if this is a useful approach, tests were conducted by using maximum path lengths of one, two, and three.",
        "Table 2 summarises the results for this experiment.",
        "Increasing path length from one to two hops increases performance from pmax = 0.47 to pmax =",
        "Lp, max pmax Parameters",
        "0.66.",
        "Moreover, increasing Lp max from two to three hops furthermore increases performance to",
        "pmax = 0.",
        "70.",
        "In an associative network, each link has a real-valued weight denoting the strength of association between the two nodes it connects.",
        "The derived Wikipedia hyperlink graph lacks these weights.",
        "We therefore proposed three new weighting schemes (pure ED, ILF, and NILF) to estimate these weights.",
        "Table 3 summarises the best performances using the different weighting schemes.",
        "ILF outperforms both ED and NILF.",
        "Furthermore, both ED and NILF perform best using higher decay values (both 0.9) and lower threshold values (both 0.01), compared to ILF (0.5 and 0.1 respectively for d and T).",
        "We attribute this observation to the boosting effect of the ILF weighting scheme for less connected nodes, and offer the following explanation:",
        "Recall from the section on ILF that in our model, strongly connected nodes are viewed as more general, and nodes with low in-degrees are seen as very specific concepts.",
        "We argued that a path connecting two concepts via these more specific concepts are more indicative of a stronger semantic relationship than through some very general concept.",
        "In the ILF weighting scheme, paths containing these less connected nodes are automatically boosted to be more important.",
        "Therefore, by not boosting less meaningful paths, a lower decay and higher threshold effectively limits the amount of non-important nodes that are activated, since their activations are more quickly decayed, whilst at the same time requiring a higher threshold to continue spreading.",
        "Boosting more important nodes can therefore lead to activation vectors which capture the semantic context of the source nodes more accurately, leading to higher performance.",
        "Strategy",
        "Pmax",
        "Parameters",
        "TAA",
        "0.56",
        "ED, Lp,max=3, d=0.6, T=0.001",
        "AA-wlm",
        "0.60",
        "NILF, Lp,max=3, d=0.1, T=10-6",
        "AA-cos",
        "0.70",
        "ILF, Lp,maX =3, d=0.5, T=0.1"
      ]
    },
    {
      "heading": "8. Computing document similarity",
      "text": [
        "To compute document similarity, we first extract key representative Wikipedia concepts from a document to produce document concept vectors.",
        "This process is known as wikification (Csomai and Mihalcea, 2008), and we used an implementation of Milne and Witten (2008).",
        "This produces document concept vectors of the form Vi = {(idi,wi), (id2, w2),...} with idi some Wikipedia article identifier and wi a weight denoting how strongly the concept relates to the current document.",
        "We next present two algorithms, MaxSim and WikiSpread, for computing document similarity, and test these over the Lee (2005) document similarity dataset, a set of 50 documents between 51 and 126 words each, with the averaged gold standard similarity ratings produced by 83 test subjects (see (Lee et al., 2005)).",
        "The first metric we propose is called MAXSIM (see Algorithm 2) and is based on the idea of measuring document similarity by pairing up each Wikipedia concept in one document's concept vector with its most similar concept in the other document.",
        "We average those similarities to produce an inter-document similarity score, weighted by how strongly each concept is seen to represent a document (0 < pi < 1 ).",
        "The contribution of a concept is further weighted by its ILF score, so that more specific concepts contribute more to final relatedness.",
        "The second document similarity metric we propose is called the WikiSpread method and is a natural extension of the inter-concept spreadAlgorithm 2 Pseudo code for the MaxSim algorithm for computing inter-document similarity.",
        "vi is a Wikipedia concept and 0 < pi < 1 how strongly it relates to the current document.",
        "Require: ILF lookup function function MaxSim(Vi , V2) num=0 for (vi,pi) e Vi do",
        "for Vj e V2 do > Find most related topic Sj = sim(vi, Vj ) if Sj > sk then vk = Vj > Topic in V2 most related to vi",
        "end if end for",
        "return num / den end function",
        "Algorithm 3 Pseudo code for the WikiSpread algorithm for computing inter-document similarity.",
        "Kinit = 1.0._",
        "function WikiSpread(Vi , V2)",
        "Ai = 0 > Dynamic activation vectors.",
        "for (vi,pi) e V1 do > Document 1 ai = Kinit • Pi > Update ai oc pi spread_unidir(vi, Ai, 0) for (vj ,pj ) e V2 do > Document 2 spread_unidir(vj, A2, 0)",
        "Compute similarity using AA-cos or AA-wlm end function",
        "ing activation work introduced in the previous section.",
        "We view a document concept vector as a cluster of concepts, and build a single document activation vector (see Algorithm 3) - i.e. a vector of article ids and their respective activations - for each document, by iteratively spreading from each concept in the document concept vector.",
        "Finally, similarity is computed using either the AA-cos or AA-wlm methods given by Equation 4 and Equation 5 respectively.",
        "Knowledge-based approaches such as the Wikipedia-based methods can capture more complex lexical and semantic relationships than",
        "Table 4: Summary of final document similarity correlations over the Lee & Pincombe document similarity dataset.",
        "ESA score from Gabrilovich and Markovitch (2007)._ keyword-matching approaches, however, nothing can be said about concepts not adequately represented in the underlying knowledge base (Wikipedia).",
        "We therefore hypothesise that combining the two approaches will lead to more robust document similarity performance.",
        "Therefore, the final document similarity metric we evaluate (COMBINED) is a linear combination of the best-performing Wikipedia-based methods described above, and the well-known Vector Space Model (VSM) with cosine similarity and tf-idf (Salton and McGill, 1983).",
        "The results obtained on the Lee (2005) document similarity dataset using the three document similarity metrics (MaxSim, WikiSpread, and Combined) are summarised in Table 4.",
        "Of the two Wikipedia-only methods, the MaxSim method achieves the best correlation score of p = 0.68.",
        "By combining the standard cosine VSM with tf-idf with the MaxSim metric in the ratio A and (1 – A) for 0 < A < 1, and performing a parameter sweep over A, we can weight the contributions made by the individual methods and observe the effect this has on final performance.",
        "The results are shown in Fig 1.",
        "Note that both methods contribute equally (A = 0.5) to the final best correlation score of p = 0.72.",
        "This suggests that selective knowledge-based augmentation of simple VSM methods can lead to more accurate document similarity performance.",
        "Figure 1: Parameter sweep over A showing contributions from cosine (A) and Wikipedia-based MaxSim method (1 – A) to the final performance over the Lee (2005) dataset."
      ]
    },
    {
      "heading": "9. Conclusion",
      "text": [
        "In this paper, the problem of computing conceptual similarity between concepts and documents are approached by spreading activation over Wikipedia's hyperlink graph.",
        "New strategies are required to infer weights of association between articles, and for this we introduce and test three new weighting schemes and find our Inverse Link-Frequency (ILF) to give best results.",
        "Strategies are also required for translating resulting activations into scores of relatedness, and for this we propose and test three new strategies, and find that our cosine Agglomerative Approach gives best results.",
        "For computing document similarity, we propose and test two new methods using only Wikipedia.",
        "Finally, we show that using our best Wikipedia-based method to augment the cosine VSM method using tf-idf, leads to the best results.",
        "The final result of p = 0.72 is equal to that reported for ESA (Gabrilovich and Markovitch, 2007), while requiring less than 10% of the Wikipedia database required for ESA.",
        "Table 4 summarises the document-similarity results."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We thank Michael D. Lee for his document similarity data and MIH Holdings Ltd. for financially supporting this research.",
        "Pearson p",
        "Cosine VSM (with tf-idf) only",
        "0.56",
        "MaxSim method",
        "0.68",
        "WikiSpread method",
        "0.62",
        "ESA",
        "0.72",
        "Combined (Cosine + MaxSim)",
        "0.72"
      ]
    }
  ]
}
