{
  "info": {
    "authors": [
      "Lei Wang",
      "Shiwen Yu"
    ],
    "book": "Proceedings of the Joint Conference on Chinese Language Processing",
    "id": "acl-W10-4105",
    "title": "Semantic Computing and Language Knowledge Bases",
    "url": "https://aclweb.org/anthology/W10-4105",
    "year": 2010
  },
  "references": [
    "acl-J98-1001",
    "acl-J98-1004",
    "acl-P93-1022",
    "acl-W07-2004",
    "acl-W08-2123"
  ],
  "sections": [
    {
      "text": [
        "Key Laboratory of Computational Linguistics of Ministry of Education Department of English, Peking University wangleics@pku.",
        "edu.",
        "cn",
        "Shiwen Yu Key Laboratory of Computational Linguistics of Ministry of Education, Peking University yusw@pku.edu.cn"
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "As the proposition of the next-generation Web - semantic Web, semantic computing has been drawing more and more attention within the circle and the industries.",
        "A lot of research has been conducted on the theory and methodology of the subject, and potential applications have also been investigated and proposed in many fields.",
        "The progress of semantic computing made so far cannot be detached from its supporting pivot - language resources, for instance, language knowledge bases.",
        "This paper proposes three perspectives of semantic computing from a macro view and describes the current status of affairs about the construction of language knowledge bases and the related research and applications that have been carried out on the basis of these resources via a case study in the Institute of Computational Linguistics at Peking University.",
        "Semantic computing is a technology to compose information content (including software) based on meaning and vocabulary shared by people and computers and thereby to design and operate information systems (i.e., artificial computing systems).",
        "Its goal is to plug the semantic gap through this common ground, to let people and computers cooperate more closely, to ground information systems on people's life world, and thereby to enrich the meaning and value of the entire life world.",
        "(Hasida, 2007) The task of semantic computing is to explain the meaning of various constituents of sentences (words or phrases) or sentences themselves in a natural language.",
        "We believe that semantic computing is a field that addresses two core problems: First, to map the semantics of user with that of content for the purpose of content retrieval, management, creation, etc.",
        "; second, to understand the meanings (semantics) of computational content of various sorts, inc luding, but is not limited to, text, video, audio, network, software, and expressing them in a form that can be processed by machine.",
        "But the way to the success of semantic computing is not even and it has taken a quite long time for researchers to make some progress in this field.",
        "The difficulties of semantic computing involve many aspects: ambiguity, polysemy, domain of quantifier, metaphor, etc.",
        "Different individuals will have different understanding of the same word or the same sentence.",
        "Research on the theory and methodology of semantic computing still has a long way to go.",
        "Now we provide an example in a search engine to show how difficult for the computer to understand the meaning of a word.",
        "We input two sentences into Google.com Translate and the following results were returned:",
        "Example 1",
        "We know that the word \"table\" has two common meanings in English (a wooden object and a structured data report).",
        "But in Chinese they correspond to two different words biäo and M~f~ zhuô zi).",
        "From Example 1, we can see that the search engine cannot distinguish the two senses and translate them both as Thus, without semantic analysis queries in a search engine may result in very poor performance.",
        "The first principle of a search engine is based on shallow Natural Language Processing (NLP) techniques, for instance, string matching, while future direction of search engines should aim at content index and the understanding of user's intention.",
        "Semantic computing becomes applicable only with the development of deep NLP techniques.",
        "Machine Translation (MT) is the first application of digital computers in the non-digital world and semantic information is indispensable in MT research and applications.",
        "However, there has been no breakthrough to the extent of Natural Language Understanding (NLU) and semantic computing may serve as the key to some success in this field."
      ]
    },
    {
      "heading": "2. Related Work on Semantic Computing",
      "text": [
        "Semantics is an interesting but controversial topic.",
        "Many a theory has been proposed in attempt to describe what meaning really means.",
        "But up until now there has not been a theory that can describe the meaning of various language units (words, phrases and sentences) so perfectly that was accepted universally, even though Fillmore's proposition of Framework semantics (1976) is successful enough.",
        "Since Gildea et al.",
        "(2002) initiated the research on automatic semantic role labeling, many evaluations have been conducted internationally, such as Senseval-3 and SemEval 2007, as well as CoNLL SRL Shared Task 2004, 2005 and 2008.",
        "Word Sense Disambiguation (WSD) is also a very important research subject and a lot of work has been done in this regard, such as Lesk (1986), Gale et al.",
        "(1998), Jin et al.",
        "(2007) and Qu et al.",
        "(2007) as the Chinese counterpart.",
        "As to the research on computing word sense relatedness, Dagan et al. (1993) did some pilot work and Lee (1997) and Resnik (1999) contributed to the research on semantic similarity.",
        "In recent years, semantics-based analysis such as data and web mining, analysis of social networks and semantic system design and synthesis have begun to draw more attention from researchers.",
        "Applications using semantics such as search engines and question answering (Li et al., 2002), content-based multimedia retrieval and editing, natural language interfaces (Yokoi et al., 2005) based on semantics have also been attracting attentions.",
        "Even semantic computing has been applied to areas like music description, medicine and biology and GIS systems and architecture.",
        "The whole idea is how to realize human-centered computing."
      ]
    },
    {
      "heading": "3. The Theory and Methodology of Semantic Computing",
      "text": [
        "3.1 Important Questions That Need to Be Asked about Semantic Computing",
        "In the past few years there has been a growing interest in the field of semantics and semantic computing.",
        "But there are questions that have been always lingering on researchers' minds.",
        "What on earth semantics is?",
        "What is the best way to describe the meaning of a language unit?",
        "How can natural languages be processed so that we are able to benefit from human-computer interaction, or even interpersonal communication?",
        "It seems that no one can give satisfactory answers to these questions.",
        "But it is now commonly agreed that the study of semantic computing or knowledge representation is a central issue in computational linguistics.",
        "The major contributions on this topic are collected in Computational Linguistics (1987-2010) and International Journal of Semantic Computing (2007-2010).",
        "Research in computing semantics is, however, rather heterogeneous in scope, methods, and results.",
        "The traditional \"wh\" and \"how\" questions need to be asked again to understand the consequences of conceptual and linguistic decisions in semantic computing:",
        "What?",
        "What should be computed in terms of semantics?",
        "Each word is a world and its meaning can be interpreted differently.",
        "Despite the interest that semantics has received from the scholars of different disciplines since the early history of humanity, a unifying theory of meaning does not exist, no matter whether we view a language from a lexical or a syntactic perspective.",
        "In practice, the quality and type of the expressed concepts again depend upon the one who uses it: any language speaker or writer, a linguist, a psychologist, a lexicographer, or a computer.",
        "In psycholinguistics and computational linguistics, semantic knowledge is modeled with very deep and formal expressions.",
        "Often semantic models focus on some very specific aspect of language communication, according to the scientific interest of a researcher.",
        "In natural language processing, lexical entries or semantic attributes typically express linguistic knowledge as commonsensically understood and used by humans.",
        "The entries or attributes are entirely formatted in some knowledge representation and can be manipulated by a computer.",
        "Where?",
        "What are the sources of semantic knowledge?",
        "Traditionally, individual introspection is often a source of obtaining word senses.",
        "However, individual introspection brings about both theoretical and implementation problems.",
        "Theoretically, it is because \"different researchers with different theories would observe different things about their internal thoughts...\" (Anderson 1989).",
        "With regard to implementation, it is because consistency becomes a major problem when the size of the lexicon or the syntactic tree bank exceeds a few thousands entries or annotation tags.",
        "Despite the scientific interest of such experiments, they cannot be extensively repeated for the purpose of acquiring mass word sense definitions.",
        "On-line corpora and dictionaries are widely available today and provide experimental evidence of word uses and word definitions.",
        "The major advantage of on-line resources is that in principle they provide the basis for very large experiments, even though at present the methods of analysis and application are not fully developed and need further research to get satisfactory results.",
        "How?",
        "Semantic computing can be realized at various levels.",
        "The hard work is to implement a system in a real domain, or the more conceptual task of defining an effective mathematical framework to manipulate the objects defined within a linguistic model.",
        "Quite obviously the \"hows\" in the literature about semantic computing are much more important than the \"whats\" and \"wheres\".",
        "The methodology that really works in semantic computing is deeply related to the ultimate objective of NLP research, which still cannot be defined adequately so far.",
        "Why semantic computing (or NLU) has posed so great a challenge?",
        "We may attribute this to two major reasons: First, it is based on the knowledge of human language mechanism.",
        "If fully-developed complicated brains are often seen as a crowning achievement of biological evolution, the interpersonal communication is no simpler than human biological mechanism.",
        "Language has to be a crucial part of the evolutionary process, which has not been fully understood by scientific research.",
        "Second, in NLP research the language is both the target and the tool.",
        "Current NLP research focuses on either speech or written texts only.",
        "However, in the real world scenario, reading and interaction between humans are multidimensional (through different forms of information such as text, speech, or images and utilizing our different senses such as vision, hearing).",
        "It is necessary to rely on the advancements of brain science, cognitive science and other related fields and work in collaboration to produce better results.",
        "Linguistics, especially computational linguistics, has made its own contribution, and semantic computing will play an important role in NLP.",
        "There are complex many-to-many relations between the form and the meaning of a language.",
        "Semantic computing is not only the way but also the ultimate goal of natural language understanding.",
        "Although it is hard, we should not give up.",
        "Here we propose that the the ontological",
        "cognitive pragmatic semantic computing on perspective perspective As for ontologies, much progress has been made worldwide.",
        "The remarkable achievements in English include: WordNet by Princeton University, PropBank by University of Pennsylvania, etc.",
        "Also there are quite a number of efforts made on building ontologies in Chinese, which will be elaborated in Section 5.",
        "In the last few years, the main direction of semantic computing is to disambiguate language units and constructions.",
        "In the following Example 2, the word ft^ê yi biäo has two meanings in different contexts.",
        "In Chinese, word segmentation is also a problem that needs to be addressed.",
        "In Example 3,",
        "segmenting the word Ù^ÂI bai tiân é as Ù/ or Ù^K / H can result in different understanding of the sentences.",
        "Example 2",
        "jtffeUft^ft^So tâ de yi biäo hën duân zhuâng (She has a graceful appearance. )",
        "ft^fM-ffiïiA» tâ de yi biäo hën jîng què (Her meters are very accurate.)",
        "Example 3",
        "Ù^$tf~^ïi:5|t T » bai tiân é fei guô lai le (A white swan flies toward us.)",
        "Ù^îljRTLUIfli?» bai tiân é kë yï kân jiâ (A goose can guard our house at daytime.)",
        "As to WSD tasks on the word level, some problems can be solved when ontology is applied.",
        "But ambiguity can also appear on the syntactic level.",
        "For this, it is usually difficult for ontologies to do much, so we may seek help from language knowledge bases (See Section 5).",
        "The following examples of syntactic semantic analysis will illustrate how different syntactic structures will change the meaning of sentences:",
        "Example 4 zhè yàng de diàn yïng bu shi lâ ji shi shén me ?",
        "If a movie as such is not rubbish, what is it?",
        "zhè yàng de diàn yïng zën me néng shuô shi lâ ji ne?",
        "How can a movie as such be rubbish?",
        "-- gâi diàn yïng shi lâ ji -- It is rubbish.",
        "-- gâi diàn yïng bu shi lâ ji -- It is not rubbish.",
        "main contents of semantic computing include the following three aspects:",
        "semantic computing on perspective semantic computing on Example 5",
        "A grasshopper is a grasshopper, while a cricket is a cricket.",
        "-- A grasshopper is not a cricket.",
        "Rule: A is A, while B is B.--> A is not B.",
        "TëT, ° dîng shi dîng, mäo shi mäo",
        "Ding is ding, while mao is mao.",
        " – being conscientious",
        "With respect to semantic computing on cognitive level, we will use metaphor as an example.",
        "For a long time, NLP research has focused on ambiguity resolution.",
        "Can NLU be realized after ambiguity resolution?",
        "Metaphor, ins inuation, pun, hyperbole (exaggeration), humor, personification, as well as intended word usage or sentence composing, pose a great challenge to NLU research.",
        "If the computer can deal with metaphors, it will greatly improve the ability of natural language understanding.",
        "First, let's discuss the rhetorical function of a metaphor.",
        "Metaphor is extensively and skillfully used in the Chinese classic \"Book of Songs\" to boost expressiveness.",
        "Example 6",
        "zi bo zhî dông , shöu ru fei péng ; qï wu gào mù ?",
        "shuishiwéi rong» -- (wèi feng -bo xî) (Your hair is like disordered grass.)",
        "tâ shân zhî shi , kë yï gông yù» -- (xiäo yä-hèming) (Rocks from another mountain can be used to carve jade.",
        "Metaphorically this phrase means a change of method may solve the current problem.)",
        "metaphorical expressions: fsj^^c^f\" tong zhôu gong ji (Literally, to cross the river in the same boat; metaphorically, to work together with one heart while in difficulty), Mtfm^kÊL tong qiâng tië bi (Literally, walls of brass and iron; metaphorically, impregnable).",
        "The Chinese language makes use of lots of idioms or idiomatic expressions that are derived from ancient Chinese stories and fables.",
        "These idioms and idiomatic expressions are often used metaphorically and reflect historical and cultural background of the language.",
        "They are the most precious relics to the Chinese language and culture.",
        "Therefore the Chinese Idiom Knowledge Base (CIKB) was also built in 2009.",
        "CIKB consists of 38,117 entries and describes many attributes of Chinese idioms.",
        "Among the attributes, \"literal translation\", \"free translation\" and \"English equivalent\" are very valuable.",
        "The linguistic function of metaphor is also important.",
        "Metaphor is the base of new word creation and polysemy production (sense evolution), for example, föftlf lâ jî xiâng (recycle) and MM bing dû (virus) are used in a computer setting and words like tlÄ gâo feng (peak), MM ping jïng (bottleneck) and xiàn suö (clue) are endowed with new meanings which have not been included in traditional Chinese dictionaries.",
        "Besides, metaphor creates new meanings in sentence level, for instance, in",
        "ïfoMjkAMIlM^ » di qiu shi rén lèi de mû qîn (The earth is the mother of humanity.",
        "), the word (mother) has a different meaning.",
        "So, metaphor understanding is beyond the scope of ambiguity resolution.",
        "Metaphor, linguistics, and human cognitive mechanisms are inextricably interlinked.",
        "So metaphor becomes a fort that must be conquered in NLU research.",
        "From an NLP perspective, metaphors can be summarized into the following categories as in Table 1.",
        "As for the NLP tasks of metaphor computing, we can conclude that there are three tasks to be accomplished: First, metaphor distinguish £niKlli$# from UWWM^W: häi yang zî yuan käo cha (investigation of ocean resources); Second, metaphor understanding and translation.",
        "For instance, £n WÔli$# actually means £nW«# – #^ Hw zhî shi xiàng häi yang yi yàng feng fù (Knowledge is as rich as the ocean.).",
        "Third, metaphor generation.",
        "For instance, how phrases such as fa JS>l|}$# xin xî de häi yang (ocean of information) and MfäUMffi xiân huâ de häi yang (ocean of flowers) can be generated successfully by computer?",
        "Table 1.",
        "Categories of metaphors from NLP perspective.",
        "Currently we focus on recognition and understanding of metaphors on phrase and sentence level.",
        "The automatic processing methods of metaphors can be summarized as two: First, rule (or logic)-based method, i.e., finding the conflicts between the target and the source, and search their common properties.",
        "Example 7",
        "TÈ.^AJk – ^kW'f ° zhè gè rén shi yî tou shî zi (This man is a lion)",
        " – only the target and the source",
        "I^Aëfli» nà gè rén shi läo hü li (That man is an old fox.)",
        "^#fiB3EW^fiUPîS tËW^fUMIo sen lin lï ji yöu yöng mëng de shî zi, yë yöu jiäo huâde hûli (In the forest, there are both brave lions and sly foxes.)",
        "--- find out properties of the sources",
        "Perspective of grammatical properties",
        "Perspective of language unites of metaphorical expressions",
        "Nominal",
        "fiHU^^ zû guo de huâ duö (flower of the country), ÉÈ-rp KS sheng ming de lü chéng (life journey)",
        "Word-formation level",
        "Jf|3Ç luän shi(egg-like stone), i^f'LBfl xing rén yän (apricot-like eyes)",
        "Verb",
        "'ù'M'IMW xîn chao péng pài (heart wave ), JX^iäffi fàng fei lï xiäng (let f dream fly)",
        "Word level",
        "MM châo liû (tide), zhâo yang (morning sun)",
        "Adjective",
        "aiif^iTE.",
        "zhè piân wén zhâng xië de gân bâ(This article is written drily), Sit JCMln^MlKo zhè piân wén zhâng qîng tâng guä shuï (This article is like plain soup and water.)",
        "Phrase level",
        "£niRll)$ïy^ zhî shi de häi yang (ocean of knowledge), S # # ?1 ll # ^ bô zhöng xing fu de zhöng zi (to sow the seeds of happiness)",
        "Adverb",
        "M^èJHÂ chûn cui hû shuô(absolute nonsense)",
        "Sentence level",
        "fi^f^fiff o qi che he qi you (Cars drink gasoline.",
        "), icAJIjK nü rén shi s huï (A woman is water.)",
        "Discourse level",
        "nmnrnji, M^miM* «t«^,",
        "^^SŒB» dä qï huang yîng ér, mo jiào zhî shàng tio ti shi jîng qiè mèng, bù dé dào liao xî „ (To scare away the nightingales for their noise has my dream in which I went to the west to meet my dear husband.)",
        "&^A&MS.ffî>M^A^k$M$}° zhè gè rén shi yöng mëng de, nà gè rén shi jiäo hua de (This man is brave, while that man is sly.)",
        "The utterance fflik^t%XXufc±%io hé bëi yöu gè läo tài tài chî tu kuài (An old lady in Hebei eats clay.)",
        "is not in conformity with common sense, but it is not a metaphor; whereas ^ÀitPë^fÉ!» nan rén dôu shi dông wù(All men are animals.)",
        "is logical but it may be a metaphor in certain context and may not be in another context.",
        "Second, empirical (statistical) method i.e., providing machine with a large number of samples and training a model.",
        "Yu Shiwen presided over the national 973 project \"Database for text content understanding\" (2004-2009), which includes a subtask named \"Analysis of Metaphorical Expressions and Their Pointed Contents in Chinese Texts\".",
        "In this project, various machine learning methods have been applied to do semantic analyses from the token level.",
        "Among them, Wang Zhimin completed her doctoral thesis \"Chinese Noun Phrase Metaphor Recognition\" in 2006.",
        "Jia Yuxiang studied verb metaphor recognition and \"X is Y\" type metaphor understanding and generation.",
        "Qu Weiguang presided over the National Natural Science Fund Project \"Research on Key Technologies in Chinese Metaphor Understanding\" (2008-2010).",
        "From a statistical point of view, metaphor recognition can be seen as a problem to compute the conditional probability p(m\\c) to decide whether Mffi is a metaphor in context c. The reversed order of two variants m and c will not change the value of unified probability of p(m\\c) and p(c\\m),while the relation between unified probability and conditional probability can be written as:",
        "then we can deem this Mffi is a metaphor.",
        "Then the problem becomes how to compute p(m)p(c | m) .",
        "We can compute it based on large-scale annotated corpus and get Nm – the times of Mffi as a metaphor in the corpus; N – the total times of Mffi in the corpus.",
        "Then we simplify Mffi and its context c into: W_k... W.x Wfr W ... W , where W_k, W.\\, Wi,..., Wi represent the n-gram of Mffi and its syntactic and semantic attributes respectively.",
        "co-occurrence of Mffi as a metaphor and word W with designated attributes at position.",
        "Here an important hypothesis of independence is: words at different position s is not correlated with the word Mffi.",
        "Last, we will discuss semantic computing on the pragmatic perspective, which is more or less unique of Chinese language.",
        "First, the change of construction in Chinese will affect the meaning of a sentence even though the words themselves are not changed.",
        "The emphasized meaning of the construction is not equal to the combination of the underlying meaning from each element in the construction.",
        "The meaning reflects the distribution of quantity of entities and the relative locations among entities.",
        "Although the underlying syntactic relationship among the main verb , the agent and the object(s) still exists, such syntactic relationship is only secondary.",
        "As in the sentence S^^nTLUBllH^Ao zhè zhâng chuang kë yï shui s ân gè rén (This bed can sleep three people.)",
        "is different in meaning from the sentence =^A^U^S^^» (Three people can sleep on this bed.).",
        "Second, the semantic direction of the complement in verb-complement constructions and the adverbial phrase in verb-adverbial constructions also change the semantic roles of each constituent.",
        "For instance, (JCM^^jüT° ( wén zhâng ) xië wan le ((The article) is xië lè i le ((The teacher) is tired for writing.)",
        "or",
        "#$t$ifel$7^$:?Ê£^o xiâng pên pên di zhà le yî pan huâ shêng mï(aromatically fried a plate of peanuts).",
        "Here the ontology cannot provide enough information to reflect the process and result of change in semantic roles.",
        "Thus the Generalized Valence Mode (GVM) is proposed to describe not only participants of the",
        "action, but also the change of participants' states.",
        "Third, our ultimate goal will be to achieve \"semantic harmony\".",
        "For instance, in both English and Chinese we can say iêi±ii5|t ba chü lai (pull out) or châ jin qù (thrust into), but we never say H!i±4i5|t (thrust out) or iêiÊi (pull into).",
        "It is alright to say W^3t awkward to say iI^i^tS^7.",
        "nà kê xiäo hé tao tâ dôu chî le (That small chestnut he eats it all.).",
        "In fact we can say",
        "it^fè7 » nà kê xiäo hé tao sông shü dôu chî le",
        "(That small chestnut the squirrel eats it all.",
        ").",
        "Figure 2.",
        "Empirical (statistical) method of metaphor processing.",
        "Professor Lu Jianming (2010) remarked on the realization of semantic harmony.",
        "The principle of semantic constraint of words essentially requires that the words in sentences should be harmonic in terms of meaning.",
        "Analys is of ill-formed sentences and automatic language generation will benefit from the research in semantic harmony.",
        "Semantic computing on the pragmatic level has unique characteristics with respect to Chinese language.",
        "The solution of these problems poses a great challenge and will make great contribution to the understanding of the essence and universality of languages.",
        "4 Potential Applications of Semantic Computing - a Case Study on Automatic Metaphor Processing in Search Engines",
        "Nowadays, search engines are developing very rapidly and some of them have won great economic success.",
        "In terms of semantic computing, Baidu.com takes the lead and has unveiled the search concept \"Box computing\" which introduces semantic analysis.",
        "The precision and recall of a search engine are always the essential issue that a user is concerned.",
        "Therefore we will find the value of semantic computing first in a search engine.",
        "Certainly, if metaphor can be understood properly by a computer, the precision of search engines will be improved.",
        "Let's take the phrase qï fêi(take off) as an example.",
        "Literally È ^ means an aircraft takes off such as in I/lSE",
        "Ê^BtlB] hang bân qï fêi shi jiân (the time for the airplane to take off).",
        "Sometimes we also use",
        "it in phrases like Iri^È;^ jîng ji qï fêi (economic take-off) or ^^M^^fëÈ^ dông fâng mëi nü gê tan qï fêi (Oriental beauties take off in the music arena.)",
        "to mean metaphorically.",
        "If the literal sense and its metaphorical sense can be distinguished successfully, we will find the exact information that we need.",
        "Meanwhile, we hope that through this the recall of search engine will also be improved.",
        "For example, in Chinese we often use the phrase läfflö^ft^fe zü guö de huâ duö (flowers of the country) metaphorically to refer to Aî ér tong (children).",
        "So web pages describing ÖHEKl^E^fe should also be related to the query word Aî.",
        "We also observe that the phrases ^SÈMJI jîn röng fêng bào (financial storm) and ^feffiîfti nJî jîn röng häi xiào(financial tsunami) metaphorically refer to ^itjfelfL jîn röng wêi jî (financial crisis).",
        "But when we input the query ^tfeft into a search engine, the results were only web pages with ^feffijjtllifl or But when we use the query i^lSM # or ^iS$Pjf, there were no web pages with the results ^Sfcftllifl.",
        "We know that the phrase ^ifcjll chäo yöu yü has literal usage (to fry squids) and metaphorical usage (to fire sb.",
        "from his/her job).",
        "When we input the phrase into the search engine, we find the result with metaphorical usage takes up 65% while other usage only accounts for 35% (Wang, 2006).",
        "Therefore we may conclude that whether metaphor is understood will seriously affect precision and recall.",
        "Another important application lies in machine translation and cross-lingual search.",
        "Correct metaphor recognition and understanding is the precondition of correct translation.",
        "Machine translation can be a framework to evaluate the performance of metaphor recognition and understanding, and also is a tool to realize cross-lingual search.",
        "For instance, a well-known Chinese female volleyball player got a nickname as ffeffi^ tië lang tou.",
        "Shall we translate it literally as \"iron hammer\" or more metaphorically as \"iron fist\" in order to let a user of search engine have a better sense of what it actually means?",
        "Translation is culture-bound.",
        "When we see the sentence i^NâJ^ë^lijogâi diàn yïng shi jî lèi, how should we translate the word (a chicken's rib) here?",
        "And how shall we distinguish its literal meaning with its metaphorical meaning (II^^G^fc^i^flfo shi zhî wü wèi qi zhî kë xî, tasteless to eat but a waste to cast away) in order to understand better the sentence \"The movie is a chicken's rib\"?",
        "Therefore when we investigate the feasibility analysis of applications of automatic metaphor recognition, we propose there are still three solutions to the above-mentioned problems:",
        "• To overcome the limitedness of source domain words",
        "• To recognize metaphors in web pages and build metaphor indexes.",
        "Offline processing often makes good use of the advantages of a search engine.",
        "• Before realizing query understanding, let users choose metaphorical or literal meaning of the query through human-computer interaction.",
        "5 Language Knowledge Bases as the Foundation of Semantic Computing",
        "As the foundation of semantic computing, language knowledge bases are in great demand.",
        "The achievements on language knowledge bases for Chinese-centered multilingual information processing include: Chinese LDC, Comprehensive Language Knowledge Base (CLKB) by ICL at Peking University, HowNet by Zhendong Dong, Chinese Dependency Tree Bank by Harbin Institute of Technology, etc.",
        "Language knowledge base is an indispensable component for NLP system, and its quality and scale determines the failure or success of the system to a great extent.",
        "For the past two decades, a number of important language knowledge bases have been built through the effort of people in Institute of Computational Linguistics (ICL) at Peking University.",
        "Among them, the Grammatical Knowledge Base of Contemporary Chinese (GKB) (Yu et al., 2000) is the most influential.",
        "Based on GKB, various research projects have been initiated.",
        "For instance, a project on the quantitative analysis of \"numeral-noun\" construction of Chinese was conducted by Wang (2009) to further analyze the attributes of Chinese words.",
        "A project aiming at the emotion prediction of entries in CIKB was completed by Wang (2010) to further understand how the compositional elements of a fossilized construct like an idiom function from the token level.",
        "Offset I Synset | Csyncet | Hypernym | Hyponym | Definition | Cdefinition teacher instructor a person whose occupation is teaching a married a woman's partner in marriage",
        "Following GKB, language knowledge bases of large scale, high quality and various type (words and texts, syntactic and semantics, multi-lingual) have been built, such as the Chinese Semantic Dictionary (CSD) for Chinese-English machine translation, the Chinese Concept Dictionary (CCD) for cross-language text processing, the multilevel Annotated Corpus of Contemporary Chinese, etc.",
        "The projects as a whole won the Science and Technology Progress Award issued by Ministry of Education of China in 2007.",
        "As mentioned in Section 3, the word (virus) has two senses in both English and Chinese: one is in biology and the other is in computer science.",
        "When we want to do cross-lingual information retrieval, the two senses need to be distinguished.",
        "Hence, CCD can serve as a useful tool to complete the task for it organizes semantic knowledge from a different angle.",
        "Concepts in CCD are represented by Synsets, i.e. sets of synonyms as in Table 2.",
        "For instance, the concept ISM is in",
        "husband",
        "hubby",
        "married_",
        "*S",
        "man",
        "SA",
        "Offset",
        "Synset",
        "Csyncet",
        "Hypernym",
        "Hyponym",
        "Definition",
        "Cdefinition",
        "07414666",
        "Mister",
        "07391044",
        "a form of",
        "Mr.",
        "»«",
        "address for",
        "a man",
        "a73E ...} and all the concepts form",
        "a network to associate the various semantic relations between or among the concepts: hypernym-hyponym, part-whole, antonym, cause and entailment, by which we can retrieve information in either an extensive or a contractive way so as to improve the precision or recall of a search engine.",
        "It can also provide support for WSD tasks.",
        "In 2009, the various knowledge bases built by ICL were integrated into the CLKB.",
        "The integration of heterogeneous knowledge bases is realized by a resolution of \"a pivot of word sense\".",
        "Three basic and important knowledge bases, GKB, CSD and CCD have been integrated into a unified system which includes language processing module, knowledge retrieval module and knowledge exploration module.",
        "Although there are some fundamental resources on semantic computing, it needs further improvement, updating, integration and specification to form a collective platform to perform more complicated NLP tasks.",
        "To further improve the result of semantic computing, innovative projects for new tasks should also be launched, for instance:",
        "• metaphor knowledge base",
        "• ultra-ontology dynamic knowledge base (generalized valence mode)",
        "• the integration of information based on multilingual translation"
      ]
    },
    {
      "heading": "6. Concluding Remarks",
      "text": [
        "Why semantics is so useful in the first place?",
        "Linguists and psychologists are interested in the study of word senses to shed light on important aspects of human communication, such as concept formation and language use.",
        "Lexicographers need computational aids to analyze in a more compact and extensive way word definitions in dictionaries.",
        "Computer scientists need semantics for the purpose of natural language processing and understanding.",
        "Therefore, the significance of semantic computing in NLP is obvious and more research needs to be done with this respect.",
        "All in all, we may conclude that the methods of semantic computing can be summarized as the following:",
        "• The research of applicable language model",
        "• The research of effective algorithms",
        "• To build language knowledge bases as its foundation",
        "Semantic computing is a long-term research subject.",
        "We hope more progress can be made if a clearer view can be provided for the direction of its development and the pavement for future research can be constructed more solidly with more work done.",
        "Ackno wle dge me nts",
        "Our work is based on the long-term accumulation of the language resources that have been built by the colleagues of ICL and it is their contributions that make our achievement possible today.",
        "Parts of the content in this paper were presented by Shiwen Yu on the conferences in Hangzhou (International Workshop on Connected Multimedia 2009) and Suzhou (the 11th Chinese Lexical Semantics Workshop 2010), and many thanks should be given to those who offered valuable thoughts and advice.",
        "The authors also want to extend their gratitude toward CIPS-Sighan for this valuable opportunity to demonstrate our viewpoints and work."
      ]
    }
  ]
}
