{
  "info": {
    "authors": [
      "Yufan Guo",
      "Anna Korhonen",
      "Maria Liakata",
      "Ilona Silins",
      "Lin Sun",
      "Ulla Stenius"
    ],
    "book": "Proceedings of the 2010 Workshop on Biomedical Natural Language Processing",
    "id": "acl-W10-1913",
    "title": "Identifying the Information Structure of Scientific Abstracts: An Investigation of Three Different Schemes",
    "url": "https://aclweb.org/anthology/W10-1913",
    "year": 2010
  },
  "references": [
    "acl-D09-1067",
    "acl-D09-1155",
    "acl-I08-1050",
    "acl-J02-4002",
    "acl-P07-2009",
    "acl-W06-3309",
    "acl-W09-3603"
  ],
  "sections": [
    {
      "text": [
        "Yufan Guo Anna Korhonen Maria Liakata",
        "Ilona Silins Lin Sun Ulla Stenius",
        "Karolinska Institutet, Sweden University of Cambridge, uk Karolinska Institutet, Sweden Ilona.Silins@ki.se ls418@cam.ac.uk Ulla.Stenius@ki.se",
        "Many practical tasks require accessing specific types of information in scientific literature; e.g. information about the objective, methods, results or conclusions of the study in question.",
        "Several schemes have been developed to characterize such information in full journal papers.",
        "Yet many tasks focus on abstracts instead.",
        "We take three schemes of different type and granularity (those based on section names, argumentative zones and conceptual structure of documents) and investigate their applicability to biomedical abstracts.",
        "We show that even for the finest-grained of these schemes, the majority of categories appear in abstracts and can be identified relatively reliably using machine learning.",
        "We discuss the impact of our results and the need for subsequent task-based evaluation of the schemes."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Scientific abstracts tend to be very similar in terms of their information structure.",
        "For example, many abstracts provide some background information before defining the precise objective of the study, and the conclusions are typically preceded by the description of the results obtained.",
        "Many readers of scientific abstracts are interested in specific types of information only, e.g. the general background of the study, the methods used in the study, or the results obtained.",
        "Accordingly, many text mining tasks focus on the extraction of information from certain parts of abstracts only.",
        "Therefore classification of abstracts (or full articles) according to the categories of information structure can support both the manual study of scientific literature as well as its automatic analysis, e.g. information extraction, summarization and information retrieval (Teufel and",
        "Moens, 2002; Mizuta et al., 2005; Tbahriti et al., 2006; Ruch et al., 2007).",
        "To date, a number of different schemes and techniques have been proposed for sentence-based classification of scientific literature according to information structure, e.g. (Teufel and Moens, rohata et al., 2008; Teufel et al., 2009; Shatkay et al., 2008; Liakata et al., 2010).",
        "Some of the schemes are coarse-grained and merely classify sentences according to typical section names seen in scientific documents (Lin et al., 2006; Hirohata et al., 2008).",
        "Others are finer-grained and based e.g. on argumentative zones (Teufel and Moens, qualitative dimensions (Shatkay et al., 2008) or conceptual structure (Liakata et al., 2010) of documents.",
        "The majority of such schemes have been developed for full scientific journal articles which are richer in information and also considered to be more in need of the definition of information structure (Lin, 2009).",
        "However, many practical tasks currently focus on abstracts.",
        "As a distilled summary of key information in full articles, abstracts may exhibit an entirely different distribution of scheme categories than full articles.",
        "For tasks involving abstracts, it would be useful to know which schemes are applicable to abstracts and which can be automatically identified in them with reasonable accuracy.",
        "In this paper, we will compare the applicability of three different schemes - those based on section names, argumentative zones and conceptual structure of documents - to a collection of biomedical abstracts used for cancer risk assessment (CRA).",
        "CRA is an example of a real-world task which could greatly benefit from knowledge about the information structure of abstracts since cancer risk assessors look for a variety of information in them ranging from specific methods to results concerning different chemicals (Korhonen et al., 2009).",
        "We report work on the annotation of CRA abstracts according to each scheme and investigate the schemes in terms of their distribution, mutual overlap, and the success of identifying them automatically using machine learning.",
        "Our investigation provides an initial idea of the practical usefulness of the schemes for tasks involving abstracts.",
        "We discuss the impact of our results and the further task-based evaluation which we intend to conduct in the context of CRA."
      ]
    },
    {
      "heading": "2. The three schemes",
      "text": [
        "We investigate three different schemes - those based on Section Names (S1), Argumentative Zones (S2) and Core Scientific Concepts (S3): S1: The first scheme differs from the others in the sense that it is actually designed for abstracts.",
        "It is based on section names found in some scientific abstracts.",
        "We use the 4-way classification from (Hirohata et al., 2008) where abstracts are divided into objective, method, results and conclusions.",
        "Table 1 provides a short description of each category for this and other schemes (see also this table for any category abbreviations used in this paper).",
        "S2: The second scheme is based on Argumentative Zoning (AZ) of documents.",
        "The idea of AZ is to follow the knowledge claims made by authors.",
        "Teufel and Moens (2002) introduced AZ and applied it to computational linguistics papers.",
        "Mizuta et al.",
        "(2005) modified the scheme for biology papers.",
        "More recently, Teufel et al.",
        "(2009) introduced a refined version of AZ and applied it to chemistry papers.",
        "As these schemes are too finegrained for abstracts (some of the categories do not appear in abstracts at all), we adopt a reduced version of AZ which integrates seven categories from (Teufel and Moens, 2002) and (Mizuta et al., 2005) - those which actually appear in abstracts.",
        "S3: The third scheme is concept-driven and ontology-motivated (Liakata et al., 2010).",
        "It treats scientific papers as humanly-readable representations of scientific investigations and seeks to retrieve the structure of the investigation from the paper as generic high-level Core Scientific Concepts (CoreSC).",
        "The CoreSC is a 3-layer annotation scheme but we only consider the first layer in the current work.",
        "The second layer pertains to properties of the categories (e.g. \"advantage\" vs. \"disadvantage\" of meth, \"new\" vs. \"old\" meth or objt).",
        "Such level of granularity is rare in abstracts.",
        "The 3rd layer involves coreference identification between the same instances of each category, which is also not of concern in abstracts.",
        "With eleven categories, S3 is the most fine-grained of our schemes.",
        "CoreSC has been previously applied to chemistry papers (Liakata et al., 2010, 2009)."
      ]
    },
    {
      "heading": "3. Data: cancer risk assessment abstracts",
      "text": [
        "We used as our data the corpus of CRA abstracts described in (Korhonen et al., 2009) which contains MedLine abstracts from different subdomains of biomedicine.",
        "The abstracts were selected so that they provide rich information about various scientific data (human, animal and cellular) used for CRA.",
        "We selected 1000 abstracts (in random) from this corpus.",
        "The resulting data includes 7,985 sentences and 225,785 words in total."
      ]
    },
    {
      "heading": "4. Annotation of abstracts",
      "text": [
        "Annotation guidelines.",
        "We used the guidelines of Liakata for S3 (Liakata and Soldatova, 2008), and developed the guidelines for S1 and S2 (15 pages each).",
        "The guidelines define the unit (a sentence) and the categories of annotation and provide advice for conflict resolution (e.g. which categories to prefer when two or several are possible within the same sentence), as well as examples of annotated abstracts.",
        "Annotation tool.",
        "We modified the annotation tool of Korhonen et al.",
        "(2009) so that it could be used to annotate abstracts according to the schemes.",
        "This tool was originally developed for the annotation of CRA abstracts according to the scientific evidence they contain.",
        "The tool works as a Firefox plug-in.",
        "Figure 1 shows an example of an abstract annotated according to the three schemes.",
        "Description of annotation.",
        "Using the guidelines and the tool, the CRA corpus was annotated according to each of the schemes.",
        "The annotation proceeded scheme by scheme, independently, so that annotations of one scheme were not based on any of the other two.",
        "One annotator (a computational linguist) annotated all the abstracts according to the three schemes, starting from the coarsegrained S1, then proceeding to S2 and finally to the finest-grained S3.",
        "It took 45, 50 and 90 hours in total for S1, S2 and S3, respectively.",
        "The resulting corpus.",
        "Table 2 shows the distribution of sentences per scheme category in the resulting corpus.",
        "The background and the aim of the research The way to achieve the goal The principle findings",
        "Analysis, discussion and the main conclusions",
        "The circumstances pertaining to the current work, situation, or its causes, history, etc.",
        "A thing aimed at or sought, a target or goal",
        "A way of doing research, esp.",
        "according to a defined and regular plan; a special form of procedure or characteristic set of procedures employed in a field of study as a mode of investigation and inquiry",
        "The effect, consequence, issue or outcome of an experiment; the quantity, formula, etc.",
        "obtained by calculation",
        "A judgment or statement arrived at by any reasoning process; an inference, deduction, induction; a proposition deduced by reasoning from other propositions; the result of a discussion, or examination of a question, final determination, decision, resolution, final arrangement or agreement",
        "A comparison between the current work and the related work The work that needs to be done in the future",
        "A statement that has not been yet confirmed rather than a factual statement The reason for carrying out the investigation",
        "Description of generally accepted background knowledge and previous work The target state of the investigation where intended discoveries are made An entity which is a product or main theme of the investigation Experiment details",
        "A statement about a theoretical model or framework",
        "The means by which the authors seek to achieve a goal of the investigation",
        "The data/phenomena recorded within an investigation",
        "Factual statements about the outputs of an investigation",
        "Statements inferred from observations and results, relating to research hypothesis",
        "Inter-annotator agreement.",
        "We measured the inter-annotator agreement on 300 abstracts (i.e. a third of the corpus) using three annotators (one linguist, one expert in CRA, and the computational linguist who annotated all the corpus).",
        "According to Cohen's Kappa (Cohen, 1960), the inter-annotator agreement for S1, S2, and S3 was k = 0.84, k = 0.85, and k = 0.50, respectively.",
        "According to (Landis and Koch, 1977), the agreement 0.81-1.00 is perfect and 0.41-0.60 is moderate.",
        "Our results indicate that S1 and S2 are the easiest schemes for the annotators and S3 the most challenging.",
        "This is not surprising as S3 is the scheme with the finest granularity.",
        "Its reliable identification may require a longer period of training and possibly improved guidelines.",
        "Moreover, previous annotation efforts using S3 have used domain experts for annotation (Liakata et al., 2009, 2010).",
        "In our case the domain expert and the linguist agreed the most on S3 (k = 0.60).",
        "For S1 and S2 the best agreement was between the linguist and the computational linguist (k = 0.87 and k = 0.88, respectively)."
      ]
    },
    {
      "heading": "5. Comparison of the schemes in terms of annotations",
      "text": [
        "The three schemes we have used to annotate abstracts were developed independently and have separate guidelines.",
        "Thus, even though they seem to have some categories in common (e.g. meth, RES, CON) this does not necessarily guarantee that the latter cover the same information across all three schemes.",
        "We therefore wanted to investigate the relation between the schemes and the extent of overlap or complementarity between them.",
        "We used the annotations obtained with each scheme to create three contingency matrices for pairwise comparison.",
        "We calculated the chi-squared Pearson statistic, the chi-squared like-",
        "S1 Objective",
        "OBJ",
        "Method",
        "METH",
        "Result",
        "RES",
        "Conclusion",
        "CON",
        "S2 Background",
        "BKG",
        "Objective",
        "OBJ",
        "Method",
        "METH",
        "Result",
        "RES",
        "Conclusion",
        "CON",
        "Related work",
        "REL",
        "Future work",
        "FUT",
        "S3 Hypothesis",
        "HYP",
        "Motivation",
        "MOT",
        "Background",
        "BKG",
        "Goal",
        "GOAL",
        "Object",
        "OBJT",
        "Experiment",
        "EXP",
        "Model",
        "MOD",
        "Method",
        "METH",
        "Observation",
        "OBS",
        "Result",
        "RES",
        "Conclusion",
        "CON",
        "■lästere 0111 eric tonus of N\"-(2,?,--irfiydro:iybutyl)pianine (TH3C) were identified in the livers of tÛ diastereomers [(+.■'-)-THBG] was formed by reaction of DNA with (+.■''-)-BDG2, and the other o-THEG) was formed by reaction of DNA with meso-BD02.",
        "There was significantly more (+/->-THBG and meso-THBG in die liver DNA of die mice \".\".",
        "hen compared v.itli diose of the rat; during the 10 da\".",
        "\"; of e:;po;ure to BD and the 6 days of postexposure that were monitored There was a 2-fold excess of (- -J-TH30 over mesi t liver at all the"
      ]
    },
    {
      "heading": "2. have been e:",
      "text": []
    },
    {
      "heading": "1. -BD02 and the DHEB that is",
      "text": [
        "1,3-butadiene (BD).",
        "J™ ^t^omeric forms of N\"\"-(2,?,--iriliydro:o.-but;.",
        "\"l)gtiaiiiiie (TH3G) were identified in the livers of rh mice andrats.",
        "One u^T'u^lireomers [(+ -)-THBG] was formed by reaction of DNA with (+ -)-BD02, and the other tt (meso-THBG) was formed by reaction of DNA with meso-BD02.",
        "lihood ratio, the contingency coefficient and Cramer's V (Table 3), all of which showed a definite correlation between rows and columns for the pairwise comparison of all three schemes.",
        "However, none of the above measures give an indication of the differential association between schemes, i.e. whether it goes both directions and to what extent.",
        "For this reason we calculated the Goodman-Kruskal lambda L statistic (Siegel and Castellan, 1988), which gives us the reduction in error for predicting the categories of one annotation scheme, if we know the categories assigned according to the other.",
        "When using the categories of S1 as the independent variables, we obtained a lambda of over 0.72 which suggests a 72% reduction in error in predicting S2 categories and 47% in predicting S3 categories.",
        "With S2 categories being the independent variables, we obtained a reduction in error of 88% when predicting S1 and 55% when predicting S3 categories.",
        "The lower lambdas for predicting S3 are hardly surprising as S3 has 11 categories as opposed to 4 and 7 for S1 and S2 respectively.",
        "S3 on the other hand has strong predictive power in predicting the categories of S1 and 52 with lambdas of 0.86 and 0.84 respectively.",
        "In terms of association, S1 and S2 seem to be more strongly associated, followed by S1 and S3 and then S2 and S3.",
        "We were then interested in the correspondence between the actual categories of the three schemes, which is visualized in Figure 2.",
        "Looking at the categories of S1, obj maps mostly to bkg and obj in S2 (with a small percentage in meth and rel).",
        "S1 obj maps to bkg, goal, hyp, mot and objt in S3 (with a small percentage in meth and mod).",
        "S1 meth maps to meth in S2 (with a small percentage in S2 obj) while it maps to exp, meth and mod in S3 (with a small percentage in goal and objt).",
        "S1 res covers S2 res and 40% rel, whereas in S3 it covers res, obs and 20% mod.",
        "S1 con covers S2 con, fut, 45% rel and a small percentage of res.",
        "In terms of the S2 vs S3 comparison, S2 bkg maps to S3 bkg, hyp, mot and a small percentage of objt and mod.",
        "S2 con maps to S3 con, with a small percentage in res, obs and hyp.",
        "S2 fut maps entirely to S3 con.",
        "S2 meth maps to S3 meth, exp, mod, 20% objt and a small percentage of goal.",
        "S2 obj maps to S3 goal and objt, with 15% hyp, mod and mot and a small percentage in meth.",
        "S2 rel spans across S3 con, res, mot and objt, albeit in very small percentages.",
        "Finally, S2 res maps to 53 res and obs, with 25% in mod and small percentages in meth, con, objt.",
        "Thus, it appears that each category in S1 maps to a couple of categories in S2 and several in S3, which in turn seem to elaborate on the S2 categories.",
        "Based on the above analysis of the categories, it is reasonable to assume a subsumption relation between the categories of the type S1 > S2 > S3, with rel cutting across several of the S3 categories and fut branching off S3 con.",
        "This is an interesting and exciting outcome given that the three different schemes have such a different origin.",
        "Figure 2: Pairwise interpretation of categories of one scheme in terms of the categories of the other."
      ]
    },
    {
      "heading": "6. Automatic identification of information structure",
      "text": [
        "The first step in automatic identification of information structure is feature extraction.",
        "We chose a number of general purpose features suitable for all the three schemes.",
        "With the exception of our novel verb class feature, the features are similar to those employed in related works, e.g. (Teufel and Moens, 2002; Mullen et al., 2005; Hirohata et al., History.",
        "There are typical patterns in the information structure, e.g. RES tends to be followed by CON rather than by BKG.",
        "Therefore, we used the category assigned to the previous sentence as a feature.",
        "Location.",
        "Categories tend to appear in typical positions in a document, e.g. BKG occurs often in the beginning and CON at the end of the abstract.",
        "We divided each abstract into ten equal parts (1-10), measured by the number of words, and defined the location (of a sentence) feature by the parts where the sentence begins and ends.",
        "Word.",
        "Like many text classification tasks, we employed all the words in the corpus as features.",
        "Bi-gram.",
        "We considered each bi-gram (combination of two word features) as a feature.",
        "Verb.",
        "Verbs are central to the meaning of sentences, and can vary from one category to another.",
        "For example, experiment is frequent in meth and conclude in con.",
        "Previous works have used the matrix verb of each sentence as a feature.",
        "Because the matrix verb is not the only meaningful verb, we used all the verbs instead.",
        "Verb Class.",
        "Because individual verbs can result in sparse data problems, we also experimented with a novel feature: verb class (e.g. the class of experiment verbs for verbs such as measure and inject).",
        "We obtained 60 classes by clustering verbs appearing in full cancer risk assessment articles using the approach of Sun and Korhonen (2009).",
        "POS.",
        "Tense tends to vary from one category to another, e.g. past is common in RES and past participle in con.",
        "We used the part-of-speech (POS) tag of each verb assigned by the C&C tagger (Curran et al., 2007) as a feature.",
        "S1 vs S2",
        "S1 vs S3",
        "S2 vs S3",
        "X",
        "df",
        "P",
        "X",
        "df",
        "P",
        "X",
        "df",
        "P",
        "Likelihood Ratio Pearson",
        "5577.1 6613.0",
        "18",
        "18",
        "0 0",
        "5363.6",
        "6371.0",
        "30",
        "30",
        "0",
        "0",
        "6293.4",
        "8554.7",
        "60",
        "60",
        "0",
        "0",
        "Contingency Coeff Cramer's V",
        "0.842 0.901",
        "0.837 0.885",
        "0.871 0.725",
        "GR.",
        "Structural information about heads and dependents has proved useful in text classification.",
        "We used grammatical relations (GRs) returned by the C&C parser as features.",
        "They consist of a named relation, a head and a dependent, and possibly extra parameters depending on the relation involved, e.g. (dobj investigate mouse).",
        "We created features for each subject (ncsubj), direct object (dobj), indirect object (iobj) and second object (obj2) relation in the corpus.",
        "Subj and Obj.",
        "As some GR features may suffer from data sparsity, we collected all the subjects and objects (appearing with any verbs) from GRs and used them as features.",
        "Voice.",
        "There may be a correspondence between the active and passive voice and categories (e.g. passive is frequent in meth).",
        "We therefore used voice as a feature.",
        "We used Naive Bayes (nb) and Support Vector Machines (svm) for classification.",
        "nb is a simple and fast method while svm has yielded high performance in many text classification tasks.",
        "nb applies Bayes' rule and Maximum Likelihood estimation with strong independence assumptions.",
        "It aims to select the class c with maximum probability given the feature set F :",
        "sv m constructs hyperplanes in a multidimensional space that separates data points of different classes.",
        "Good separation is achieved by the hyperplane that has the largest distance from the nearest data points of any class.",
        "The hyperplane has the form w • x – b = 0, where w is the normal vector to the hyperplane.",
        "We want to maximize the distance from the hyperplane to the data points, or the distance between two parallel hyperplanes each of which separates the data.",
        "The parallel hyperplanes can be written as:",
        "w •x – b = 1 and w •x – b = – 1, and the distance between the two is r^y.",
        "The problem reduces to:",
        "Minimize |w|",
        "Subject to w • Xi – b > 1 for xi of one class, and w • xi – b < – 1 for xi of the other."
      ]
    },
    {
      "heading": "7. Experimental evaluation",
      "text": [
        "We developed a tokenizer to detect the boundaries of sentences and to perform basic tokenisa-tion, such as separating punctuation from adjacent words e.g. in tricky biomedical terms such as 2-amino-3,8-diethylimidazo[4,5-f]quinoxaline.",
        "We used the C&C tools (Curran et al., 2007) for POS tagging, lemmatization and parsing.",
        "The lemma output was used for extracting Word, Bi-gram and Verb features.",
        "The parser produced GRs for each sentence from which we extracted the GR, Subj, Obj and Voice features.",
        "We only considered the GRs relating to verbs.",
        "The \"obj\" marker in a subject relation indicates a verb in passive voice (e.g. (ncsubj observedJ4 differenced obj)).",
        "To control the number of features we removed the words and GRs with fewer than 2 occurrences and bi-grams with fewer than 5 occurrences, and lemmatized the lexical items for all the features.",
        "We used Weka (Witten, 2008) for the classification, employing its nb and svm linear kernel.",
        "The results were measured in terms of accuracy (the percentage of correctly classified sentences), precision, recall, and F-Measure.",
        "We used 10-fold cross validation to avoid the possible bias introduced by relying on any one particular split of the data.",
        "The data were randomly divided into ten parts of approximately the same size.",
        "Each individual part was retained as test data and the remaining nine parts were used as training data.",
        "The process was repeated ten times with each part used once as the test data.",
        "The resulting ten estimates were then combined to give a final score.",
        "We compare our classifiers against a baseline method based on random sampling of category labels from training data and their assignment to sentences on the basis of their observed distribution.",
        "Table 4 shows F-measure results when using each individual feature alone, and Table 5 when using all the features but the individual feature in question.",
        "In these two tables, we only report the results for svm which performed considerably better than nb.",
        "Although we have results for most scheme categories, the results for some are missing due to the lack of sufficient training data (see Table 2), or due to a small feature set (e.g. History alone).",
        "a-k: History, Location, Word, Bi-gram, Verb, Verb Class, POS, GR, Subj, Obj, Voice",
        "Looking at individual features alone, Word, Bi-gram and Verb perform the best for all the schemes, and History and Voice perform the worst.",
        "In fact History performs very well on the training data, but for the test data we can only use estimates rather than the actual labels.",
        "The Voice feature works only for res and meth for S1 and S2, and for obs for S3.",
        "This feature is probably only meaningful for some of the categories.",
        "When using all but one of the features, S1 and S2 suffer the most from the absence of Location, while S3 from the absence of Word/POS.",
        "Verb Class on its own performs worse than Verb, however when combined with other features it performs better: leave-Verb-out outperforms leave-Verb Class-out.",
        "After comparing the various combinations of features, we found that the best selection of features was all but the Verb for all the schemes.",
        "Table 6 shows the results for the baseline (bl), and the best results for nb and svm.",
        "nb and svm perform clearly better than bl for all the schemes.",
        "The results for svm are the best.",
        "nb yields the highest performance with S1.",
        "Being sensitive to sparse data, it does not perform equally well on S2 and S3 which have a higher number of categories, some of which are low in frequency (see Table 2).",
        "For S1, svm finds all the four scheme categories with the accuracy of 89%.",
        "F-measure is 90 for obj, res and con and 81 for meth.",
        "For S2, the classifier finds six of the seven categories, with the accuracy of 90% and the average F-measure of",
        "A-K: History, Location, Word, Bi-gram, Verb, Verb Class, POS, GR, Subj, Obj, Voice",
        "We have 1.0 for fut in S2 probably because the size of the training data is just right, and the model doesn't overfit the data.",
        "We make this assumption because we have 1.0 for almost all the categories in the training data, but only for fut on the test data.",
        "91 for the six categories.",
        "As with S2, meth has the lowest performance (at 85 F-measure).",
        "The one missing category (rel) appears in our abstract data with very low frequency (see Table 2).",
        "For S3, svm uncovers as many as nine of the 11 categories with accuracy of 81%.",
        "Six categories perform well, with F-measure higher than 80. exp, bkg and goal have F-measure of 70, 62 and 62, respectively.",
        "Like the missing categories hyp and mod, goal is very low in frequency.",
        "The lower performance of the higher frequency exp and bkg is probably due to low precision in distinguishing between exp and meth, and bkg and other categories, respectively.",
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "k",
        "S1",
        "obj",
        "~39\"",
        ".83",
        ".71",
        ".69",
        ".52",
        ".45",
        ".45",
        ".45",
        ".54",
        ".39",
        "-",
        "meth",
        "-",
        ".47",
        ".81",
        ".74",
        ".63",
        ".49",
        "-",
        ".46",
        ".03",
        ".42",
        ".51",
        "res",
        "-",
        ".76",
        ".85",
        ".86",
        ".76",
        ".70",
        ".72",
        ".69",
        ".70",
        ".68",
        ".54",
        "con",
        "-",
        ".72",
        ".70",
        ".65",
        ".63",
        ".53",
        ".49",
        ".57",
        ".68",
        ".20",
        "-",
        " – S2~",
        "bkg",
        ".26",
        ".73",
        ".69",
        ".67",
        ".45",
        ".38",
        ".56",
        ".33",
        ".33",
        ".29",
        "-",
        "obj",
        "-",
        ".13",
        ".72",
        ".68",
        ".54",
        ".63",
        "-",
        ".49",
        ".48",
        ".20",
        "-",
        "meth",
        "-",
        ".50",
        ".81",
        ".72",
        ".64",
        ".47",
        "-",
        ".47",
        ".03",
        ".42",
        ".51",
        "res",
        "-",
        ".76",
        ".85",
        ".87",
        ".76",
        ".72",
        ".72",
        ".70",
        ".69",
        ".68",
        ".54",
        "con",
        "-",
        ".70",
        ".73",
        ".71",
        ".62",
        ".51",
        ".40",
        ".61",
        ".67",
        ".23",
        "-",
        "rel",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "fut",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "\"ST",
        "hyp",
        "-",
        "-",
        "-",
        "-",
        ".67",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "mot",
        ".18",
        ".57",
        ".70",
        ".49",
        ".39",
        ".13",
        ".36",
        ".33",
        ".30",
        ".40",
        "-",
        "bkg",
        "-",
        "-",
        ".54",
        ".40",
        ".21",
        "-",
        "-",
        ".11",
        ".06",
        ".06",
        "-",
        "goal",
        "-",
        "-",
        ".53",
        ".33",
        ".22",
        "-",
        ".19",
        ".31",
        "-",
        ".25",
        "-",
        "objt",
        "-",
        "-",
        ".73",
        ".63",
        ".60",
        ".10",
        "-",
        ".26",
        ".32",
        "-",
        "-",
        "exp",
        "-",
        ".22",
        ".63",
        ".46",
        ".33",
        ".30",
        "-",
        ".31",
        ".07",
        ".44",
        ".25",
        "mod",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "meth",
        "-",
        "-",
        ".82",
        ".61",
        ".39",
        ".39",
        "-",
        ".50",
        "-",
        ".37",
        "-",
        "obs",
        "-",
        ".59",
        ".75",
        ".71",
        ".63",
        ".56",
        ".56",
        ".54",
        ".48",
        ".52",
        ".47",
        "res",
        "-",
        "-",
        ".87",
        ".73",
        ".41",
        ".34",
        "-",
        ".38",
        ".24",
        ".35",
        "-",
        "con",
        "-",
        ".74",
        ".68",
        ".65",
        ".65",
        ".50",
        ".48",
        ".49",
        ".55",
        ".21",
        "-",
        "all",
        "A",
        "B",
        "C",
        "D",
        "E",
        "F",
        "G",
        "H",
        "I",
        "J",
        "K",
        "S1",
        "obj",
        ".90",
        ".89",
        ".87",
        ".92",
        ".90",
        ".90",
        ".91",
        ".91",
        ".91",
        ".92",
        ".91",
        ".88",
        "meth",
        ".80",
        ".81",
        ".80",
        ".80",
        ".79",
        ".81",
        ".79",
        ".80",
        ".80",
        ".80",
        ".81",
        ".81",
        "res",
        ".88",
        ".90",
        ".88",
        ".90",
        ".88",
        ".90",
        ".88",
        ".88",
        ".88",
        ".89",
        ".89",
        ".90",
        "con",
        ".86",
        ".85",
        ".82",
        ".87",
        ".88",
        ".90",
        ".90",
        ".88",
        ".89",
        ".88",
        ".88",
        ".90",
        "S2",
        "bkg",
        ".91",
        ".94",
        ".90",
        ".90",
        ".93",
        ".94",
        ".94",
        ".91",
        ".93",
        ".94",
        ".92",
        ".94",
        "obj",
        ".72",
        ".78",
        ".84",
        ".78",
        ".83",
        ".88",
        ".84",
        ".81",
        ".83",
        ".84",
        ".78",
        ".83",
        "meth",
        ".81",
        ".83",
        ".80",
        ".81",
        ".80",
        ".85",
        ".80",
        ".78",
        ".81",
        ".81",
        ".82",
        ".83",
        "res",
        ".88",
        ".90",
        ".88",
        ".89",
        ".88",
        ".91",
        ".89",
        ".89",
        ".90",
        ".90",
        ".90",
        ".89",
        "con",
        ".84",
        ".83",
        ".77",
        ".83",
        ".86",
        ".88",
        ".86",
        ".87",
        ".88",
        ".89",
        ".88",
        ".81",
        "rel",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "fut",
        "-",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "1.0",
        "\"ST",
        "hyp",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "mot",
        ".82",
        ".84",
        ".80",
        ".76",
        ".82",
        ".82",
        ".83",
        ".78",
        ".83",
        ".83",
        ".83",
        ".83",
        "bkg",
        ".59",
        ".60",
        ".60",
        ".54",
        ".67",
        ".62",
        ".62",
        ".59",
        ".61",
        ".61",
        ".62",
        ".61",
        "goal",
        ".62",
        ".67",
        ".67",
        ".62",
        ".71",
        ".62",
        ".67",
        ".43",
        ".67",
        ".67",
        ".67",
        ".62",
        "objt",
        ".88",
        ".85",
        ".83",
        ".74",
        ".83",
        ".85",
        ".83",
        ".74",
        ".83",
        ".83",
        ".83",
        ".85",
        "exp",
        ".72",
        ".68",
        ".72",
        ".53",
        ".65",
        ".70",
        ".72",
        ".73",
        ".74",
        ".74",
        ".72",
        ".68",
        "mod",
        "-",
        "meth",
        ".87",
        ".86",
        ".87",
        ".66",
        ".85",
        ".89",
        ".87",
        ".88",
        ".86",
        ".86",
        ".87",
        ".86",
        "obs",
        ".82",
        ".81",
        ".84",
        ".72",
        ".80",
        ".82",
        ".81",
        ".80",
        ".82",
        ".82",
        ".81",
        ".81",
        "res",
        ".87",
        ".87",
        ".88",
        ".74",
        ".87",
        ".86",
        ".87",
        ".86",
        ".87",
        ".87",
        ".87",
        ".88",
        "con",
        ".88",
        ".88",
        ".82",
        ".88",
        ".83",
        ".87",
        ".87",
        ".84",
        ".87",
        ".88",
        ".87",
        ".86",
        "Acc.",
        "F-Measure",
        "S1",
        "obj meth res",
        "con",
        "bl",
        ".29",
        ".23 .23 .39",
        ".18",
        "nb",
        ".82",
        ".85 .75 .85",
        ".71",
        "svm",
        ".89",
        ".90 .81 .90",
        ".90",
        "Acc.",
        "F-Measure",
        "S2",
        "bkg obj meth",
        "res",
        "con rel fut",
        "bl",
        ".25",
        ".13 .08 .22",
        ".40",
        ".13 -",
        "-",
        "nb",
        ".76",
        ".79 .25 .70",
        ".83",
        ".66 -",
        "-",
        "svm",
        ".90",
        ".94 .88 .85",
        ".91",
        ".88 -",
        "1.0",
        "Acc.",
        "F-Measure",
        "S3",
        "hyp mot bkg goal",
        "objt",
        "exp modmeth",
        "obs",
        "res",
        "con",
        "bl",
        ".15",
        "- .10 .06 .04",
        ".06",
        ".11 - .13",
        ".24",
        ".15",
        ".17",
        "nb",
        ".53",
        "- .56 - -",
        "-",
        ".30 - .32",
        ".61",
        ".59",
        ".62",
        "svm",
        ".81",
        "- .82 .62 .62",
        ".85",
        ".70 - .89",
        ".82",
        ".86",
        ".87"
      ]
    },
    {
      "heading": "8. Discussion and conclusions",
      "text": [
        "The results from our corpus annotation (see Table 2) show that for the coarse-grained S1, all the four categories appear frequently in biomedical abstracts (this is not surprising because S1 was actually designed for abstracts).",
        "All of them can be identified using machine learning.",
        "For S2 and S3, the majority of categories appear in abstracts with high enough frequency that we can conclude that also these two schemes are applicable to abstracts.",
        "For S2 we identified six categories using machine learning, and for S3 as many as nine, indicating that automatic identification of the schemes in abstracts is realistic.",
        "Our analysis in section 5 showed that there is a subsumption relation between the categories of the schemes.",
        "S2 and S3 provide finer-grained information about the information structure of abstracts than S1, even with their 2-3 low frequency (or missing) categories.",
        "They can be useful for practical tasks requiring such information.",
        "For example, considering S3, there may be tasks where one needs to distinguish between exp, mod and meth, between hyp, mot and goal, or between obs and res.",
        "Ultimately, the optimal scheme will depend on the level of detail required by the application at hand.",
        "Therefore, in the future, we plan to conduct task-based evaluation of the schemes in the context of CRA and to evaluate the usefulness of S1-S3 for tasks cancer risk assessors perform on abstracts (Korhonen et al., 2009).",
        "Now that we have annotated the CRA corpus for S1-S3 and have a machine learning approach available, we are in an excellent position to conduct this evaluation.",
        "A key question for real-world tasks is the level of machine learning performance required.",
        "We plan to investigate this in the context of our task-based evaluation.",
        "Although we employed fairly standard text classification methodology in our experiments, we obtained high performance for S1 and S2.",
        "Due to the higher number of categories (and less training data for each of them), the overall performance was not equally impressive for S3 (although still quite high at 81% accuracy).",
        "Hirohata et al.",
        "(2008) have showed that the amount of training data can have a big impact on our task.",
        "They used c. 50,000 Medline abstracts annotated (by the authors of the Medline abstracts) as training data for S1.",
        "When using a small set of standard text classification features and Conditional Random Fields (CRF) (Lafferty et al., 2001) for classification, they obtained 95.5% per-sentence accuracy on 1000 abstracts.",
        "However, when only 1000 abstracts were used for training the accuracy was considerably worse; their reported per-abstract accuracy dropped from 68.8% to less than 50%.",
        "Although it would be difficult to obtain similarly huge training data for S2 and S3, this result suggests that one key to improved performance is larger training data, and this is what we plan to explore especially for S3.",
        "In addition we plan to improve our method.",
        "We showed that our schemes partly overlap and that similar features and methods tend to perform the best / worst for each of the schemes.",
        "It is therefore unlikely that considerable scheme specific tuning will be necessary.",
        "However, we plan to develop our features further and to make better use of the sequential nature of information structure.",
        "Currently this is only represented as the History feature, which provides a narrow window view to the category of the previous sentence.",
        "Also we plan to compare svm against methods such as CRF and Maximum Entropy which have proved successful in recent related works (Hirohata et al., 2008; Mer-ity et al., 2009).",
        "The resulting models will be evaluated both directly and in the context of CRA to provide an indication of their practical usefulness for real-world tasks."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The work reported in this paper was funded by the Royal Society (UK), the Swedish Research Council, FAS (Sweden), and JISC (UK) which is funding the SAPIENT Automation project.",
        "YG was funded by the Cambridge International Scholarship."
      ]
    }
  ]
}
