{
  "info": {
    "authors": [
      "Tomoko Izumi",
      "Kenji Imamura",
      "Genichiro Kikui",
      "Satoshi Sato"
    ],
    "book": "Proceedings of the 2010 Workshop on Multiword Expressions: from Theory to Applications",
    "id": "acl-W10-3709",
    "title": "Standardizing Complex Functional Expressions in Japanese Predicates: Applying Theoretically-Based Paraphrasing Rules",
    "url": "https://aclweb.org/anthology/W10-3709",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Tomoko Izumi* Kenji Imamura*",
        "^NTT Cyber Space Laboratories,",
        "NTT Corporation",
        "Genichiro Kikui* Satoshi Sato*",
        "In order to accomplish the deep semantic understanding of a language, it is essential to analyze the meaning of predicate phrases, a content word plus functional expressions.",
        "In agglutinating languages such as Japanese, however, sentential predicates are multi-morpheme expressions and all the functional expressions including those unnecessary to the meaning of the predicate are merged into one phrase.",
        "This triggers an increase in surface forms, which is problematic for NLP systems.",
        "We solve this by introducing simplified surface forms of predicates that retain only the crucial meaning of the functional expressions.",
        "We construct paraphrasing rules based on syntactic and semantic theories in linguistics.",
        "The results of experiments show that our system achieves the high accuracy of 77% while reducing the differences in surface forms by 44%, which is quite close to the performance of manually simplified predicates."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The growing need for text mining systems such as opinion mining and sentiment analysis requires the deep semantic understanding of languages (Inui et al., 2008).",
        "In order to accomplish this, one needs to not only focus on the meaning of a single content word such as buy but also the meanings conveyed by function words or functional expressions such as not and would like to.",
        "In other words, to extract and analyze a predicate, it is critical to consider both the content word and the functional expressions (Nasukawa, 2001).",
        "For example, the functional expressions would like to as in the predicate \"would like to buy\" and can't as in \"can't install\" are key expressions in detecting the customer's needs and complaints, providing valuable information to marketing research applications, consumer opinion analysis etc.",
        "Although these functional expressions are important, there have been very few studies that extensively deal with these functional expressions for use in natural language processing (NLP) systems (e.g., Tanabe et al., 2001; Mat-suyoshi and Sato, 2006, 2008).",
        "This is due to the fact that functional expressions are syntactically complicated and semantically abstract and so are poorly handled by NLP systems.",
        "In agglutinating languages such as Japanese, functional expressions appear in the form of suffixes or auxiliary verbs that follow the content word without any space.",
        "This sequence of a content word (c for short) plus several of functional expressions (f for short) forms a predicate in Japanese (COMP for completive aspect marker, NOM for nominalizer, COP for copular verb).",
        "buy COMP want PAST -NOM -COP",
        "The meaning of \"want to\" is expressed by -tai (f2) and the past tense is expressed by ta (f3).",
        "The other functional expressions, -chai(f1), -n(f4), and -da(f5), only slightly alter the predicative meaning of \"wanted to buy,\" as there is no direct English translation.",
        "Therefore, (1) expresses the same fact as (2).",
        "As shown, in Japanese, once one extracts a predicate phrase, the number of differences in surface forms increases drastically regardless of their similarities in meaning.",
        "This is because sentential predicates are multi-word or multimorpheme expressions and there are two different types of functional expressions, one which is crucial for the extraction of predicative meaning and the other, which is almost unnecessary for NLP applications.",
        "This increase in surface forms complicates NLP systems including text mining because they are unable to recognize that these seemingly different predicates actually express the same fact.",
        "In this study, we introduce paraphrasing rules to transform a predicate with complex functional expressions into a simple predicate.",
        "We use the term standardize to refer to this procedure.",
        "Based on syntactic and semantic theories in linguistics, we construct a simple predicate structure and categorize functional expressions as either necessary or unnecessary.",
        "We then paraphrase a predicate into one that only retains the crucial meaning of the functional expression by deleting unnecessary functional expressions while adding necessary ones.",
        "The paper is organized as follows.",
        "In Section 2, we provide related work on Japanese functional expressions in NLP systems as well as problems that need to be solved.",
        "Section 3 introduces several linguistic theories and our standardizing rules that we constructed based on these theories.",
        "Section 4 describes the experiments conducted on our standardization system and the results.",
        "Section 5 discusses the results and concludes the paper.",
        "Throughout this paper, we use the term functional expressions to indicate not only a single function word but also compounds (e.g., would like to)."
      ]
    },
    {
      "heading": "2. Previous Studies and Problems",
      "text": [
        "Shudo et al.",
        "(2004) construct abstract semantic rules for functional expressions and use them in order to find whether two different predicates mean the same.",
        "Matsuyoshi and Sato (2006, 2008) construct an exhaustive dictionary of functional expressions, which are hierarchically organized, and use it to produce different functional expressions that are semantically equivalent to the original one.",
        "Although these studies provide useful insights and resources for NLP systems, if the intention is to extract the meaning of a predicate, we find there are still problems that need to be solved.",
        "There are two problems that we focus on.",
        "The first problem is that many functional expressions are unnecessary, i.e., they do not actually alter the meaning of a predicate.",
        "rip -PAST",
        "In actual NLP applications such as text mining, it is essential that the system recognizes that (3) and (4) express the same event of something \"ripped.\"",
        "In order to achieve this, the system needs to recognize -teshimat, -no, and -dearu as unnecessary f f3, f4 – 0).",
        "Previous studies that focus on paraphrasing of one functional expression to another f – f) cannot solve this problem.",
        "The second problem is that we sometimes need to add certain functional expressions in order to retain the meaning of a predicate (0 – f).",
        "\"I wanted to go to Hawaii and relax.\"",
        "(5) has a coordinate structure, and two verbal predicates, iki (Pi) \"go\" and nonbirishi-takat-ta (P2) \"wanted to relax\", are coordinated.",
        "As the English translation indicates, the first predicate in fact means iki-takat-ta \"wanted to go,\" which implies that the speaker was not able to go to Hawaii.",
        "If the first predicate was extracted and analyzed as iku, the base (present) form of \"go,\" then this would result in a wrong extraction of predicate, indicating the erroneous fact of going to Hawaii in the future (Present tense in Japanese expresses a future event).",
        "In this case, we need to add the functional expressions takat \"want\" and ta, the past tense marker, to the first verbal predicate.",
        "As shown, there are two problems that need to be solved in order for a system to extract the actual meaning of a predicate.",
        "i.",
        "Several functional expressions are necessary for sustaining the meaning of the event expressed by a predicate while others barely alter the meaning f – 0).",
        "ii.",
        "Several predicates in coordinate sentences lack necessary functional expressions at the surface level (0 – f and this results in a wrong extraction of the predicate meaning.",
        "Based on syntactic and semantic theories in linguistics, we construct paraphrasing rules and solve these problems by standardizing complex functional expressions."
      ]
    },
    {
      "heading": "3. Construction of Paraphrasing Rules",
      "text": [
        "The overall flow of our standardizing system is depicted in Figure 1.",
        "The system works as follows.",
        "i.",
        "Given a parsed sentence as an input, it extracts a predicate(s) and assigns a semantic label to each functional expression based on Matsuyoshi and Sato (2006).",
        "ii.",
        "As for an intermediate predicate, necessary functional expressions are added if missing (0 – f).",
        "iii.",
        "From each predicate, delete unnecessary functional expressions that do not alter the meaning of the predicate f – 0).",
        "iv.",
        "Conjugate each element and generate a simplified predicate.",
        "There are two fundamental questions that we need to answer to accomplish this system.",
        "A) What are UNNECCESARY functional expressions (at least for NLP applications), i.e., those that do not alter the meaning of the event expressed by a predicate?",
        "B) How do we know which functional expressions are missing and so should be added?",
        "We answer these questions by combining what is needed in NLP applications and what is discussed in linguistic theories.",
        "We first answer Question A.",
        "As discussed in Section 1 and in Inui et al.",
        "(2008), what is crucial in the actual NLP applications is to be able to recognize whether two seemingly different predicates express the same fact.",
        "This perspective of factuality is similar to the truth-value approach of an event denoted by predicates as discussed in the field of formal semantics (e.g., Chierchia and Mcconnel-Ginet, 2000; Portner, 2005).",
        "Although an extensive investigation of these theories is beyond the scope of this paper, one can see that expressions such as tense (aspect), negation as well as modality, are often discussed in relation to the meaning of an event (Partee et al., 1990; Portner, 2005).",
        "Tense (Aspect): Expresses the time in (at/for) which an event occurred.",
        "Negation: Reverses the truth-value of an event.",
        "Modality: Provides information such as possibility, obligation, and the speaker's eagerness with regard to an event and relate it to what is true in reality.",
        "The above three categories are indeed useful in explaining the examples discussed above.",
        "aspect modality tense(aspect) modality tense(aspect) \"wanted to buy\"",
        "The predicate \"kat-chai-takat-ta-n-da\" in (6) and \"kai-takat-ta\" in (7) express the same event because they share the same tense (past), negation (none), and modality (want).",
        "Although (6) has the completive aspect marker -chai while (7) does not, they still express the same fact.",
        "This is because the Japanese past tense marker ta also has a function to express the completive aspect.",
        "The information expressed by -chai in (6) is re-",
        "Input A parsed Sentence",
        "i. Predicate Extraction & Labeling Semantic Classes to Functional Expressions",
        "ii.",
        "ADD necessary functional expressions iii.",
        "DELETE unnecessary functional expressions",
        "Hontoo-wa Hawai-ni iki, nonbirishi takat ta n nonbirishi relax takat ta want PAST [SS] [ST] iki tai ta",
        "iv.",
        "Conjugate and Generate simple predicates",
        "Simplified Predicates iki takat ta nonbirishi takat ta relax want PAST iki-takat-ta \"wanted to go\" nonbirishi-takat-ta \"wanted to relax\"",
        "dundant and so unnecessary.",
        "On the other hand, the predicate \"iku\" in (5) and \"iki-takat-ta,\" which conveys the actual meaning of the predicate, express a different fact because they establish a different tense (present vs. past) and different modality (none vs. want).",
        "As shown, once we examine the abstract semantic functions of functional expressions, we can see the factual information in a predicate is influenced by tense (aspect), negation, and modality.",
        "Therefore, the answer to Question A is that necessary functional expressions are those that belong to tense (aspect), negation, and modality.",
        "Furthermore, if there are several functional expressions that have the same semantic function, retaining one of them is sufficient.",
        "The next question that we need to answer is how we find which functional expressions are missing when standardizing an intermediate predicate in a coordinate structure (e.g., (5)).",
        "We solve this based on a detailed analysis of the syntactic structure of predicates.",
        "Coordinate structures are such that several equivalent phrases are coordinated by conjunctions such as and, but, and or.",
        "If a predicate is coordinated with another predicate, these two predicates must share the same syntactic level.",
        "Therefore, the structure in (5) is indeed depicted as follows (What TP and ModP stand for will be discussed later).",
        "[TP[ModP[VP(Hawai-ni) iki][VPnonbirishi]takat]ta ] [TP[ModP[vP(Hawaii-to) go][vPrelax] want]PAST]",
        "This is the reason why the first predicate iki should be paraphrased as iki-takat-ta \"wanted to go.\"",
        "It needs to be tagged with the modality expression tai and the past tense marker ta, which seems to attach only to the last predicate.",
        "This procedure of adding necessary functional expressions to the intermediate predicate is not as simple as it seems, however.",
        "(8) nemutai-mitai-de kaeri -tagatte -tei -ta",
        "sleepy-seems-COP gohome-want-CONT-PAST \"He seemed sleepy and wanted to go home.\"",
        "In (8), the first predicate nemutai-mitai-de \"seem to be sleepy\" should be paraphrased as nemutai-mitai-dat-ta, \"seemed to be sleepy,\" in which only the functional expression indicating past is required.",
        "The other functional expressions such as tagatte \"want,\" and the aspect marker tei (CONTinuation) should not be added (nemutai-mitai-de-tagat(want)-tei(CONT)-ta(PAST) is completely ungrammatical).",
        "Furthermore, the intermediate predicate in the following example does not allow any functional expressions to be added.",
        "(9) (imawa) yasui-ga (mukashiwa) takakat-ta (today)inexpensive-but (in old days) expensive\"(They) are inexpensive (today), (but) used to be very expensive (in the old days.)\"",
        "In (9), the first predicate yasui \"inexpensive\" should not be paraphrased as yasukat-ta \"was inexpensive\" since this would result in the ungrammatical predicate of \"*(they) were inexpensive (today).\"",
        "In order to add necessary functional expressions to an intermediate predicate, one needs to solve the following two problems.",
        "i.",
        "Find whether the target predicate indeed lacks necessary functional expressions.",
        "ii.",
        "If such a shortfall is detected, decide which functional expressions should be added to the predicate.",
        "We solve these problems by turning to the incompleteness of the syntactic structure of a predicate.",
        "Studies such as Cinque (2006) and Rizzi (1999) propose detailed functional phrases such as TopP (Topic Phrase) in order to fully describe the syntactic structures of a language.",
        "We adopt this idea and construct a phrase structure of Japanese predicates which borrows from the functional phrases of TP, ModP, and FocP (Figure 2).",
        "ModP stands for a modality phrase and this is where modality expressions can appear.",
        "FocP stands for a focus phrase.",
        "This is the phrase where the copula da appears.",
        "This phrase is needed because several modality expressions syntactically need the copula da in either the following or preceding position (Kato, 2007).",
        "The existence of FocP also indicates that the modality expressions within the phrase are complete (no more modality phrase is attached).",
        "TP stands for a tense phrase and this is where the tense marker appears.",
        "Note that this structure is constructed for the purpose of Standardization and other functional",
        "(FocP) T: ta PAST [st] (ModP)* Foc:da COP [AJISr] VP Mod: mitai \"seems\" [f§Ji]",
        "projections such as NegP (negation phrase) will not be discussed although we assume there must be one.",
        "Based on the predicate structure in Figure 2, we solve the two problems as follows.",
        "The first problem: Detecting whether the target predicate lacks necessary functional expressions.",
        "> If the predicate has the past tense marker ta or if the coordinate conjunction following the predicate is for combining phrases with tense, then consider the predicate as complete and do not add any functional expressions.",
        "Otherwise, consider the predicate as incomplete and add the appropriate functional expressions.",
        "The underlying principle of this rule is that if a predicate is tensed, then its syntactic structure is complete.",
        "As often described in syntactic theories (e.g., Adger, 2003), a sentence can be said to be a phrase with tense (i.e., TP).",
        "In other words, if a predicate is tensed, then it can stand alone as a sentence.",
        "By adopting this idea, we judge the completeness of a predicate by the existence of tense.",
        "Because Japanese marks past tense by the past tense marker -ta, if a predicate has -ta, it is complete and no functional expressions need be added.",
        "However, Japanese does not hold an explicit present tense marker; the base form of a verb is also a present form.",
        "We solve this by looking at which conjunction follows the predicate.",
        "As discussed in Minami (1993), the finite state and the type of conjunction are related; some conjunctions follow tensed phrases while others follow infinitival phrases.",
        "Following this, we categorize all the coordinate conjunctions based on whether they can combine with a tensed phrase.",
        "These conjunctions are listed as tensed in Table 1.",
        "If the target phrase is followed by one of those conjunctions, then we do not add any functional expressions to them because they are complete.",
        "The second problem: Finding the appropriate functional expressions for incomplete intermediate predicates.",
        "As discussed, we assume that predicates are coordinated at one of the functional phrase levels in Figure 2.",
        "Functional expressions that need to be added are, therefore, those of the outer phrases of the target phrase.",
        "For example, if the target phrase has da, the head of FocP, then it only needs the past tense marker to be added, which is located above the FocP (i.e., TP).",
        "This explains the paraphrasing pattern of (8).",
        "Therefore, by looking at which functional expressions held by the target predicate, one can see that functional expressions to be added are those that belong to phrases above the target phrase.",
        "As shown, the answer to Question B is that we only add functional expressions to incomplete predicates, which are judged based on the existence/absence of tense.",
        "The appropriate functional expressions to be added are those of outer phrases of the target phrase.",
        "In this final subsection, we describe how we actually implement our theoretical observations in our standardization system.",
        "CATEGORIZE functional expressions",
        "First, we selected functional expressions that belong to our syntactic and semantic categories from those listed in Matsuyoshi and Sato (2006), a total of about 17,000 functional expressions with 95 different semantic labels.",
        "We use abstract semantic labels, such as \"completion,\" \"guess,\" and \"desire\" for the categorization (Table 2).",
        "We divided those that did not belong to our syntactic and semantic categories into Deletables and Undeletables.",
        "Deletables are those that do not alter the meaning of an event and are, therefore, unnecessary.",
        "Undeletables are those that are a part of content words, and so cannot be deleted (e.g., kurai [Sät] \"about\" as in 1-man-en-kurai-da \"is about one million yen\").",
        "Based on the categorization of semantic labels as well as surface forms of functional expressions, our system works as follows; ADD necessary functional expressions",
        "A-1: Examine whether the target predicate has the tense marker ta or it is followed by the conjunctions categorized as tensed.",
        "If not, then go to Step A-2.",
        "A-2: Based on the semantic label of the target predicate, decide which level of syntactic phrase the predicate projects.",
        "Add functional expressions from the last predicate that belongs to outer phrases.",
        "DELETE unnecessary functional expressions",
        "D-1: Delete all the functional expressions that are categorized as Deletables.",
        "D-2: Leave only one functional expression if there is more than one same semantic label.",
        "For those categorized as Negation, however, delete all if the number of negations is even.",
        "Otherwise, leave one.",
        "D-3: Delete those categorized as Focus if they do not follow or precede a functional expression categorized as Modality.",
        "GENERATE simple predicates",
        "Last, conjugate all the elements and generate simplified surface forms of predicates.",
        "4 Experiments and Evaluations 4.1 Constructing Paraphrase Data",
        "We selected 2,000 sentences from newspaper and blog articles in which more than one predicate were coordinated.",
        "We manually extracted predicates (c-fi-f2..fr).",
        "Half of them were those in which the last predicate had three or more functional expressions (n > 3).",
        "Not tensed",
        "Tensed",
        "gerundive form, te",
        "shi, dakedenaku, ueni, bakarika, hoka(ni)(wa), keredo, ga, nonitai-shi(te),ippou(de),hanmen",
        "We then asked one annotator with a linguistic background to paraphrase each predicate into the simplest form possible while retaining the meaning of the event.",
        "We asked another annotator, who also has a background in linguistics, to check whether the paraphrased predicates made by the first annotator followed our criterion, and if not, asked the first annotator to make at least one paraphrase.",
        "424 out of 4,939 predicates (8.5%) were judged as not following the criterion and were re-paraphrased.",
        "This means that the accuracy of 91.5% is the gold standard of our task.",
        "One of the authors manually assigned a correct semantic label to each functional expression.",
        "Procedure i in Figure 1 is, therefore, manually implemented in our current study.",
        "Based on the standardization rules discussed in Section 3, our system automatically paraphrased functional expressions of test predicates into simple forms.",
        "We excluded instances that had segmentation errors and those that were judged as inappropriate as a predicate.",
        "A total of 1,501 intermediate predicates (287 for development and 1,214 for test) and 1,958 last predicates (391 for development and 1,567 for test) were transformed into simple predicates.",
        "The accuracy was measured based on the exact match in surface forms with the manually constructed paraphrases.",
        "For comparison, we",
        "and not semantic labels) were used for annotation.",
        "In Japanese, a gerundive form of a verb is sometimes used as a postposition.",
        "The annotators excluded these examples as \"not-paraphrasable.\"",
        "used the following baseline methods.",
        "> No Add/Delete: Do not add/delete any functional expression.",
        "> Simp Add: Simply add all functional expressions that the intermediate phrase does not have from the last predicate.",
        "Table 3 indicates the results.",
        "Our standardizing system achieved high accuracy of around 77% and 83 % in open (against the test set) and closed tests (against the development set) compared to the baseline methods (No Add/Delete (open), 55%; Simp Add (open), 33%).",
        "We also measured the reduced rate of differences in surface forms.",
        "We counted the number of types of functional expressions in the last predicates (a sequence of f1-f2-f3 is counted as one) before and after the standardization.",
        "For comparison, we also counted the number of functional expressions of the manually paraphrased predicates.",
        "Table 4 lists the results.",
        "As shown, our standardizing system succeeded in reducing surface differences in predicates from the original ones at the rate of 44.0%, which is quite close to the rate achieved by the human annotators (52.0%)."
      ]
    },
    {
      "heading": "5. Discussion and Conclusion",
      "text": [
        "Our standardization system succeeded in generating simple predicates in which only functional expressions crucial for the factual meaning of the predicate were retained.",
        "The predicates produced by our system showed fewer variations in their surface forms while around 77% of them exactly matched the simplified predicates produced by human annotators, which is quite high compared to the baseline systems.",
        "Syntactic",
        "Semantic",
        "Semantic Labels",
        "T if the surface is ta",
        "Tense (Aspect)",
        "^(completion), #«, IHiffi, gH, H«, «%, 5§«%, ft*, *",
        "M, JAW, te^",
        "Negation",
        "5/t(negation), JAW, 5£ft^, §ÊÛ, 7^^, 7fF\"Sj, ^iffi, Äftft",
        "Mod",
        "Modality",
        "«â(guess), IM(desrre), fF^T, S*5, fti£, ftffi, ft&ft, tiff, njtl, ifc&, MS « ^Rjtl, 7fF^T, HUB, 7^Ti8, Äft*",
        "Foc",
        "Focus",
        "AW(affirmation), ^Mft, lUlg-",
        "Deletables",
        "T^(politeness), ft-g^, föffl, ffijS, rt-g^, g$^ê, J&Ö0, fflÉ, ÄSÄ/t, it",
        "m,^m, immmm, immiKm, rsjë, mmm",
        "Undele-tables",
        "gffi(about), m&, «, mm, hWM., ä ë^, m&, wm, mmm, m m,MMt, wi, um,ffiH, imiE,^mi&m, m#m,mmmm,mmzi, gm,",
        "&m, Mit, SS, WÄ, MS, Mal, gg, &p;This was achieved because we constructed solid paraphrasing rules by applying linguistic theories in semantics and syntax.",
        "The quite low accuracy of the baseline method, especially SimpAdd, further supports our claim that implementing linguistic theories in actual NLP applications can greatly improve system performance.",
        "Unlike the study by Inui et al.",
        "(2008), we did not include the meaning of a content word for deciding the factuality of the event nor did we include it in the paraphrasing rules.",
        "This lowers the accuracy.",
        "Several functional expressions, especially those expressing aspect, can be deleted or added depending on the meaning of the content word.",
        "This is because content words inherently hold aspectual information, and one needs to compare it to the aspectual information expressed by functional expressions.",
        "Because we need a really complicated system to compute the abstract semantic relations between a content word and functional expressions, we leave this problem for future research.",
        "Regardless of this, our standardizing system is useful for a lot of NLP applications let alone text mining.",
        "As mentioned in Inui et al.",
        "(2008), bag-of-words-based feature extraction is insufficient for conducting statistically-based deep semantic analysis, such as factual analysis.",
        "If standardized predicates were used instead of a single content word, we could expect an improvement in those statistically-based methods because each predicate holds important information about fact while differences in surface forms are quite limited.",
        "In conclusion, we presented our system for standardizing complex functional expressions in Japanese predicates.",
        "Since our paraphrasing rules are based on linguistic theories, we succeeded in producing simple predicates that have only the functional expressions crucial to understanding of the meaning of an event.",
        "Our future research will investigate the relationship between the meaning of content words and those of functional expressions in order to achieve higher accuracy.",
        "We will also investigate the impact of our standardization system on NLP applications.",
        "Normalization",
        "No Add/Delete",
        "Simp Add",
        "Open (Intermediate)",
        "77.7%(943/1214)",
        "57.8%(702/1214)",
        "32.8%(398/1214)",
        "Closed (Intermediate)",
        "82.9%(238/287)",
        "62.0%%(178/287)",
        "35.2%(101/287)",
        "Open (Last)",
        "76.2%(1194/1567)",
        "51.9% (203/391)",
        "n.a",
        "Closed (Last)",
        "83.4%(326/391)",
        "48.1%(188/391)",
        "n.a.",
        "Original",
        "943",
        "types",
        "Reduced Rate",
        "Normalization",
        "530",
        "types",
        "44.0%",
        "Human Annotation",
        "448",
        "types",
        "52.0%"
      ]
    }
  ]
}
