{
  "info": {
    "authors": [
      "Youzheng Wu",
      "Hisashi Kawai"
    ],
    "book": "Proceedings of the Joint Conference on Chinese Language Processing",
    "id": "acl-W10-4117",
    "title": "Exploiting Social Q&A Collection in Answering Complex Questions",
    "url": "https://aclweb.org/anthology/W10-4117",
    "year": 2010
  },
  "references": [
    "acl-C08-1063",
    "acl-H05-1054",
    "acl-H05-1116",
    "acl-J03-1002",
    "acl-N06-1049",
    "acl-P03-1003",
    "acl-P05-1027",
    "acl-P08-1019",
    "acl-P08-1082",
    "acl-P09-1082"
  ],
  "sections": [
    {
      "text": [
        "Youzheng Wu Hisashi Kawai",
        "Spoken Language Communication Group, MASTAR Project National Institute of Information and Communications Technology 2-2-2 Hikaridai, Keihanna Science City, Kyoto 619-0288, Japan {youzheng.wu, hisashi.kawai}@nict.go.jp",
        "This paper investigates techniques to automatically construct training data from social Q&A collections such as Yahoo!",
        "Answer to support a machine learning-based complex QA system.",
        "We extract cue expressions for each type ofquestion from collected training data and build question-type-specific classifiers to improve complex QA system.",
        "Experiments on 10 types of complex Chinese questions verify that it is effective to mine knowledge from social Q&A collections for answering complex questions, for instance, the F 3 improvement of our system over the baseline and translation-based model reaches 7.9% and 5.1%, respectively."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Research on the topic ofQA systems has mainly concentrated on answering factoid, definitional, reason and opinion questions.",
        "Among the approaches proposed to answer these questions, machine learning techniques have been found more effective in constructing QA components from scratch.",
        "Yet these supervised techniques require a certain scale of (question, answer), short for Q&A, pairs as training data.",
        "For example, (Echihabi et al., 2003) and (Sasaki, 2005) constructed 90,000 English Q&A pairs and 2,000 Japanese Q&A pairs, respectively for their factoid QA systems.",
        "(Cui et al., 2004) constructed 76 term-definition pairs for their definitional QA systems.",
        "(Stoyanov et al., 2005) required a known subjective vocabulary for their opinion positive and 521,177 negative examples in their reason QA system.",
        "Among complex QA systems, many other types of questions have not been well studied, apart from reason and definitional questions.",
        "Appendix A lists 10 types of complex Chinese questions and their examples we discussed in this paper.",
        "According to the related studies on QA, supervised machine-learning technique may be effective for answering these questions.",
        "To employ the supervised approach, we need to reconstruct training Q&A pairs for each type of question, though this is an extremely expensive and labor-intensive task.",
        "To deal with the acquisition problem of training Q&A pairs, we investigate techniques to automatically construct training data by utilizing social Q&A collections crawled from the Web, which contains millions of user-generated Q&A pairs.",
        "Many studies (Surdeanu et al., 2008) (Duan et al., 2008) have been done on retrieving similar Q&A pairs from social QA websites as answers to test questions.",
        "Our study, however, regards social Q&A websites as a knowledge repository and aims to mine knowledge from them for synthesizing answers to questions from multiple documents.",
        "There is very little literature on this aspect.",
        "Our work can be seen as a kind of query-based summarization and Radev, 2004), and can also be employed to answer questions that have not been answered in social Q&A websites.",
        "This paper mainly focuses on the following three steps: (1) automatically constructing question -type-specific training Q&A pairs from the social Q&A collection; (2) extracting cue expressions for each type of question from the collected training data, and (3) building question-type-specific classifiers to filer out noise sentences before using a state-of-the-art IR formula to select answers.",
        "We evaluate our system on 10 types of Chinese questions by using the Pourpre evaluation tool (Lin and Demner-Fushman, 2006).",
        "The experimental results show the effectiveness of our system, for instance, the F3/NR improvement of our system over the baseline and translation-based model reaches 7.9%/11.1%, and 5.1%/5.6%, respectively."
      ]
    },
    {
      "heading": "2. Social Q&A Collection",
      "text": [
        "Recently launched social QA websites such as Yahoo!",
        "Answer and Baidu Zhidao provide an interactive platform for users to post questions and answers.",
        "After questions are answered by users, the best answer can be chosen by the asker or nominated by the community.",
        "The number of Q&A pairs on such sites has risen dramatically.",
        "These pairs could collectively form a source of training data that is required in supervised machine-learning-based QA systems.",
        "In this paper we aim to explore such usergenerated Q&A collections to automatically collect Q&A training data.",
        "However, social collections have two salient characteristics: textual mismatch between questions and answers (i.e., question words are not necessarily used in answers); and user-generated spam or flippant answers, which are unfavorable factors in our study.",
        "Thus, we only crawl questions and their best answers to form Q&A pairs, wherein the best answers are longer than the empirical threshold.",
        "Finally, 60.0 million Q&A pairs were crawled from Chinese social QA websites.",
        "These pairs will be used as the source oftraining data required in our study."
      ]
    },
    {
      "heading": "3. Our Complex QA System",
      "text": [
        "The typical complex QA system architecture is a cascade of three modules.",
        "The Question Analyzer analyzes test questions and identifies answer types of questions.",
        "The Document Retriever & Answer Candidate Extractor retrieves documents related to questions from the given collection (Xinhua and Lianhe Zaobao newspapers from 1998-2001 were used in this study) for consideration, and segments the documents into sentences as answer candidates.",
        "The Answer Extraction module applies state-of-the-art IR formulas (e.g., KL-divergence language model) to directly estimate similarities between sentences (1,024 sentences were used in our case) and questions, and selects the most similar sentences as the final answers.",
        "Given three answer candidates, sl = \"Solutions to global warming range from changing a light bulb to engineering giant reflectors in space ...\", s2 = \"Global warming will bring bigger storms and hurricanes that will hold more water ...\", and s3 = \"nuclear power is the relatively low emission ofcarbon dioxide (CO2), one of the major causes of global warming, \" to the question of \"What are the hazards of global warming?",
        "\", however, it is hard for this architecture to select the correct answer, s2, because the three candidates contain the same question words \"global warming\".",
        "According to our observation, answers to a type of question usually contain some type-of-question dependent cue expressions (\"will bring\" in this case).",
        "This paper argues that the above QA system can be improved by using such question-type-specific cue expressions.",
        "For each test question, we perform the following three steps.",
        "(1) Collecting question-type-specific Q&A pairs from the social Q&A collection which question types are same as the test question to form positive training data.",
        "Similarly, negative Q&A pairs are also collected which question types are different from the test question.",
        "(2) Extracting and weighting question-type-specific cue expressions from the collected Q&A pairs.",
        "(3) Building a question-type-specific classifier by employing the cue expressions and the collected Q&A pairs, which removes noise sentences from answer candidates before using the Answer Extraction module.",
        "We first introduce the notion of the answer type informer of the question as follows.",
        "In a question, a short subsequence of tokens (typically 13 words) that are adequate for question classification is considered an answer-type informer, e.g., \"hazard\" in the question of \"What are the hazards of global warming?\"",
        "This paper makes the following assumption: type of complex question is determined by its answer type informer.",
        "For example, the question of \"What are the hazards of global warming?\"",
        "belongs to hazard-type question, because its answer type informer is \"hazard\".",
        "Therefore, the task of recognizing question-types is shifted to identifying answer type informer of question.",
        "In this paper, we regard answer-type informer recognition as a sequence tagging problem and adopt conditional random fields (CRFs) because many work has shown that CRFs have a consistent advantage in sequence tagging.",
        "We manually label 3,262 questions with answertype informers to train a CRF, which classifies each question word into a set of tags O = [Ib,Ij,Io}: Ib for a word that begins an informer, Ij for a word that occurs in the middle of an informer, and Io for a word that is outside of an informer.",
        "In the following feature templates used in the CRF model, wnand tn, refer to word and PoS, respectively; n refers to the relative position from the current word n=0.",
        "The feature templates include the following four types: unigrams of wn and tn, where n= – 2, – 1, 0,1, 2; bigrams of wnwn+l and tntn+l, where n= – 1,0; tri-grams of wnwn+iwn+2 and tntn+itn+2, where n= – 2, – 1,0; and bigrams of OnOn+l, where n= – 1, 0.",
        "The trained CRF model is then employed to recognize answer-type informers from questions of social Q&A pairs.",
        "Finally, we recognized 103 answer-type informers in which frequencies are larger than 10,000.",
        "Moreover, the numbers of answer type informers for which frequencies are larger than 100, 1,000, and 5,000 are 2,714, 807, and 194, respectively.",
        "Based on answer-type informers of questions recognized, we can collect training data for each type of question as follows: (1) Q&A pairs are grouped together in cases in which the answertype informers X of their questions are the same, and (2) Q&A pairs clustered by informers X are regarded as the positive training data of X-type questions.",
        "For instance, 10,362 Q&A pairs grouped via informer X (=\"hazard\") are regarded as positive training data of answering hazard-type questions.",
        "Table 1 lists some questions, which, together with their best answers, are employed as the training data of the corresponding type of questions.",
        "For each type of question, we also randomly select some Q&A pairs that do not contain informers in questions as negative training data.",
        "Preprocessing of the training data, including word segmentation, PoS tagging, and named entity (NE) tagging (Wu et al., 2005), is conducted.",
        "We also replace each NE with its tag type.",
        "Table 1: Questions (translated from Chinese) of social Q&A pairs (words in bold denote answertype informers of questions).",
        "These questions and their best answers are regarded as positive training data for hazard-type question.",
        "Qtype",
        "Questions of Q&A pairs",
        "Hazard-type",
        "What are the hazards of the tro-",
        "jan.psw.misc.kah virus?",
        "What are the hazards of RMB appreciation",
        "on China's economy?",
        "Hazards of smoke",
        "What are the hazards of contact lenses?",
        "What are the hazards of waste accumulation?",
        "Casualty-type",
        "What were the casualties on either side from the U.S.-Iraq war?",
        "What were the casualties of the Sino-French War?",
        "What were the casualties of the Sichuan earthquake in 2008?",
        "What were the casualties of highway accidents over the years?",
        "What were the casualties of the Ryukyu Islands tsunami?",
        "Reason-type",
        "What are the main reasons of China's water shortage?",
        "What are the reasons of asthma?",
        "What are the reasons of blurred photos?",
        "What are the reasons of air pollution?",
        "The reasons for the soaring prices!",
        "We extract lexical and PoS-based n-grams as cue expressions from the collected training data.",
        "To reduce the dimensionality of the cue expression space, we first select the top 3,000 lexical un-igrams using the formula: scorew = tfw x log(idfw), where tf (w) denotes the frequency of word w, and idf (w) represents the inverted document frequency of w that indicates its global importance.",
        "Table 2 shows some of the learned unigrams.",
        "The top 300 unigrams are then used as seeds to learn lexical bigrams and trigrams iteratively.",
        "Only lexical bigrams and trigrams that contain seed unigrams with frequencies larger than the thresholds are retained as lexical features.",
        "Moreover, we extract PoS-based unigrams and bigrams as cue expressions.",
        "Further, we assign each extracted feature sj a weight calculated using the equation weightSi = cl / (c1i + c2i ), where, csli and c2i denote its frequencies in positive and negative training Q&A pairs, respectively.",
        "As mentioned above, we use the extracted cue expressions and the collected Q&A pairs to build question-type-specific classifiers, which is used to remove noise sentences from answer candidates.",
        "For classifiers, we employ multivariate classification SVMs (Thorsten Joachims, 2005) that can directly optimize a large class of performance measures like Fs-Score, prec@k (precision of a classifier that predicts exactly k =100 examples to be positive) and error-rate (percentage of errors in predictions).",
        "Instead of learning a univariate rule that predicts the label of a single example in conventional SVMs (Vapnik, 1998), multivariate SVMs formulate the learning problem as a multivariate prediction of all examples in the data set.",
        "Considering hypotheses h that map a tuple x of n feature vectors x = (xi, ...,xn) to a tuple y of n labels y = (ys,yn), multivariate SVMs learn a classifier by solving the following optimization problem.",
        "where, w is a parameter vector, 'J/ is a function that returns a feature vector describing the match between (xi,xn) and (yl,y'n), A denotes types of multivariate loss functions, and £ is a slack variable."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "The NTCIR 2008 test data set (Mitamura et al., 2008) contains 30 complex questions we discussed here.",
        "However, a small number of test questions are included for some question types, e.g.; it contains only 1 hazard-type, 1 scale-type, and 3 significance-type questions.",
        "To form a more complete test set, we create another 65 test questions.",
        "Therefore, the test data used in this paper includes 95 complex questions.",
        "For each test question we also provide a list of weighted nuggets, which are used as the gold standard answers for evaluation.",
        "The evaluation is conducted by employing Pourpre v1.0c (Lin and Demner-Fushman, 2006), which uses the standard scoring methodology for TREC other questions (Voorhees, 2003), i.e., answer nugget recall NR, nugget precision NP, and a combination score F3 of NR and NP.",
        "For better understanding, we evaluate the systems when outputting the top N sentences as answers.",
        "Qtype",
        "Top Unigrams",
        "Hazard-type",
        "f&H/hazard ISS/lead to iaJÄ/cause *j[jË/give rise to /\"\"ÉÉ/bring about jf£ IJ|»l/influence JnS/damage",
        "Casualty-type",
        "ffi Ù/casualty ^EÙ/death Sffi/hurt ^cfê/missing illÄ/wrecked ß$\"t/die in battle Öfij/wounded",
        "Table 3 summarizes the evaluation results for several N values.",
        "The baseline refers to the conventional method introduced in Section 3, which does not employ question-type-specific classifiers before the Answer Extraction.",
        "The baseline can be expressed by the formula:",
        "where, Vq and Vs are the vectors of the question and candidate answer.",
        "The TransM denotes a translation model for QA (Xue, et al., pairs as the parallel corpus, with questions to the \"source\" language and answers corresponding to the \"target\" language.",
        "This model can be expressed by:",
        "where, q is the question, S the sentence, P(w\\t) the probability of translating a sentence term t to the question term w, which is obtained by using the GIZA++ toolkit (Och and Ney, 2003).",
        "We use six million Q&A pairs to train IBM model 1 for obtaining word-to-word probability P (w\\t).",
        "Ourserrormte and Ourspre@k denote our models that are based on classifiers optimizing performance measure error-rate and prec@k, respectively.",
        "Ours1in, a linear interpolation model, that combines scores of classifiers and the baseline, which is similar to (Mori et al., 2008) and can be expressed by the equation:",
        "where, 0(s) is the score calculated by classifiers (Thorsten Joachims, 2005) and a denotes the weight of the score.",
        "This experiment shows that: (1) Question-type-specific classifiers can greatly outperform the baseline; for example, the F3 improvements of Ourserrormte and Ourspre@fc over the baseline in terms of N =10 are 5.8% and 7.9%, respectively.",
        "(2) Ourserrormte is better than Ourspre@fc when N < 10.",
        "The average numbers of sentences retained in Ourserrormte and @k are 130, and 217, respectively.",
        "That means the precision of the classifier optimizing errorrate is superior to the classifier optimizing prec@k, while the recall is relatively inferior.",
        "(3) Ours1in is worse than Ourserrormte and Ourspre@k, which indicates that using question-type-specific classifiers by classification is better than using it by interpolation like (Mori et al., 2008).",
        "(4) Our models also outperform TransM, e.g.; the F3 improvement is 5.1% when N is set to 10.",
        "TransM exploits the social Q&A collection without consideration of question types, while our models select and exploit the social Q&A pairs ofthe same question types.",
        "Thereby, this experiment also indicates that it is better to exploit social Q&A pairs by type of question.",
        "The performance ranking of these models when",
        "N =10 is: Oursprec@fc > Ourserrormte > Oursin > TransM > Baseline.",
        "In order to evaluate the contributions of individual features to our models, this experiment is conducted by gradually adding them.",
        "Table 4 summarizes the performance of Ourprec@k on different set of features, L and P represent lexical and PoS-based features, respectively.",
        "This table demonstrates that all the lexical and PoS features can positively impact Ourprec@k, especially, the contribution of the PoS-based features is largest.",
        "F3 (%)",
        "NR (%)",
        "NP (%)",
        "JV= 1 N = 5 TV =10",
        "JV= 1 N = 5 TV =10",
        "JV= 1 N = 5 N=\\0",
        "Baseline",
        "9.82 18.18 21.95",
        "9.44 19.85 27.64",
        "34.35 25.32 18.96",
        "TransM",
        "9.76 20.47 24.76",
        "9.44 19.85 33.10",
        "31.96 21.73 13.57",
        "OlirSHn",
        "10.92 22.61 25.74",
        "10.49 25.95 34.70",
        "34.98 23.40 15.11",
        "OllTS e r r or r ate",
        "12.37 23.10 27.74 8.96 22.85 29.85",
        "12.05 26.98 37.03 8.72 25.67 38.78",
        "33.22 26.48 18.67 26.28 28.82 20.45",
        "ploy k-fold cross validation to remove noises from the collected training data in Section 3.1.",
        "Specifically, the collected training data are first divided into k (= 5) sets.",
        "Secondly, k-1 sets are used to train classifiers that are applied to classify the Q&A pairs in the remaining set.",
        "Finally, part of the Q&A pairs classified as negative pairs are removed .",
        "According to Figure 1, we remove 20% of the training data from the negative pairs for the hazard-type, impact-type, and function-type questions, and 40% of the training data for significance-type, event-type, and reason-type questions.",
        "Because the sizes of the training pairs of the other four types of questions are small, we do not use this approach on them.",
        "Table 5 shows the results of Ourspre@k on the above six types of questions.",
        "The numbers in brackets indicate absolute improvements over the system based on the data without removing noises.",
        "N is the number of answer sentences to a question.",
        "The experiment shows that the performance is generally improved by removing noise in the training Q&A pairs using k-fold cross-validation.",
        "Table 5 : Performance of Ourspre@k after removing noises in the training Q&A pairs.",
        "Pourpre v1.0c evaluation is based on n-gram overlap between the automatically produced answers and the human generated reference answers.",
        "Thus, it is not able to measure conceptual equivalent.",
        "In subjective evaluation, the answer sentences returned by systems are labeled by a native Chinese assessor.",
        "Figure 2 shows the distribution of the ranks of the first correct answers for all questions.",
        "This figure demonstrates that the Ourspre@k answers 57 questions which",
        "As discussed in Section 2, the writing style of social Q&A collections slightly differs from that of our complex QA system, which is an unfavorable circumstance in utilizing social Q&A collections.",
        "For better understanding we randomly select 100 Q&A training pairs of each type of question acquired in Section 3, and manually classify each Q&A pair into NON-NOISE and NOISE categories.",
        "Figure 1 reports the percentage of NON-NOISE.",
        "This figure indicates that 71% of the training pairs of the scale-type questions are noises, which may lead to a small improvement.",
        "To further improve the performance, we emfirst answers are ranked in top 3, which is larger than that of the baseline, i.e., 49.",
        "Moreover, the Ourspre@k contains only 11.5% of questions which answers are ranked after top 10, while this number of the baseline is 20.7%.",
        "Features",
        "^3",
        "NR",
        "NP",
        "Lunigram",
        "23.44",
        "31.23",
        "17.32",
        "+Lbigram +Ltrigram",
        "25.34",
        "33.15",
        "18.87",
        "+Punigram",
        "28.24",
        "36.27",
        "20.18",
        "+Pbigram",
        "29.85",
        "38.78",
        "20.45",
        "F3 (%)",
        "NR (%)",
        "NP (%)",
        "N= 1",
        "9.6+2.",
        "!",
        "9.3+2.0",
        "30.8+7.4",
        "N = 5",
        "21.6+o.7",
        "24.9+1.2",
        "26.0_i.3",
        "N= 10",
        "28.6+0.9",
        "37.9+1.7",
        "19.2_o.2"
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "Recently, some pioneering studies on the social Q&A collection have been conducted.",
        "Among them, much of the research aims to retrieve answers to queried questions from the social Q&A collection.",
        "For example, (Surdeanu et al., 2008) proposed an answer ranking engine for non-factoid questions by incorporating textual features into a machine learning approach.",
        "(Duan et al., 2008) proposed searching questions semantically equivalent or close to the queried question for a question recommendation system.",
        "(Agichtein et al., 2008) investigated techniques of finding high-quality content in the social Q&A collection, and indicated that 94% of answers to questions with high quality have high quality.",
        "(Xue, et al., 2008) proposed a retrieval model that combines a translation-based language model for the question part with a query likelihood approach for the answer part.",
        "Another category of study regards the social Q&A collection as a kind of knowledge repository and aims to mine knowledge from it for generating answers to questions.",
        "To the best of our knowledge, there is very limited work reported on this aspect.",
        "This paper is similar to (Mori et al., 2008), but different from it as follows.",
        "(1) (Mori et al., 2008) collects training data for each test question using 7-grams for which centers are interrogatives, while this paper collects training data for each type of question using answer type informers.",
        "(2) About the knowledge learned, we extract lexical/class-based, PoS-based uni-grams, bigrams, and trigrams.",
        "(Mori et al., 2008) only extracts lexical bigrams.",
        "(3) They incorporated knowledge learned by interpolating with the baseline.",
        "However, we utilize the learned knowledge to train a binary classifier, which can remove noise sentences before answer selection."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "This paper investigated a technique for mining knowledge from social Q&A websites for improving a sentence-based complex QA system.",
        "More specifically, it explored a social Q&A collection to automatically construct training data, and created question-type-specific classifier for each type of question to filter out noise sentences before answer selection.",
        "The experiments on 10 types of complex Chinese questions show that the proposed approach is effective; e.g., the improvement in F3 reaches 7.9%.",
        "In the future, we will endeavor to reduce NOISE pairs in the training data, and to extract type-of-question dependent features.",
        "Future research tasks also include adapting the QA system to a topic-based summarization system, which, for example, summarizes accidents according to \"casualty\", \"reason\", and summarizes events according to \"reason\", \"measure,\" \"impact\", etc.",
        "Qtype",
        "Examples",
        "fa W/Hazard-type",
        "^M^m^mmmm&if^ ?what",
        "are the hazards of global warming?",
        "f^ffl/F unction-type",
        "WàM fàttmÄfr & ?",
        "What are the functions of the United Nations?",
        "W Ufö/Impact-type",
        "n^9nmmimmmmvfà •> List",
        "the impact of the 911 attacks on the United States.",
        "MX/",
        "Significance-type",
        "^iJ^MnAwToWsX ■>",
        "List the significance of China's accession to the WTO.",
        "iS ffi/Attitude-type",
        "ß\\^&mn&nwmmm° List",
        "the attitudes ofother countries toward the Israeli-Palestinian conflict.",
        "tm Ji/Measure-type",
        "flß S te?",
        "M ?",
        "What measures have been taken for energy-saving and emissions-reduction in Japan?",
        "M H/Reason-type",
        "^w^m^mümm&if^ ?what",
        "are the reasons for global warming?",
        "ffi \"t/Casualty-type",
        "ßi^mmt^mmmt: » List the",
        "casualties ofthe Lockerbie Air Disaster.",
        "W fr/Eventtype",
        "■ft » List the events in the Northern Ireland peace process.",
        "M S/Scale-type",
        "H[ » Give information about the scale of the Kunming World Horticulture Exposition."
      ]
    }
  ]
}
