{
  "info": {
    "authors": [
      "Carlos Gómez-Rodríguez",
      "Marco Kuhlmann",
      "Giorgio Satta"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1035",
    "title": "Efficient Parsing of Well-Nested Linear Context-Free Rewriting Systems",
    "url": "https://aclweb.org/anthology/N10-1035",
    "year": 2010
  },
  "references": [
    "acl-C02-1028",
    "acl-E09-1055",
    "acl-N09-1061",
    "acl-P06-2066",
    "acl-P07-1021",
    "acl-P07-1077",
    "acl-P87-1015",
    "acl-P92-1012",
    "acl-W09-3808"
  ],
  "sections": [
    {
      "text": [
        "Carlos Gomez-Rodriguez, Marco Kuhlmann, and Giorgio Satta",
        "Departamento de Computaciön, Universidade daCoruna, Spain, cgomezr@udc.es Department of Linguistics and Philology, Uppsala University, Sweden, marco.kuhlmann@lingfil.uu.se Department of Information Engineering, University of Padua, Italy, satta@dei.unipd.it",
        "The use of well-nested linear context-free rewriting systems has been empirically motivated for modeling of the syntax of languages with discontinuous constituents or relatively free word order.",
        "We present a chart-based parsing algorithm that asymptotically improves the known running time upper bound for this class of rewriting systems.",
        "Our result is obtained through a linear space construction of a binary normal form for the grammar at hand."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Since its earliest years, one of the main goals of computational linguistics has been the modeling of natural language syntax by means of formal grammars.",
        "Following results by Huybregts (1984) and Shieber (1985), special attention has been given to formalisms that enlarge the generative power of context-free grammars, but still remain below the full generative power of context-sensitive grammars.",
        "On this line of investigation, mildly context-sensitive grammar formalisms have been introduced (Joshi, 1985), including, among several others, the tree adjoining grammars (TAGs) of Joshi et al.",
        "(1975).",
        "Linear context-free rewriting system (LCFRS), introduced by Vijay-Shanker et al.",
        "(1987), is a mildly context-sensitive formalism that allows the derivation of tuples of strings, i.e., discontinuous phrases.",
        "This feature has been used to model phrase structure treebanks with discontinuous constituents (Maier and S0gaard, 2008), as well as to map non-projective dependency trees into discontinuous phrase structures (Kuhlmann and Satta, 2009).",
        "Informally, in an LCFRS G, each nonterminal can generate string tuples with a fixed number of components.",
        "The fanout of G is defined as the maximum number of tuple components generated by G. During a derivation of an LCFRS, tuple components generated by the nonterminals in the right-hand side of a production are concatenated to form new tuples, possibly adding some terminal symbols.",
        "The only restriction applying to these generalized concatenation operations is linearity, that is, components cannot be duplicated or deleted.",
        "The freedom in the rearrangement of components has specific consequences in terms of the computational and descriptional complexity of LCFRS.",
        "Even for grammars with bounded fan-out, the universal recognition problem is NP-hard (Satta, 1992), and these systems lack Chomsky-like normal forms for fixed fanout (Rambow and Satta, 1999) that are especially convenient in tabular parsing.",
        "This is in contrast with other mildly context-sensitive formalisms, and TAG in particular: TAGs can be parsed in polynomial time both with respect to grammar size and string size, and they can be cast in normal forms having binary derivation trees only.",
        "It has recently been argued that LCFRS might be too powerful for modeling languages with discontinuous constituents or with relatively free word order, and that additional restrictions on the rearrangement of components might be needed.",
        "More specifically, analyses of both dependency and constituency treebanks (Kuhlmann and Nivre, 2006; Havelka, 2007; Maier and Lichte, 2009) have shown that rearrangements of argument tuples almost always satisfy the so-called well-nestedness condition, a generalization of the standard condition on balanced brackets.",
        "This condition states that any two components x\\,x2 of some tuple will never be composed with any two components yi, y2 of some other tuple in such a way that a 'crossing' configuration is realized.",
        "In this paper, we contribute to a better understanding of the formal properties of well-nested LCFRS.",
        "We show that, when fanout is bounded by any integer p > 1, these systems can always be transformed, in an efficient way, into a specific normal form with no more than two nonterminals in their productions' right-hand sides.",
        "On the basis of this result, we then develop an efficient parsing algorithm for well-nested LCFRS, running intime O(p • |G| • |w|^+), where G and w are the input grammar and string, respectively.",
        "Well-nested LCFRS with fanout p = 2 are weakly equivalent to TAG, and our complexity result reduces to the well-known upper bound O(|G| • |w|) for this class.",
        "For p > 2, our upper bound is asymptotically better than the one obtained from existing parsing algorithms for general LCFRS or equivalent formalisms (Seki et al., 1991).",
        "Well-nested LCFRS are generatively equivalent to (among others) coupled context-free grammars (CCFG), introduced by Hotz and Pitsch (1996).",
        "These authors also provide a normal form and develop a parsing algorithm for CCFGs.",
        "One difference with respect to our result is that the normal form for CCFGs allows more than two nonterminals to appear in the right-hand side of a production, even though no nonterminal may contribute more than two tuple components.",
        "Also, the construction in (Hotz and Pitsch, 1996) results in a blow-up of the grammar that is exponential in its fan-out, and the parsing algorithm that is derived runs in time O(4^ • |G| • |w|^+2).",
        "Our result is therefore a considerable asymptotic improvement over the CCFG result, both with respect to the normal form construction and the parsing efficiency.",
        "Finally, under a practical perspective, our parser is a simple chart-based algorithm, while the algorithm in (Hotz and Pitsch, 1996) involves two passes and is considerably more complex to analyze and to implement than ours.",
        "Kanazawa and Salvati (2010) mention a normal form for well-nested multiple context-free grammars.",
        "Structure In Section 2, we introduce LCFRS and the class of well-nested LCFRS that is the focus of this paper.",
        "In Section 3, we discuss the parsing complexity of LCFRS, and show why grammars using our normal form can be parsed efficiently.",
        "Section 4 presents the transformation of a well-nested LCFRS into the normal form.",
        "Section 5 concludes the paper."
      ]
    },
    {
      "heading": "2. Linear Context-Free Rewriting Systems",
      "text": [
        "We write [n] to denote the set of positive integers up to and including n: [n] = {1,..., n}.",
        "is called a linear, non-erasing function over E with type ki x • • • x km – k, if it can be defined by an equation of the form where a is a k-tuple of strings over the variables on the left-hand side of the equation and E with the property that each variable occurs in a exactly once.",
        "The values m and k are called the rank and the fanout of f, and denoted by p(f ) and p(f ).",
        "For the purposes of this paper, a linear context-free rewriting system, henceforth LCFRS, is a construct G = (N, T, P, S), where N is an alphabet of nonterminal symbols in which each symbol A is associated with a positive integer p(A) called its fan-out, T is an alphabet of terminal symbols, S G N is a distinguished start symbol with p(S) = 1 ; and P is a finite set of productions of the form where m > 0, A, Ai,..., Am G N, and f is a linear, non-erasing function over the terminal alphabet T with type p(Ai) x • • • x p(Am) – p(A), called the composition operation associated with p. The rank of G and the fanout of G are defined as the maximal rank and fanout of the composition operations of G, and are denoted by p(G) and p(G).",
        "The sets of derivation trees of G are the smallest indexed family of sets Da, A G N, such that, if",
        "N = {S,R} , T = {a,b,c,d}, P = {pi = S – fi(R), P2 = R – f2(R), ps = R – fa } , where: fi((xi)i,xi)2)) = (xi,i xi^), f2((xi,i,xi,2)) = (axi,i b,cxi,2 d), f3 = .",
        "is a production of G and ti G Da4 for all i G [m], then t = p(ti,..., tm) G Da.",
        "By interpreting productions as their associated composition operations in the obvious way, a derivation tree t G Da evaluates to a p(A)-tuple of strings over T; we denote this tuple by val(t).",
        "The string language generated by G, denoted by L(G), is then defined as",
        "L(G) = { w G T* | t G Ds, (w) = val(t) } .",
        "Two LCFRS are called weakly equivalent, if they generate the same string language.",
        "Example Figure 1 shows a sample LCFRS G with p(G) = 1 and p(G) = 2.",
        "The sets of its derivation trees are Dr = {pn(p3 ) | n > 0} and DS = {pi(t) | t G Dr }.",
        "The string language generated by G is { ara6racradra | n > 0 }.",
        "In the remainder of this paper, we use the following convenient syntax for tuples of strings.",
        "Instead of using the $-symbol to mark the component boundaries.",
        "We call this the characteristic string of the tuple, and an occurrence of the symbol $ a gap marker.",
        "We also use this notation for composition operations.",
        "For example, the characteristic string of the operation is axi)i x2;i $ xi;2 b.",
        "If we assume the variables on the left-hand side of an equation to be named according to the schema used in Section 2.1, then the characteristic string of a composition operation determines that operation completely.",
        "We will therefore freely identify the two, and write productions as where the string inside the brackets is the characteristic string of some composition operation.",
        "The substrings vi,..., vk are called the components of the characteristic string.",
        "Note that the characteristic string of a composition operation with type ki x • • • x km – k is a sequence of terminal symbols, gap markers, and variables from the set { xi;j | i G [m], j G [ki] } in which the number of gap markers is k – 1, and each variable occurs exactly once.",
        "When in the context of such a composition operation we refer to 'a variable of the form xi;j ', then it will always be the case that i G [m] and j G [ki].",
        "The identification of composition operations and their characteristic strings allows us to construct new operations by string manipulations: if, for example, we delete some variables from a characteristic string, then the resulting string still defines a composition operation (after a suitable renaming of the remaining variables, which we leave implicit).",
        "To simplify our presentation, we will assume that LCFRS are given in a certain canonical form.",
        "Intuitively, this canonical form requires the variables in the characteristic string of a composition operation to be ordered in a certain way.",
        "Formally, the defining equation of a composition operation f with type k i x • • • x km ^ k is called canonical, if (i) the sequence obtained from f by reading variables of the form xi;i from left to right has the form xi)i • • • xm i; and (ii) for each i G [m], the sequence obtained from f by reading variables of the form xiJ from left to right has the form xi)i • • • xi;ki.",
        "An LCFRS is called canonical, if each of its composition operations is canonical.",
        "We omit the proof that every LCFRS can be transformed into a weakly equivalent canonical LCFRS.",
        "However, we point out that both the normal form and the parsing algorithm that we present in this paper can be applied also to general LCFRS.",
        "This is in contrast to some left-to-right parsers in the literature on LCFRS and equivalent formalisms (de la Clergerie, 2002; Kallmeyer and Maier, 2009), which actually depend on productions in canonical form.",
        "We now characterize the class of well-nested LCFRS that are the focus of this paper.",
        "Well-nestedness was first studied in the context of dependency grammars (Kuhlmann and Möhl, 2007).",
        "Kanazawa (2009) defines well-nested multiple context-free grammars, which are weakly equivalent to well-nested LCFRS.",
        "A composition operation is called well-nested, if it does not contain a substring of the form",
        "xi,il ^ ^ ^ xj,ji ^ ^ ^ xi,i2 ^ ^ ^ xj,j2 , where i = j .",
        "For example, the operation xi;i x2;i $x2;2 xi;2 is well-nested, while xi;i x2 i $ xi 2 x2 2 is not.",
        "An LCFRS is called well-nested, if it contains only well-nested composition operations.",
        "The class of languages generated by well-nested LCFRS is properly included in the class of languages generated by general LCFRS; see Kanazawa and Salvati (2010) for further discussion."
      ]
    },
    {
      "heading": "3. Parsing LCFRS",
      "text": [
        "We now discuss the parsing complexity of LCFRS, and motivate our interest in a normal form for wellnested LCFRS.",
        "A bottom-up, chart-based parsing algorithm for the class of (not necessarily well-nested) LCFRS can be defined by using the formalism of parsing schemata (Sikkel, 1997).",
        "The parsing schemata approach considers parsing as a deduction process (as in Shieber et al.",
        "(1995)), generating intermediate results called items.",
        "Starting with an initial set of items obtained from each input sentence, a parsing schema defines a set of deduction steps that can be used to infer new items from existing ones.",
        "Each item contains information about the sentence's structure, and a successful parsing process will produce at least one final item containing a full parse for the input.",
        "The item set used by our bottom-up algorithm to parse an input string w = ai • • • an with an LCFRS G = (N, T, P, S) will be val(t) = a^1+i • • • ari $ • • • $ +i • • • arfc.",
        "The set of final items is thus f = {[S, (0, n)]}, containing full derivation trees that evaluate to w.",
        "For simplicity of definition of the sets of initial items and deduction steps, let us assume that productions of rank > 0 in our grammar do not contain terminal symbols in their right-hand sides.",
        "This can be easily achieved from a starting grammar by creating a nonterminal Aa for each terminal a g T, a corresponding rank-0 production pa = Aa – [a](), and then changing each occurrence of a in the characteristic string of a production to the single variable associated with the fanout 1 nonterminal Aa.",
        "With this, our initial item set for a string ai • • • an will be and each production p = Ao – f (Ai,..., Am) of G (excluding the ones we created for the terminals) will produce a deduction step of the form given in Figure 2a, where the indexes are subject to the following constraints, imposed by the semantics of f.",
        "1.",
        "Ifthe kth component ofthe characteristic string of f starts with xi)j-, then 10;k = .",
        "2.",
        "Ifthe kth component ofthe characteristic string of f ends with xi)j-, then r0;k = ri)j-.",
        "3.",
        "If xi,j,j* is an infix of the characteristic string of f, then ri)j = .",
        "4.",
        "Ifthe kth component ofthe characteristic string of f is the empty string, then 10 k = r0;k.",
        "The time complexity of parsing LCFRS with respect to the length of the input can be analyzed by counting the maximum number of indexes that can appear in an instance of the inference rule above.",
        "Although the total number of indexes is i=0 2 • p(Ai ), some of these indexes are equated by the constraints.",
        "To count the number of independent indexes, consider all the indexes of the form 10 i (corresponding to the left endpoints of each component of the characteristic string of f ) and those of the form rj k for j > 0 (corresponding to the right endpoints of each variable in the characteristic string).",
        "By the constraints above, these indexes are mutually independent, and it is easy to check that any other index is equated to one of these: indexes r0;i are equated to the index rj;kcorresponding to the last variable xj;k of the ith component of the characteristic string, or to 10;i if there is no such variable; while indexes 1j;k with j > 0 are equated to an index 10 i if the variable xj k is at the beginning of a component of the characteristic string, or to an index rj/k/ ( j' > 1) if the variable xjkfollows another variable xj/;k/.",
        "(a) The general rule for a parsing schema for LCFRS",
        "Thus, the parsing complexity (Gildea, 2010) of a production p = A0 – f (A1,..., Am) is determined by p(A0) i-indexes and ie[m] p(Ai) r-indexes, for a total complexity of where | w| is the length of the input string.",
        "The parsing complexity of an LCFRS will correspond to the maximum parsing complexity among its productions.",
        "Note that this general complexity matches the result given by Seki et al.",
        "(1991).",
        "In an LCFRS of rank p and fanout p, the maximum possible parsing complexity is O(|w|^(p+1)), obtained by applying the above expression to a production of rank p and where each nonterminal has fanout p. The asymptotic time complexity of LCFRS parsing is therefore exponential both in its rank and its fan-out.",
        "This means that it is interesting to transform LCFRS into equivalent forms that reduce their rank while preserving the fan-out.",
        "For sets of LCFRS that can be transformed into a binary form (i.e., such that all its rules have rank at most 2), the p factor in the complexity is reduced to a constant, and complexity is improved to O(|w|^) (see Gomez-Rodriguez et al.",
        "(2009) for further discussion).",
        "Unfortunately, it is known by previous results (Rambow and Satta, 1999) that it is not always possible to convert an LCFRS into such a binary form without increasing the fan-out.",
        "However, we will show that it is always possible to build such a binarization for well-nested LCFRS.",
        "Combining this result with the inference rule and complexity analysis given above, we would obtain a parser for well-nested LCFRS running in",
        "O(|w|^) time.",
        "But the construction of our binary normal form additionally restricts binary composition operations in the binarized LCFRS to be of two specific forms, concatenation and wrapping, which further improves the parsing complexity to O(|w|^+), as we will see below.",
        "A composition operation is called a concatenation operation, if its characteristic string has the form where m, n > 1.",
        "Intuitively, such an operation corresponds to the bottom-up combination of two adjacent discontinuous constituents into one.",
        "An example of a concatenation operation is the binary parsing rule used by the standard CKY parser for context-free grammars, which combines continuous constituents (represented as 1-tuples of strings in the LCFRS notation).",
        "In the general case, a concatenation operation will take an m-tuple and an n-tuple and return an (m + n – 1)-tuple, as the joined constituents may have gaps that will also appear in the resulting tuple.",
        "If we apply the general parsing rule given in Figure 2a to a production A – conc(B, C), where conc is a concatenation operation, then we obtain the deduction step given in Figure 2b.",
        "This step uses 2m different i-and r-indexes, and 2n – 1 different i'-and r'-indexes (excluding i' which must equal rm), for a total of 2m+2n – 1 = 2(m+n – + 1 indexes.",
        "Since m + n – 1 is the fanout of the nonterminal A, we conclude that the maximum number of indexes in the step associated with a concatenation operation in an LCFRS of fanout p is 2p + 1.",
        "before: p after: p",
        "A linear, non-erasing function is called a wrapping operation, if its characteristic string has the form where m, n > l and i G [m – lj.",
        "Intuitively, such an operation wraps the tuple derived from a nonterminal B around the tuple derived from a nonterminal C, filling the ith gap in the former.",
        "An example of a wrapping operation is the adjunction of an auxiliary tree in tree-adjoining grammar.",
        "In the general case, a wrapping operation will take an m-tuple and an n-tu-ple and return an (m + n – 2)-tuple of strings: the gaps of the argument tuples appear in the obtained tuple, except for one gap in the tuple derived from B which is filled by the tuple derived from C.",
        "By applying the general parsing rule in Figure 2a to a production A – wrapi(B, C), where wrap^ is a wrapping operation, then we obtain the deduction step given in Figure 2c.",
        "This step uses 2m different land r-indexes, and 2n – 2 different l'- and r'-indexes (discounting l' and r'n which are equal to other indexes), for a total of 2m + 2n – 2 = 2(m+n – 2)+2 indexes.",
        "Since the fanout of A is m + n – 2, this means that a wrapping operation needs at most 2p+2 indexes for an LCFRS of fanout p.",
        "From this, we conclude that an LCFRS of fanout p in which all composition operations are either concatenation operations, wrapping operations, or operations of rank 0 or l, can be parsed in time ö(|w|^+2).",
        "In particular, nullary and unary composition operations do not affect this worst-case complexity, since their associated deduction steps can never have more than 2p indexes."
      ]
    },
    {
      "heading": "4. Transformation",
      "text": [
        "We now show how to transform a well-nested LCFRS into the normal form that we have just described.",
        "Consider a production p = A – f (A1,..., Am), where m > 2 and f is neither a concatenation nor a wrapping operation.",
        "We will construct new productions p',q,r such that every derivation that uses p can be rewritten into a derivation that uses the new productions, and the new productions do not license any other derivations.",
        "Formally, this can be understood as implementing a tree transformation, where the input trees are derivations of the original grammar, and the output trees are derivations of the new grammar.",
        "The situation is illustrated in Figure 3.",
        "The tree on top represents a derivation in the original grammar; this derivation starts with the rewriting of the nonterminal A using the production p, and continues with the subderivations t1,..., tm.",
        "The tree at the bottom represents a derivation in the transformed grammar.",
        "This derivation starts with the rewriting of A using the new production p', and continues with two independent subderivations that start with the new productions q and r, respectively.",
        "The sub-derivations t1}... ,tmhave been partitioned into two sequences t1,1, .",
        ".",
        ".",
        ", t1,mi and ^2,1 ,...,t2,m2 .",
        "The new production p' will be either a concatenation or a wrapping operation, and the rank of both q and r will be strictly smaller than the rank of p. The transformation will continue with q and r, unless these have rank one.",
        "By applying this strategy exhaustively, we will thus eventually end up with a grammar that only has productions with rank at most 2, and in which all productions with rank 2 are either concatenation or wrapping operations.",
        "To transform the production p, we first factorize the composition operation f associated with p into three new composition operations f ', g, h as follows.",
        "Recall that we represent composition operations by their characteristic strings.",
        "In the following, we will assume that no characteristic string starts or ends with a gap marker, or contains immediate repetitions of gap markers.",
        "This property can be ensured, without affecting the asymptotic complexity, by adding intermediate steps to the transformation that we report here; we omit the details due to space reasons.",
        "When this property holds, we are left with the following two cases.",
        "Let us call a sequence of variables joint, if it contains all and only variables associated with a given nonterminal.",
        "Case1 f = X1 f X2 ••• xfc_1 ffc_1 xfc f *, where k > l, X1,..., Xk are joint variables, and the suffix f * contains at least one variable.",
        "Let let h = f *, and let f ' = conc.",
        "As f is well-nested, both g and h define well-nested composition operations.",
        "By the specific segmentation of f, the ranks of these operations are strictly smaller than the rank of f. Furthermore, we have p(f ) = p(g) + p(h) – l.",
        "Case 2 f = X1 f1 X2 ••• Xfc_1 ffc_1 Xfc , where k > 2, x1 ,..., Xk are joint variables, and there exist at least one i such that the sequence f j contains at least one variable.",
        "Choose an index j as follows: if there is at least one i such that f contains at least one variable and one gap marker, let j be the minimal such i; otherwise, let j be the minimal i such that f contains at least one variable.",
        "Now, let let h = fj, and let f ' = wrapj.",
        "As in Case 1, both g and h define well-nested composition operations whose ranks are strictly smaller than the rank of f. Furthermore, we have p(f) = p(g) + p(h) – 2 .",
        "Note that at most one of the two cases can apply to f. Furthermore, since f is well-nested, it is also true that at least one of the two cases applies.",
        "This is so because for two distinct nonterminals Ai, Aj/, either all variables associated with Ai/ precede the leftmost variable associated with Ai, succeed the rightmost variable associated with Ai, or are placed between two variables associated with Ai without another variable associated with Ai intervening.",
        "(Here, we have left out the symmetric cases.)",
        "Based on the composition operations, we now construct three new productions p', q, r as follows.",
        "Let B and C be two fresh nonterminals with p(B) = p(g) and p(C) = p(h), and let p' = A – f'(B, C).",
        "The production p' rewrites A into B and C and combines the two subderivations that originate at these nonterminals using either a concatenation or a wrapping operation.",
        "Now, let Aq1,..., Aqmq and Ar1,..., Ar mr be the sequences of nonterminals that are obtained from the sequence A1 , .",
        ".",
        ".",
        ", Am by deleting those nonterminals that are not associated with any variable in g or h, respectively.",
        "Then, let r = C – h( Ar,1, .",
        ".",
        ".",
        ", Ar,mr ) .",
        "We now illustrate the transformation using the concrete production p = A – f (A1, A2, A3), where f = X1,1 X2,1 $ X1,2 $ X3,1 .",
        "Note that this operation has rank 3 and fanout 3.",
        "The composition operations are constructed as follows.",
        "The operation f matches the pattern of Case 1, and hence induces the operations g1 = X1,1 X2,1 $ X1,2 , h1 =$ X3,1, f1 = conc.",
        "The productions constructed from these are p'1 = A – conc(B1, C1) , q1 = B1 – g1(A1,A2), r1 = C1 – h1(A3).",
        "where B1 and C1 are fresh nonterminals with fanout 2.",
        "The production r1 has rank one, so it does not require any further transformations.",
        "The transformation thus continues with q1 .",
        "The operation g1 matches the pattern of Case 2, and induces the operations where B2 and C2 are fresh nonterminals with fanout 2.",
        "At this point, the transformation terminates.",
        "We can now delete p from the original grammar, and replace it with the productions {p1, r 1, p'2, q2, r2 }.",
        "To see that the transformation is correct, we need to verify that each production of the original grammar is transformed into a set of equivalent normal-form productions, and that the fanout of the new grammar does not exceed the fanout of the old grammar.",
        "For the first point, we note that the transformation preserves well-nestedness, decreases the rank of a production, and is always applicable as long as the rank of a production is at most 2 and the production does not use a concatenation or wrapping operation.",
        "That the new productions are equivalent to the old ones in the sense of Figure 3 can be proved by induction on the length of a derivation in the original and the new grammar, respectively.",
        "Let us now convince ourselves that the fanout of the new grammar does not exceed the fanout of the old grammar.",
        "This is clear in Case 1, where",
        "p(f) = ¥>(S)+ p(h) 1 implies that both p(g) < p(f) and p(h) < p(f).",
        "For Case 2, we reason as follows.",
        "The fanout of the operation h, being constructed from an infix of the characteristic string of the original operation f, is clearly bounded by the fanout of f. For g, we have",
        "P(g) = P(f) - p(h) + 2, Now suppose that the index j was chosen according to the first alternative.",
        "In this case, p(h) > 2, and p(g) < p(f) - 2 + 2 = p(f).",
        "For the case where j was chosen according to the second alternative, p(f ) < k (since there are no immediate repetitions of gap markers), p(h) = 1, and p(g) < k. If we assume that each nonterminal is productive, then this means that the underlying LCFRS has at least one production with fanout k or more; therefore, the fanout of g does not increase the fanout of the original grammar.",
        "To conclude, we now briefly discuss the space complexity of the normal-form transformation.",
        "We measure it in terms of the length of a production, defined as the length of its string representation, that is, the string A – [vi $ • • • $ vk](Ai,..., Am).",
        "Looking at Figure 3, we note that the normal-form transformation of a production p can be understood as the construction of a (not necessarily complete) binary-branching tree whose leaves correspond to the productions obtained by splitting the characteristic string of p and whose non-leaf nodes are labeled with concatenation and wrapping operations.",
        "By construction, the sum of the lengths of leaf-node productions is O(|p|).",
        "Since the number of inner nodes of a binary tree with n leaves is bounded by n – 1, we know that the tree has O(p(p)) inner nodes.",
        "As these nodes correspond to concatenation and wrapping operations, each inner-node production has length O(p(p) ).",
        "Thus, the sum of the lengths of the productions created from |p| is O(|p| + p(p)p(p)).",
        "Since the rank of a production is always smaller than its length, this is reduced to O(|p|p(p)).",
        "Therefore, the size of the normal-form transformation of an LCFRS G of fanout p is O(p|G|) in the worst case, and linear space in practice, since the fanout is typically bounded by a small integer.",
        "Taking the normal-form transformation into account, our parser therefore runs in time O(p • | G| • |w|^+2) where | G| is the original grammar size."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "In this paper, we have presented an efficient parsing algorithm for well-nested linear context-free rewriting systems, based on a new normal form for this formalism.",
        "The normal form takes up linear space with respect to grammar size, and the algorithm is based on a bottom-up process that can be applied to any LCFRS, achieving O(p • |G| • |w|^+) time complexity when applied to LCFRS of fanout p in our normal form.",
        "This complexity is an asymptotic improvement over existing results for this class, both from parsers specifically geared to well-nested LCFRS or equivalent formalisms (Hotz and Pitsch, 1996) and from applying general LCFRS parsing techniques to the well-nested case (Seki et al., 1991).",
        "The class of well-nested LCFRS is an interesting syntactic formalism for languages with discontinuous constituents, providing a good balance between coverage of linguistic phenomena in natural language treebanks (Kuhlmann and Nivre, 2006; Maier and Lichte, 2009) and desirable formal properties (Kanazawa, 2009).",
        "Our results offer a further argument in support of well-nested LCFRS: while the complexity of parsing general LCFRS depends on two dimensions (rank and fan-out), this bidimen-sional hierarchy collapses into a single dimension in the well-nested case, where complexity is only conditioned by the fan-out.",
        "Acknowledgments Gomez-Rodriguez has been supported by MEC/FEDER (HUM2007-66607-C04) and Xunta de Galicia (PGIDIT07SIN005206PR, Redes Galegas de PL e RI e de Ling.",
        "de Corpus, Bolsas Estadfas INCITE/FSE cofinanced).",
        "Kuhlmann has been supported by the Swedish Research Council."
      ]
    }
  ]
}
