{
  "info": {
    "authors": [
      "Andreas Vlachos"
    ],
    "book": "Proceedings of the 2010 Workshop on Biomedical Natural Language Processing",
    "id": "acl-W10-1901",
    "title": "Two Strong Baselines for the BioNLP 2009 Event Extraction Task",
    "url": "https://aclweb.org/anthology/W10-1901",
    "year": 2010
  },
  "references": [
    "acl-J04-4004",
    "acl-P06-4020",
    "acl-P08-1006",
    "acl-P08-2026",
    "acl-W06-3312",
    "acl-W08-1301",
    "acl-W08-2121",
    "acl-W09-1401",
    "acl-W09-1402",
    "acl-W09-1403",
    "acl-W09-1405",
    "acl-W09-1406",
    "acl-W09-1418"
  ],
  "sections": [
    {
      "text": [
        "Two strong baselines for the BioNLP 2009 event extraction task",
        "This paper presents two strong baselines for the BioNLP 2009 shared task on event extraction.",
        "First we reimplement a rule-based approach which allows us to explore the task and the effect of domain-adapted parsing on it.",
        "We then replace the rule-based component with support vector machine classifiers and achieve performance near the state-of-the-art without using any external resources.",
        "The good performances achieved and the relative simplicity of both approaches make them reproducible baselines.",
        "We conclude with suggestions for future work with respect to the task representation."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The term biomedical event extraction is used to refer to tasks whose aim is the extraction of information beyond the entity level.",
        "It commonly involves recognizing actions and relations between one or more entities.",
        "The recent BioNLP 2009 shared task on event extraction (Kim et al., 2009) focused on a number of relations of varying complexity in which an event consisted of a trigger and one or more arguments.",
        "It attracted 24 submissions and provided a basis for system development.",
        "The performances ranged from 16% to 52% in F-score.",
        "In this paper we describe two strong baseline approaches for the main task (described in Sec. 2) with a focus on annotation costs and reproducibility.",
        "Both approaches rely on a dictionary of lemmas associated with event types (Sec.",
        "3).",
        "First we reimplement the rule-based approach of Vlachos et al.",
        "(2009) using resources provided in the shared task.",
        "While it is unlikely to reach the performance of approaches combining supervised machine learning, exploring its potential can highlight what annotated data is useful and its potential contribution to performance.",
        "Also, given its reliance on syntax, it allows us to assess the importance of syntactic parsing.",
        "Nevertheless, the performance achieved (35.39% F-score) is competitive with systems that used more annotated data and/or other resources (Sec.",
        "5).",
        "Building on the error analysis of the rule-based approach, we replace the rule-based component with support vector machine (SVM) classifiers trained on partial event annotation in the form of trigger-argument associations (Sec.",
        "6).",
        "The use of a trainable classifier highlights issues concerning the suitability of the annotated data as training material.",
        "Using a simple feature representation and no external resources, the performance rises to 47.89% in F-score, which would have been second best in the shared task (Sec.",
        "7).",
        "The error analysis suggests that future work on event extraction should look into different task representations which will allow more advanced models to demonstrate their potential (Sec.",
        "8).",
        "Both systems shall become publically available."
      ]
    },
    {
      "heading": "2. Definition, datasets and resources",
      "text": [
        "The BioNLP 2009 shared task focused on extraction of events involving proteins.",
        "Protein recognition was considered a given in order to focus the research efforts on the novel aspects of the task.",
        "Nine event types were defined in the main task, which can be broadly classified in two classes.",
        "Simple events, namely Gene_expression, Transcription, Protein_catabolism, Phosphorylation, Localization and Binding, which have proteins as their Theme argument and Regulation events, namely Positive_regulation, Negative_regulation and (unspecified) Regulation which have an obligatory Theme argument and an optional Cause argument which can be either a protein or another event.",
        "Every event has a trigger which is a contiguous textual string that can span over one or more tokens, as well as a part of a token.",
        "Triggers and arguments can be shared across events and the same textual string can be a trigger for events of different types.",
        "In an example demonstrating the complexity of the task: \"... SQ 22536 suppressed gp41-induced IL-10 production in monocytes.\"",
        "Participating systems, given the two proteins (in bold), need to generate the three appropriately nested events of Table 1.",
        "While event components can reside in different sentences, we focus on events that are contained in a single sentence.",
        "Participants were not provided with resources to develop anaphora resolution components and the anaphoric phenomena involved were rather complex, as we observed in Vlachos et al.",
        "(2009).",
        "Extraction of events involving anaphoric relations inside a single sentence is still possible but it is likely to require rather complex patterns to be extracted.",
        "The shared task involved three datasets, training, development and test, which consisted of 800, 150 and 260 abstracts respectively taken from the GENIA event corpus.",
        "Their annotation was tailored to the shared task definition.",
        "A resource made available and used by the majority of the systems was the output of four syntactic parsers:",
        "• Bikel's (2004) reimplementation of Collins' parsing model.",
        "This parser was trained on newswire data exclusively.",
        "• The re-ranking parser of Charniak & Johnson adapted to the biomedical domain (McClosky and Charniak, 2008).",
        "The in-domain, part-of-speech (PoS) tagger was trained on the GENIA corpus (Kim et al., 2003) and the self-training of the re-ranking module used a part of the GE-NIA treebank as development data.",
        "• The C&C Combinatory Categorial Grammar (CCG) parser adapted to the biomedical domain (Rimell and Clark, 2009).",
        "The PoS tagger was trained on the GENIA corpus, while 1,000 sentences were annotated with lexical categories and added to the training data of the CCG supertagger and 600 sentences of the Biolnfer corpus (Pyysalo et al., 2007) were used for parameter tuning.",
        "• The GDep dependency parser trained for the biomedical domain in the experiments of Miyao et al.",
        "(2008).",
        "This parser was trained for the biomedical domain using the GENIA treebank.",
        "The native Penn TreeBank output of Bikel's and McClosky's parser was converted to the Stanford Dependency (SD) collapsed dependency format (de Marneffe and Manning, 2008).",
        "The output of the CCG parser was also converted to the same dependency format, while the output of GDep was provided in a different dependency format used for the dependency parsing CoNLL 2007 shared task.",
        "From the description above, it is clear that the various parsers have different levels of adaptation to the biomedical domain.",
        "While it is difficult to assess quantitatively the actual annotation effort involved, it is possible to make some comparisons.",
        "Bikel's parser was not adapted to the domain, therefore it would be the cheapest one to deploy.",
        "McClosky and CCG used in-domain corpora annotated with PoS tags for training, while the latter using some additional annotation for lexical categories.",
        "Furthermore, they were tuned using in-domain syntactic treebanks.",
        "Therefore, they represent a more expensive option in terms of annotation cost.",
        "Finally, GDep was trained using an in-domain treebanked corpus, thus representing the alternative with the highest annotation cost."
      ]
    },
    {
      "heading": "3. Trigger extraction",
      "text": [
        "We perform trigger identification using a dictionary of lemmas associated with the event type they indicate.",
        "The underlying assumption is that a particular lemma has the same semantic content in every occurrence, which results in extracting all of its occurrences as triggers of the same event type.",
        "This is clearly an over-simplification, but the restricted domain and the task definition alleviates most of the problems caused.",
        "For each lemma in the dictionary, we extract all its occurrences in the text as triggers, therefore over-generating, since not all occurrences denote a biomedical event.",
        "This can be either because they are not connected with appropriate arguments or because they are used with a sense irrelevant to the task.",
        "Both issues are being resolved at the argument identification stage since superfluous triggers should not receive arguments and not form events.",
        "The one-sense-per-term assumption is further challenged by the fact that occurrences of the same term can denote events of different types.",
        "For example, \"expression\" is used as a trigger of four different event types in the training data, namely Gene_expression, Transcription, Localization and Positive_regulation.",
        "While it can be argued that in some cases this is due to annotation inconsistencies, it is generally accepted that context can alter the semantics of a token.",
        "In order to ameliorate this problem, we define the concept of light triggers in analogy analogy to light verbs.",
        "The latter are verbs whose semantics are lost when occurring in particular constructions, e.g. \"make\" as in \"make mistakes\".",
        "In the shared task, some lemmas commonly associated with a particular event type, when modified by a term associated with a different event type, denote events of the type of their modifier instead of their own.",
        "For example, \"regulation\" generally denotes Regulation events, unless it has a modifier of a different event type, e.g. \"positive\".",
        "In these cases, \"regulation\" becomes part of a multi-token Positive_regulation trigger (e.g. \"positive regulation\").",
        "However, if the actual tokens are not adjacent, only \"regulation\" is annotated as a Positive_regulation trigger, which is due to the requirement that triggers are contiguous textual strings.",
        "We refer to lemmas exhibiting this behaviour as light triggers.",
        "Additionally, we observe that some lemmas triggered events only when modified by another lemma associated with an event type.",
        "For example, \"activity\" when occurring without a modifier is not considered a trigger of any event, however, when modified by \"binding\" then it becomes a Binding event trigger.",
        "We refer to lemmas exhibiting this behaviour as ultralight triggers.",
        "ID",
        "type",
        "trigger",
        "Theme",
        "Cause",
        "E1",
        "Neg_reg",
        "suppressed",
        "E2",
        "E2",
        "Pos_reg",
        "induced",
        "E3",
        "gp41",
        "E3",
        "Gene_exp",
        "production",
        "IL-10",
        "In order to construct the dictionary of terms with their associated event types we use the trigger annotation from the training data, but we argue that such information could be obtained from domain experts.",
        "First, we remove the triggers encountered only once in the data in order to avoid processing non-indicative triggers.",
        "Then, we lem-matize them with morpha (Minnen et al., 2001).",
        "We remove prepositions and other stopwords from multi-token triggers such as \"in response to\" and \"have a prominent increase\" in order to keep only the terms denoting the event type.",
        "Then, using the single-token triggers only, we associate each lemma with its most common event type.",
        "In cases where a lemma consistently generates more that one event trigger of different types (typically one of the Simple event class and one of the Regulation class, we associate the lemma with all the relevant event types.",
        "For example, \"overexpress\" consistently denotes Gene_expression and Positive_regulation events.",
        "The last token of each multi-token trigger becomes a light trigger.",
        "Finally, if a lemma is encountered as part of a multitoken trigger of a different event type more often than with the event type associated with it as a single-token trigger, then it becomes an ultralight trigger.",
        "We avoid stemming because suffixes distinguish lemmas in an important way with respect to the task.",
        "For example, \"activation\" denotes Positive_regulation events, while \"activity\" is an ultralight trigger.",
        "We only keep lemmas associated at least four times with a particular event type, since below that threshold the annotation was rather inconsistent.",
        "During testing, we attempt to match each token with one of the lemmas associated with an event type.",
        "We perform this by relaxing the matching successively, using the token lemma first and if no match is found allowing a partial match in order to deal with particles (e.g. so that \"co-express\" matches \"express\").",
        "This process returns single-token triggers, some of which are processed further in case they are light or ultralight using syntactic dependencies in the following stage."
      ]
    },
    {
      "heading": "4. Rule-based argument identification",
      "text": [
        "In this stage, we connect the triggers extracted with appropriate arguments using rules defined with the Stanford dependency (SD) scheme (de Marneffe and Manning, 2008).",
        "We reimplement the set of rules of Vlachos et al.",
        "(2009) using the syntactic parsing resources provided by the organizers for the development data.",
        "Rule-based systems need annotated data for tuning, but unlike their supervised machine learning-based counterparts they do not learn parameters from it, thus requiring less annotated data.",
        "We consider this to be the main advantage of rule-based systems and to demonstrate this point we explicitly avoid using the training data provided.",
        "The rules define syntactic dependency paths that connect tokens containing triggers (trigger-tokens) with tokens containing their arguments (arg-tokens).",
        "For multi-token protein names, it is sufficient that a path reaches any of its tokens.",
        "For Regulation event class triggers we consider as arg-tokens not only tokens containing (parts of) protein names but also the trigger-tokens found in the same sentence.",
        "The rules defined are the following:",
        "• If a trigger-token is the governor of an arg-token in subject relation (subj), then the latter is identified as the Theme argument of the former, e.g. \"Stat1 expresses\".",
        "The only exception to this rule is that when the trigger denotes Regulation class events and the nominal subject relation (nsubj) is observed, the arg-token is identified as a Cause argument, e.g. \"gp41 induces\".",
        "• If a trigger-token is the governor of an arg-token in a prepositional relation, then the latter is identified as the Theme argument of the former, e.g. \"expression of Stat1\".",
        "• If a trigger-token is the governor of an arg-token in modifier relation then the latter is identified as the Theme argument of the former, e.g. \"Stat1 expression\".",
        "We restrict the definition of the modifier relation to subsume only the following relations: adjectival modifier (amod), infinitival modifier (infmod), participial modifier (partmod), adverbial modifier (advmod), relative clause modifier (rc-mod), quantifier modifier (quantmod), temporal modifier (tmod) and noun compound modifier (nn) relations.",
        "This restriction is placed in order to avoid matches irrelevant to the task.",
        "• If a trigger-token is the governor of an arg-token in object relation (obj) then the latter is identified as the Theme argument, e.g. \"SQ 22536 suppressed gp41\".",
        "• If a Regulation event class trigger and a protein name are found in the same token, then the protein name is identified as the Cause argument, e.g. \"gp41 -induced\".",
        "A preprocessing step taken was to propagate modifier and prepositional relations over tokens that were coordinated or in an appositive relation.",
        "This was necessary since the SD output provided by the organizers is in the collapsed format, which treats coordinated tokens asymmetrically without propagating their dependencies.",
        "For each Simple or Binding trigger-argument pair, we generate a single event with the argument marked as Theme.",
        "This approach is expected to deal adequately with all event types except for Binding, which can have multiple themes.",
        "We generate Regulation events for trigger-argument pairs whose argument is a protein name or a trigger that has an already formed event.",
        "Since Regulation events can have other Regulation events as Themes or Causes, we repeat this process until no more events can be formed.",
        "Finally, at this stage we generate the required Regulation class event for triggers that consistently denote two events."
      ]
    },
    {
      "heading": "5. Rule-based system results",
      "text": [
        "We report our results using the approximate span matching/approximate recursive matching variant of the evaluation.",
        "This variant allows for an event to be considered extracted correctly if its trigger is extracted with span within an one-token extension of the correct trigger span.",
        "Also in the case of nested events, events below the top-level need only their Theme argument to be correctly identified so that the top-level event is considered correct.",
        "This evaluation variant was used as the primary performance criterion in the shared task.",
        "We first compared the performances obtained using the output of the different parsers provided by the organizers on the development data.",
        "The best F-score was achieved using McClosky (36.97%).",
        "As expected, the overall performance correlates roughly with the adaptation cost involved in the development of these parsers as described in Section 2.",
        "Bikel, which is essentially unadapted, has the worst performance overall, but it would have been the cheapest to deploy.",
        "While this can be viewed as a task-based parser comparison, similar to the experiments of Miyao et al.",
        "(2008), one should be careful with the interpretation of the results.",
        "As pointed out by the authors, this type of evaluation cannot substitute a parsing evaluation against an appropriately annotated corpus since in the context of a given task only some aspects of parsing are likely to be relevant.",
        "Furthermore, in our experiments we are are not using the native output of the parsers but its conversion to the SD format.",
        "Therefore unavoidably we evaluate the conversion as well as the parsing.",
        "For this reason we avoided using the output of GDep which was not provided in this format.",
        "Examining the lists of false positives and false negatives on the system using the McClosky parser, we observe that the most common triggers of events not extracted correctly had lemmas that were included in the dictionary, such as \"binding\", \"expression\", \"induction\" and \"activation\".",
        "This suggests that most event extraction errors are due to argument identification and that using a dictionary for trigger extraction is sufficient, despite the rather strong assumptions it is based upon.",
        "Disabling the processing of light and ultralight triggers, the performance on the development data drops to 39.28%, the main reason being the decreased recall in Binding events.",
        "Based on the comparison performed on the development data, we run our system using the Mc-Closky parser on the test data (Table 2).",
        "The overall performance achieved (35.39%) is relatively close to the one obtained on the development set (4% lower).",
        "This is important since rule-based systems are prone to overfitting their development data due to the way they are built.",
        "Compared to the performances achieved by the shared task participants, the system presented would be ranked seventh in overall performance.",
        "We believe this is a strong result, since it surpasses systems that used supervised machine learning methods taking advantage of the development and the training data.",
        "Restricting the comparison to rule-based systems, it would have the second best performance out of nine such systems, most of which used external knowledge sources in order to improve their performance.",
        "The best rule-based system (Kil-icoglu and Bergler, 2009) had overall performance of 44.62% in F-score, ranking third overall.",
        "The main difference is that it used a much larger set of lexicalized rules (27) which were extracted using the training data.",
        "Also, heuristics were employed in order to correct syntactic parsing errors (Schuman and Bergler, 2006).",
        "While the benefits from these additional processing steps are indisputable, they involved a lot of manual work, both for rule construction as well as for the annotation of the data used to extract the rules.",
        "We argue that these performance benefits could be obtained using machine learning methods aimed at ameliorating the argument identification stage.",
        "Compared to the rule-based approach of Vlachos et al.",
        "(2009), the performance is improved substantially.",
        "The main difference between that system and the one presented here is that the former uses the domain-independent RASP parser (Briscoe et al., 2006).",
        "While its performance was reasonable (it was ranked 10th overall, 30.80% F-score), these results lag behind those reported here.",
        "Note that a direct comparison using the output of RASP is not possible since the latter uses its own syntactic dependency scheme and there is no lossless conversion to the SD scheme.",
        "Overall, the results of this section demonstrate that the use of domain-adapted parsing is beneficial to event extraction.",
        "This is not surprising since the system presented depends heavily on the parsing output.",
        "We argue that the annotation cost of this adaptation is a good investment because, unlike the task-specific training data, improved syntactic parsing is likely to be useful for other event extraction tasks, or even other IE tasks, e.g. anaphora resolution.",
        "Therefore, we suggest that domain-adaptation of syntactic parsing should be considered first, especially in tasks that are heavily dependent on it.",
        "6 Improving argument identification with partial annotation and support vector machines",
        "In this section, we present an approach to argument identification which attempts to overcome the drawbacks of the rule-based approach.",
        "Following the trigger extraction stage, for each trigger combined with each of its candidate arguments we create a classification instance.",
        "The classification task is to assign the correct argument type to the instance.",
        "Therefore, we construct a binary classifier which determines whether a protein name is the Theme argument of a Simple or a Binding trigger (ThemePositive or ThemeNegative) and a ternary classifier which determines whether a protein name or another trigger (and as consequence its associated events) is the Theme or the Cause argument of a Regulation trigger (RegThemePositive, RegCausePositive, RegNegative).",
        "In order to acquire labeled instances for training, we decompose the gold standard (GS) events into multiple events with single arguments.",
        "In cases of events being arguments to Regulation events, the former are replaced by their triggers.",
        "We match the triggers extracted with those included in the gold standard, ignoring the event type annotation.",
        "Since we identify single-token triggers, we replicate the approximate span matching used in evaluation in order to achieve better coverage.",
        "If the instance being considered has a Simple or a Binding trigger, and if the pair is in-",
        "Table 2: Performance of the rule-based and the SVM-based systems on the test data.",
        "Each horizontal corresponds to an event type or class.",
        "Binding events are not included in the Simple class aggregate performance because they can have multiple Themes.",
        "cluded in the GS then it is labeled as ThemePos-itive, else it labeled as ThemeNegative.",
        "If the instance being considered has a Regulation trigger that has been matched with a GS trigger, and if its argument is a protein name and their pair is included in the GS then it is labeled according to the latter (Reg{Theme/Cause}Positive), else, if not found in the GS it is labeled as RegThemeNegative.",
        "The same process is followed if the argument is an event trigger which has been matched with a GS trigger.",
        "We consider only Regulation triggers that are matched in the GS in order to avoid valid RegCausePositive instances being labeled as RegNegative.",
        "Recall that the Cause argument is optional, while the Theme is obligatory for Regulation events.",
        "This means that if an appropriate Theme argument is not present, then it is possible that a Cause argument that is present is not annotated.",
        "Similarly, when considering event triggers as arguments, we acquire labels only for instances involving triggers that were annotated in the GS.",
        "Since triggers without an appropriate Theme are not annotated in the gold standard, it is possible that a valid RegThemePositive or RegCausePosi-tive is labeled as RegNegative instance not because of the actual relation between the trigger and the argument but because the argument did not have an appropriate Theme present.",
        "In the example mentioned in Sec. 2, if \"IL-10\" was replaced by \"protein\" then none of the events would be annotated.",
        "We argue that a human annotator would produce these annotations implicitly, and that this partial (with respect to the task definition) annotation scheme allows the encoding of this information in a more flexible way.",
        "Also, this is likely to be a more efficient way to use the annotation time, since annotators would be requested to annotate predetermined trigger-argument pairs instead of searching for events from scratch, given only the protein name annotation.",
        "For training data generation we consider the triggers extracted using the dictionary instead of those in the GS.",
        "This process is certain to introduce some noise as some triggers might be omitted due to limited dictionary coverage.",
        "If the event type determined by the dictionary is incorrect, this is unlikely to affect the argument identification process, since the latter is dependent on the lemma of the trigger rather than its type.",
        "For example, the Theme argument of the trigger \"expression\" is unlikely to depend on whether the event denoted is Gene_expression or Transcription.",
        "The labeled instance acquisition process described results in 9,699 binary and 10,541 ternary labels compared to 6,607 triggers and 9,597 events annotated in the training data provided.",
        "However, it must be pointed out that in the shared task annotation scheme negative instances are annotated implicitly, i.e. non-events are not annotated.",
        "If we consider only the positive instances, then the annotation scheme describeed results in 3,517 Theme-Positive and 3,933 Reg{Theme/Cause}Positive instances, which are simpler since they do not need require textual span and event type specification.",
        "Rules (MC)",
        "SVM (MC+CCG)",
        "Event Type/Class",
        "recall",
        "precision",
        "F-score",
        "recall",
        "precision",
        "F-score",
        "Gene_expression Transcription Protein.catabolism Phosphorylation Localization",
        "46.54 26.28 28.57 65.19 32.18",
        "78.50",
        "28.57",
        "100.00",
        "82.24",
        "88.89",
        "58.43 27.38 44.44 72.73 47.26",
        "61.63 29.93 42.86 78.52 40.80",
        "82.26 62.12 85.71 91.38 95.95",
        "70.47 40.39 57.14 84.46 57.26",
        "Simple (total)",
        "43.99",
        "71.43",
        "54.45",
        "56.60",
        "83.21",
        "67.37",
        "Binding",
        "20.46",
        "38.17",
        "26.64",
        "29.11",
        "45.29",
        "35.44",
        "Regulation Positive Negative",
        "15.81 21.16 17.15",
        "23.47 33.02 29.41",
        "18.89 25.79 21.67",
        "23.71 37.03 30.34",
        "39.20 43.65 40.35",
        "29.55 40.07 34.64",
        "Regulation (total)",
        "19.30",
        "30.47",
        "23.63",
        "33.15",
        "42.32",
        "37.18",
        "Total",
        "28.60",
        "46.40",
        "35.39",
        "41.42",
        "56.76",
        "47.89",
        "For feature extraction, we find the shortest dependency path connecting each trigger-argument pair using Dijkstra's algorithm.",
        "We allow paths to follow either dependency direction by incorporating the direction in the dependency labels.",
        "Apart from the dependency path, we extract as features the trigger-token, the trigger event type and the argument type (event type if the argument is a trigger or Entity in case of protein names).",
        "We filtered the training set considering only instances in which the trigger was at a maximum distance of 4 dependencies away from the argument, since longer paths were too sparse to be useful in classifying unseen instances.",
        "At classification time, we consider as {Theme/Reg}Negative any instances in which the dependency path has not been encountered in the training data, as well as instances without a dependency path connecting trigger and argument.",
        "This is necessary in order to avoid instances being classified only on the basis of the trigger-token and the argument type.",
        "After the classifier has assigned labels to the triggerargument pairs, we construct events as described in Sec. 4.",
        "In cases where it is unclear (to the classifier) which is the trigger and which is the argument in a given pair of Regulation event triggers the process can result in cyclic dependencies.",
        "We resolve them using the confidence of the classifier for each decision by removing the least confident RegThemePositive or RegCausePositive assignment."
      ]
    },
    {
      "heading": "7. SVM-based system results",
      "text": [
        "In our experiments we used the LIBSVM toolkit (Chang and Lin, 2001) which provides an implementation of Support Vector Machines with various kernels and uses the one-against-one scheme for multiclass problems.",
        "In all experiments, the Gaussian kernel was used in order to capture potential non-linear feature combinations, e.g. cases where the combination of dependency path and trigger-token would result in a different decision rather than each of them independently.",
        "Preliminary experiments with the linear kernel confirmed this expectation.",
        "We focused on using the output of the two domain-adapted parsers, namely CCG and Mc-Closky.",
        "The reason for this is that, as argued in Sec. 5, given the importance of syntactic parsing to event extraction one should consider domain adaptation of syntactic parsing before developing task-specific training resources.",
        "We first compared the performances obtained using the output of the different parsers provided by the organizers using the development data.",
        "The main observation is that, using either parser, the results are much improved compared to those reported in Sec. 5, by approximately eight percentage points in F-score in either case (46.49% and 47.40% F-score for CCG and McClosky respectively).",
        "Most of the improvement is due to higher recall, suggesting that the argument identification component is able to learn patterns that are relevant to the task.",
        "Overall, using the output of CCG results in higher precision, while McClosky results in higher recall.",
        "These parsers have different theoretical foundations, therefore they are expected to make different errors.",
        "In an effort to take advantage of both parsers simultaneously, we combined them by adding for each trigger-argument pair the dependency paths extracted by both parsers.",
        "This improved performance further to 49.35% F-score.",
        "We then run the system combining the two parsers on the test data, obtaining the results presented in Table 2.",
        "Overall, the system presented would have the second best performance in the shared task achieving 41.42%/56.76%/47.89% in Recall/Precision/F-score.",
        "The top system (Bjorne (R/P/F).",
        "It followed a machine learning approach to trigger extraction which, while it is likely to be responsible for the performance difference observed when compared to the other participating systems, requires explicit trigger annotation, thus being more expensive.",
        "Furthermore, we argue that the data provided by the organizers are not suitable to train a trigger extractor, since only triggers participating in events are annotated, and semantically valid triggers without appropriate arguments present are ignored.",
        "We hypothesize that this is the reason the authors had to adjust the decisions of their SVM classifiers.",
        "many external knowledge sources such as the Gene Ontology Annotation database, the Universal Protein Resourceand the Medical Subject Headings thesaurus.",
        "While the use of these resources and their successful usage is commendable, we believe it is important that the system presented achieves comparable performance using fewer resources.",
        "Furthermore, joint inference models such as",
        "Markov Logic Networks were applied to the BioNLP 2009 event extraction shared task by Riedel et al.",
        "(2009) and were ranked fourth.",
        "This result was improved upon recently by Poon and Vanderwende (2010) who achieved 50% F-score, 2.11 percentage points better than the result achieved in this work.",
        "Such models have great potential for event extraction and we believe that they can benefit from the insights presented here.",
        "Finally, despite the fact that we used the same experimental setup as the shared task participants, we do not consider our results are directly comparable to theirs since we did not work under the same time constraints and we profited from their experiences."
      ]
    },
    {
      "heading": "8. Discussion",
      "text": [
        "Our error analysis on the output of the best system on the development data discouraged us from pursuing further improvements.",
        "Echoing the observations of Buyko et al.",
        "(2009), we found that annotation inconsistency was affecting our results significantly.",
        "In many cases the event triggers annotated in the development data were rather misleading, e.g. \"negative\" as a Gene_expression event trigger (abstract 8622883), \"increase the stability\" as a Positive_regulation event trigger (abstract 8626752), \"disappearance\" as a Binding event trigger (abstract 10455128).",
        "Finally, some events were ignored by the annotation, such as \"regulation of thymidine kinase\" (abstract 8622883).",
        "An additional complication is that events that are annotated due to anaphoric linking can have a disproportionate effect on the scores.",
        "In an example from abstract 9794375: \"CD3, CD2, and CD28 are functionally distinct receptors on T lymphocytes.",
        "Engagement of any of these receptors induces the rapid tyrosine phosphorylation of a shared group of intracellular signaling proteins, including Vav, Cbl, p85 phosphoinositide 3-kinase, and the Src family kinases Lck and Fyn.\"",
        "Failing to recognize the anaphoric Binding events involving proteins \"CD2\" and \"CD28\", an otherwise perfect system would receive two false negatives for the Binding events, eight false negatives for the missing Positive_regulation events due to the missing Causes and four false positives for the incomplete Positive_regulation events extracted.",
        "Despite this criticism, we believe that the BioNLP 2009 shared task on event extraction was a big step forward for biomedical information extraction and we are grateful to the organizers for the effort and resources provided, without which the research presented here would not have been possible.",
        "The performances achieved in the main Task1 ranged from 16% to 52% in F-score, suggesting improvements in task definition, data annotation and participating systems compared to previous community-wide efforts.",
        "Indicatively, in the protein-protein interaction pair subtask of BioCreative II (Krallinger et al., 2008) the annotated datasets provided were produced by extracting curation information from relevant databases.",
        "This meant that there was no text-bound annotation, thus making the application and evaluation of existing NLP techniques difficult, resulting in rather low performances.",
        "The best performance achieved was 29% in F-score, while many of the teams scored below 10%.",
        "However, we believe that future work should look at improving the annotation in order to be able to assess the progress in the systems developed.",
        "In particular, we argue that we should move towards a dependency-based representation, similar to the one introduced by Surdeanu et al.",
        "(2008) for joint syntactic parsing and semantic role labeling.",
        "Such representation can express the nested nature of the events and evaluate the dependencies between them directly.",
        "Furthermore, given the importance of syntactic parsing via syntactic dependencies to event extraction, it would be interesting to see how performing these tasks jointly would help improve the performance.",
        "A dependency-based representation would also allow for noncontiguous event components, as well as more complex phenomena such as the light triggers discussed earlier."
      ]
    },
    {
      "heading": "9. Conclusions",
      "text": [
        "In this paper we focused on the BioNLP 2009 shared task on event extraction.",
        "We developed two systems, a rule-based one that does not require training data and a SVM-based one which achieves near state-of-the-art performance.",
        "The good performances achieved and their reliance on shared task resources exclusively makes them reproducible and strong baselines for future work.",
        "Furthermore, we demonstrated the importance of domain adaptation of syntactic parsing for event extraction.",
        "Finally, based on our error analysis we suggest future directions for event extraction with respect to the task representation."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author would like to thank Ted Briscoe, Mark Craven and the three anonymous reviewers for their feedback."
      ]
    }
  ]
}
