{
  "info": {
    "authors": [
      "Francisco Zamora-Martinez",
      "Germán Sanchis"
    ],
    "book": "Proceedings of the Joint Fifth Workshop on Statistical Machine Translation and MetricsMATR",
    "id": "acl-W10-1731",
    "title": "UCH-UPV English–Spanish System for WMT10",
    "url": "https://aclweb.org/anthology/W10-1731",
    "year": 2010
  },
  "references": [
    "acl-I08-2089",
    "acl-P02-1038",
    "acl-P03-1021",
    "acl-P06-2093",
    "acl-P07-2045",
    "acl-W04-3250"
  ],
  "sections": [
    {
      "text": [
        "UCH-UPV English-Spanish system for WMT10",
        "Francisco Zamora-Martinez Germain Sanchis-Trilles",
        "Dep.",
        "de Fisica, Matematicas y Computation Instituto Tecnologico de Informatica",
        "Universidad CEU-Cardenal Herrera Alfara del Patriarca (Valencia), Spain",
        "fzamora@dsic.upv.es",
        "Universidad Politecnica de Valencia Valencia, Spain",
        "gsanchis@dsic.upv.es",
        "This paper describes the system developed in collabaration between UCH and UPV for the 2010 WMT.",
        "For this year's workshop, we present a system for English-Spanish translation.",
        "Output N-best lists were rescored via a target Neural Network Language Model, yielding improvements in the final translation quality as measured by BLEU and TER."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In Statistical Machine Translation (SMT), the goal is to translate a sentence f from a given source language into an equivalent sentence ê from a certain target language.",
        "Such statement is typically formalised by means of the so-called log-linear models (Papineni et al., 1998; Och and Ney, 2002) as follows:",
        "where hk(f, e) is a score function representing an important feature for the translation of f into e, K is the number of models (or features) and Ak are the weights of the log-linear combination.",
        "Typically, the weights Ak are optimised during the tuning stage with the use of a development set.",
        "Such features typically include the target language model p(e), which is one of the core components of an SMT system.",
        "In fact, most of the times it is assigned a relatively high weight in the log-linear combination described above.",
        "Traditionally, language modelling techniques have been classified into two main groups, the first one including traditional grammars such as context-free grammars, and the second one comprising more statistical, corpus-based models, such as n-gram models.",
        "In order to assign a probability to a given word, such models rely on the assumption that such probability depends on the previous history, i.e. the n – 1 preceding words in the utterance.",
        "Nowadays, n-gram models have become a \"de facto\" standard for language modelling in state-of-the-art SMT systems.",
        "In the present work, we present a system which follows a coherent and natural evolution of probabilistic Language Models.",
        "Specifically, we propose the use of a continuous space language model trained in the form of a Neural Network Language",
        "Model (NN LM).",
        "The use of continuous space representation of language has been successfully applied in recent NN approaches to language modelling (Bengio et al., 2003; Schwenk and Gauvain, 2002; Castro-Bleda and Prat, 2003; Schwenk et al., 2006).",
        "However, the use of Neural Network Language art SMT systems is not so popular.",
        "The only comprehensive work refers to (Schwenk, 2010), where the target LM is presented in the form of a fully-connected Multilayer Perceptron.",
        "The presented system combines a standard, state-of-the-art SMT system with a NN LM via log-linear combination and N-best output re-scoring.",
        "We chose to participate in the English-Spanish direction."
      ]
    },
    {
      "heading": "2. Neural Network Language Models",
      "text": [
        "In SMT the most extended language models are n-grams (Bahl et al., 1983; Jelinek, 1997; Bahl et al., 1983).",
        "They compute the probability of each word given the context of the n – 1 previous words:",
        "where S is the sequence of words for which we want compute the probability, and si G S, from a vocabulary Q.",
        "A NN LM is a statistical LM which follows equation (2) as n-grams do, but where the probabilities that appear in that expression are estimated with a NN (Bengio et al., 2003; Castro-Bleda and Prat, 2003; Schwenk, 2007; Bengio, 2008).",
        "The model naturally fits under the probabilistic interpretation of the outputs of the NNs: if a NN, in this case a MLP, is trained as a classifier, the outputs associated to each class are estimations of the posterior probabilities of the defined classes (Bishop, 1995).",
        "The training set for a LM is a sequence s1 s2 ... S|s| of words from a vocabulary Q.",
        "In order to train a NN to predict the next word given a history of length n – 1, each input word must be encoded.",
        "A natural representation is a local encoding following a \"1-of-\\Q\\\" scheme.",
        "The problem of this encoding for tasks with large vocabularies (as is typically the case) is the huge size of the resulting NN.",
        "We have solved this problem following the ideas of (Bengio et al., 2003; Schwenk, 2007), learning a distributed representation for each word.",
        "Figure 1 illustrates the architecture of the feed-forward NN used to estimate the NN LM:",
        "• The input is composed of words si – n+1 ,...,si – 1 of equation (2).",
        "Each word is represented using a local encoding.",
        "• P is the projection layer of the input words, formed by Pi – n+1,..., Pi – 1 subsets of projection units.",
        "The subset of projection units Pj represents the distributed encoding of input word Sj.",
        "The weights of this projection layer are linked, that is, the weights from each local encoding of input word sj to the corresponding subset of projection units Pj are the same for all input words.",
        "After training, the codification layer is removed from the network by pre-computing a table of size \\Q\\ which serves as a distributed encoding.",
        "• H denotes the hidden layer.",
        "• The output layer O has \\Q\\ units, one for each word of the vocabulary.",
        "This n-gram NN LM predicts the posterior probability of each word of the vocabulary given the n – 1 previous words.",
        "A single forward pass of the MLP gives p(cu\\si – n+1... si – 1) for every word a £ Q.",
        "Figure 1: Architecture of the continuous space NN LM during training.",
        "The input words are si – n+1,..., si – 1 (in this example, the input words are si – 3, si – 2, and si – 1 for a 4-gram).",
        "I, P, H, and O are the input, projection, hidden, and output layer, respectively, of the MLP.",
        "The major advantage of the connectionist approach is the automatic smoothing performed by the neural network estimators.",
        "This smoothing is done via a continuous space representation of the input words.",
        "Learning the probability of n-grams, together with their representation in a continous space (Bengio et al., 2003), is an appropriate approximation for large vocabulary tasks.",
        "However, one of the drawbacks of such approach is the high computational cost entailed whenever the NN LM is computed directly, with no simplification whatsoever.",
        "For this reason, in this paper we will be restricting vocabulary size."
      ]
    },
    {
      "heading": "3. Experiments 3.1 Baseline system",
      "text": [
        "For building the baseline SMT system, we used the open-source SMT toolkit Moses (Koehn et al., 2007), in its standard setup.",
        "The decoder includes a log-linear model comprising a phrase-based translation model, a language model, a lex-icalised distortion model and word and phrase penalties.",
        "The weights of the log-linear interpolation were optimised by means of MERT (Och, 2003).",
        "For the baseline LM, we computed a regular n-gram LM with Kneser-Ney smoothing (Kneser and Ney, 1995) and interpolation by means of the SRILM (Stolcke, 2002) toolkit.",
        "Specifically, we trained a 6-gram LM on the larger Spanish corpora available (i.e. UN, News-Shuffled and Europarl), and a 5-gram LM on the News-Commentary corpus.",
        "Once these LMs had been built, they were finally interpolated so as to maximise the perplexity of the News-Commentary test set of the 2008 shared task.",
        "This was done so according to preliminary investigation.",
        "The presented systems follow previous works",
        "Schwenk and Koehn, 2008; Schwenk, 2010) where the use of a NN LM helps achieving better performance in the final system.",
        "The NN LM was incorporated to the baseline system via log-linear combination, adding a new feature to the output N-best list generated by the baseline system (in this case N = 1 000).",
        "Specifically, the NN LM was used to compute the log-probability of each sentence within the N-best list.",
        "Then, the scores of such list were extended with our new, NN LM-based feature.",
        "This being done, we optimised the coefficients of the log-linear interpolation by means of MERT, taking into account the newly introduced feature.",
        "Finally the list was re-scored and the best hypothesis was extracted and returned as final output.",
        "Figure 2 shows a diagram of the system structure.",
        "NN LM was trained with the concatenation of the News-shuffled and News-Commentary10 Spanish corpora.",
        "Other language resources were discarded due to the large amount of computational resources that would have been needed for training a NN LM with such material.",
        "Table 1 shows some statistics of the corpora.",
        "In order to reduce the complexity of the model, the vocabulary was restricted to the 20K more frequent words in the concatenation of news corpora.",
        "Using this restricted vocabulary implies that 6.4% of the running words of the news-test2008 set, and 7.3% of the running words within the official 2010 test set, will be considered as unknown for our system.",
        "In addition, the vocabulary includes a special token for unknown words used for compute probabilities when an unknown word appears, as described in Equation 2.",
        "Table 1: Spanish corpora statistics.",
        "NC stands for News-Commentary and UN for United Nations, while \\ Q \\ stands for vocabulary size, and M/K for millions/thousands of elements._",
        "A 6-gram NN LM was trained for this task, based in previous works (Khalilov et al., 2008).",
        "The distributed encoding input layer consists of 640 units (128 for each word), the hidden layer has 500 units, and the output layer has 20K units, one for each word in the restricted vocabulary.",
        "The total number of weights in the network was 10 342 003.",
        "The training procedure was conducted by means of the stochastic back-propagation algorithm with weight decay, with a replacement of 300K training samples and 200K validation samples in each training epoch.",
        "The training and validation sets were randomly extracted from the concatenation of news corpora.",
        "The training set consisted of 102M words (3M sentences) and validation set 8M words (300K sentences).",
        "The network needed 129 epochs for achieving convergence, resulting in 38.7M and 25.8M training and validation samples respectively.",
        "For training the NN LM we used the April toolkit (Espafia-Boquera et al., 2007; Zamora-Martinez et al., 2009), which implements a pattern recognition and neural networks toolkit.",
        "The perplexity achieved by the 6-gram NN LM in the Spanish news-test08 development set was 116, versus 94 obtained with a standard 6-gram language model with interpolation and Kneser-Ney smoothing (Kneser and Ney, 1995).",
        "The number of sentences in the N-best list was set to 1 000 unique output sentences.",
        "Results can be seen in Table 2.",
        "In order to assess the reliability of such results, we computed pairwise improvement intervals as described in (Koehn, 2004), by means of bootstrapping with 1000 bootstrap iterations and at a 95% confidence level.",
        "Such confidence test reported the improvements to be statistically significant.",
        "Four more experiments have done in order to study the influence of the N-best list size in the",
        "Set",
        "# Lines",
        "# Words",
        "Q",
        "NC",
        "108K",
        "2.96M",
        "67K",
        "News-Shuffled",
        "3.86M",
        "107M",
        "512K",
        "Europarl",
        "1.82M",
        "51M",
        "172K",
        "UN",
        "6.22M",
        "214M",
        "411K",
        "Total",
        "3.96M",
        "110M",
        "521K",
        "Table 2: English-Spanish translation quality for development and official test set.",
        "Results are given performance achieved by the NN LM rescoring.",
        "the weights ofthe log-linear interpolation were optimised by means of MERT over the test08 set.",
        "Table 3 shows the test results for each N-best listsize using the correspondent optimised weights.",
        "As it can be seen, the size of the N-best list seems to have an impact on the final translation quality produced.",
        "Although in this case the results are not statistically significant for each size step, the final difference (from 27.5 to 27.8) is already significant."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "In this paper, an improved SMT system by using a NN LM was presented.",
        "Specifically, it has been shown that the final translation quality, as measured by BLEU and TER, is improved over the quality obtained with a state-of-the-art SMT system.",
        "Such improvements, of 1.1 BLEU points, were found to be statistically significant.",
        "The system presented uses a neural network only for computing the language model probabilities.",
        "As an immediate future work, we intend to compute the language model by means of a linear interpolation of several neural networks.",
        "Another interesting idea is to integrate the NN LM within the decoder itself, instead of performing a subsequent re-scoring step.",
        "This can be done extending the ideas presented in a previous work (Zamora-Martinez et al., 2009), in which the evaluation of NN LM is significantly sped-up."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This paper was partially supported by the EC (FEDER/FSE) and by the Spanish Government (MICINN and MITyC) under the MIPRCV \"Consolider Ingenio 2010\" program (CSD2007-00018), iTrans2 (TIN2009-14511) project and the erudito.com (TSI-020110-2009-439) project.",
        "test08 (dev) test10 (test)",
        "Baseline NN LM",
        "24.8/60.0 26.7/55.1 25.2/59.6 27.8/54.0",
        "N-best list size",
        "BLEU",
        "TER",
        "200",
        "27.5",
        "54.2",
        "400",
        "27.6",
        "54.2",
        "600",
        "27.7",
        "54.1",
        "800",
        "27.6",
        "54.2",
        "1000",
        "27.8",
        "54.0"
      ]
    }
  ]
}
