{
  "info": {
    "authors": [
      "Cynthia Kersey",
      "Barbara Di Eugenio",
      "Pamela W. Jordan",
      "Sandra Katz"
    ],
    "book": "Proceedings of the NAACL HLT 2010 Demonstration Session",
    "id": "acl-N10-2005",
    "title": "KSC-PaL: A Peer Learning Agent that Encourages Students to take the Initiative",
    "url": "https://aclweb.org/anthology/N10-2005",
    "year": 2010
  },
  "references": [
    "acl-J98-3002"
  ],
  "sections": [
    {
      "text": [
        "KSC-PaL: A Peer Learning Agent that Encourages Students to take the",
        "Initiative*",
        "Cynthia Kersey Barbara Di Eugenio Pamela Jordan and Sandra Katz",
        "Lewis University University of Illinois at Chicago University of Pittsburgh",
        "Romeoville, IL 60446 USA Chicago, IL 60607 USA Pittsburgh, PA 15260 USA",
        "We present an innovative application of dialogue processing concepts to educational technology.",
        "In a previous corpus analysis of peer learning dialogues, we found that initiative and initiative shifts are indicative of learning, and of learning-conducive episodes.",
        "We have incorporated this finding in KSC-PaL, a peer learning agent.",
        "KSC-PaL promotes learning by encouraging shifts in task initiative."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Collaborative learning has been shown to be an effective mode of learning for potentially all participants (Brown and Palincsar, 1989; Fisher, 1993; Tin, 2003).",
        "While collaboration in dialogue has long been researched in computational linguistics (Chu-Carroll and Carberry, 1998; Constantino-Gonzalez and Suthers, 2000; Jordan and Di Eugenio, 1997; Soller, 2004), the study of peer learning from a computational perspective is still in the early stages.",
        "Previous research has suggested several mechanisms that explain why peer learning is effective.",
        "Among them are: self-directed explaining (Chi et al., 1994), other-directed explaining (Ploetzner et al., 1999; Roscoe and Chi, 2007) and Knowledge Co-construction - KCC for short (Hausmann et al., 2004).",
        "KCC episodes are defined as portions of the dialogue in which students are jointly constructing a shared meaning of a concept required for problem solving.",
        "This last mechanism is the most interesting from a peer learning perspective because it is a truly",
        "*This work is funded by NSF grants 0536968 and 0536959.",
        "collaborative construct and also because it is consistent with the widely accepted constructivist view of learning.",
        "In our previous work (Kersey et al., 2009) we derived a model of peer interactions that operational-izes KCC via the notion of initiative shifts in dialogue.",
        "This model was based on an extensive corpus analysis in which we found a strong relationship between initiative shifts and KCC episodes.",
        "A paired t-test showed that there were significantly more initiative shifts in the annotated KCC episodes compared with the rest of the dialogue ( t(57) = 3.32, p = 0.0016).",
        "The moderate effect difference between the two groups (effect size = 0.49 ) shows that there is a meaningful increase in the number of initiative shifts in KCC episodes compared with problem solving activity outside of the KCC episodes.",
        "Additionally, we found moderate correlations of learning with both KCC (R = 0.14, p = 0.02) and with initiative shifts (R = 0.20, p = 0.00).",
        "We have incorporated this model in an innovative peer learning agent, KSC-PaL, that is designed to collaborate with a student to solve problems in the domain of computer science data structures."
      ]
    },
    {
      "heading": "2. KSC-PaL",
      "text": [
        "KSC-PaL, has at its core the TuTalk System (Jordan et al., 2007), a dialogue management system that supports natural language dialogue in educational applications.",
        "In developing KSC-PaL we extended TuTalk in three ways.",
        "The first extension is a user interface (see Figure 1) which manages communication between TuTalk and the student.",
        "Students interact with KSC-",
        "PaL using natural language and graphical actions.",
        "The student input is processed by the interface and its related modules into an appropriate format and passed to TuTalk.",
        "Since TuTalk's interpretation module is not able to appropriately handle all student utterances, a human interpreter assists in this process.",
        "The interpreter receives a student utterance along with a list of possible matching concepts from TuTalk (see Figure 4).",
        "The interpreter then selects the most likely matching concepts from TuTalk thus assisting in natural language interpretation.",
        "If the student utterance doesn't match any of these concepts, a second list of concepts, containing student initiative utterances, are presented to the interpreter.",
        "If none of these match then all known concepts are presented to the interpreter for matching.",
        "Note that the interpreter has a limited, predetermined set of choices, corresponding to the concepts that TuTalk is aware of.",
        "In this way, his/her intervention is circumscribed.",
        "The second addition is the incorporation of a student model that allows the KSC-PaL to track the current state of problem solving and the student's knowledge in order to guide its behavior.",
        "TuTalk's student model was replaced with one that incorporates problem solution graphs (Conati et al., 2002).",
        "Solution graphs are Bayesian networks where each node represents either an action required to solve the problem or a concept required as part of problem solving.",
        "A user's utterances and actions are then matched to these nodes.",
        "This provides KSC-PaL with information related to the student's knowledge of problem solving concepts as well as the current topic under discussion.",
        "Thirdly, a planning module was added to TuTalk to make decisions on implementation of problem solving goals and responses to student initiative in order to manage shifts in initiative.",
        "The planning module includes an initiative tracker that codes turns with with either student initiative or agent initiative using one classifier for natural language utterances and a separate classifier for drawing and coding actions.",
        "Once a turn is classified, it is determined whether a shift in initiative has occurred by comparing the current classification with the classification of the previous turn.",
        "An average level of initiative shifts is then computed by dividing the number of initiative shifts by the total number of turns.",
        "Based on the initiative level, KSC-PaL encourages initiative shifts by using prompts, hedging, requesting feedback from the student and encouraging student criticism by intentionally making errors in problem solving.",
        "Our evaluation of KSC-PaL (Kersey et al., June 2010) found that students learned using the agent and that KSC-PaL was was successful in encouraging shifts in initiative."
      ]
    },
    {
      "heading": "3. Demonstration Outline",
      "text": [
        "We will demonstrate a problem solving episode with KSC-PaL where a user will interact with the agent as a student.",
        "Specifically we will show how KSC-PaL attempts to manage the level of initiative and how KSC-PaL reacts to student initiative."
      ]
    },
    {
      "heading": "1.. Amy: hi there, are you ready",
      "text": [
        "to start?"
      ]
    },
    {
      "heading": "2.. Mary: sure",
      "text": []
    },
    {
      "heading": "3.. Amy: where to begin?",
      "text": []
    },
    {
      "heading": "5.. Amy: maybe we should draw this",
      "text": []
    },
    {
      "heading": "6.. Amy: do you want to draw it?",
      "text": []
    },
    {
      "heading": "7.. Mary: ok",
      "text": [
        "8.",
        "Amy: so, line 1 ..."
      ]
    },
    {
      "heading": "10.. Amy: hmmm",
      "text": [
        "second.next (Mary diagrams the code segment)"
      ]
    },
    {
      "heading": "12.. Mary: there i finished it",
      "text": []
    },
    {
      "heading": "13.. Amy: looks good",
      "text": []
    },
    {
      "heading": "14.. Amy: i think we're done drawing",
      "text": []
    },
    {
      "heading": "15.. Mary: yes",
      "text": [
        "16.",
        "Amy: basically, it switches the first and second elements"
      ]
    },
    {
      "heading": "17.. Mary: right",
      "text": []
    },
    {
      "heading": "18.. Amy: ill write the explanation",
      "text": []
    },
    {
      "heading": "19.. Mary: ok",
      "text": [
        "lem solving session.",
        "Amy, the agent, attempts to maintain a balanced level of initiative either by encouraging the student (Mary) to take initiative, or by taking initiative.",
        "In lines 10 and 11, the agent uses a prompt followed by repetition of the problem solving goal to encourage the student to retain the initiative.",
        "However, in line 16 the agent takes initiative by proposing a solution to the problem.",
        "KSC-PaL is also able to manage the situation where the student takes initiative in the dialogue in an unanticipated manner, as shown in Figure 3.",
        "In line 3, Mary asks a question that is not expected at this point in the problem solving process and the agent responds appropriately in line 4.",
        "KSC-PaL is able to respond to a set of student initiations derived from corpus data, such as the one in this excerpt.",
        "Additionally, the agent responds in a generic manner to other unanticipated initiations and directs the student back to problem solving."
      ]
    },
    {
      "heading": "1.. Mary: let's look at the code",
      "text": [
        "second both equal bat"
      ]
    },
    {
      "heading": "3.. Mary: is second a reference or",
      "text": []
    },
    {
      "heading": "4.. Amy: second is a reference",
      "text": []
    }
  ]
}
