{
  "info": {
    "authors": [
      "Markus Saers",
      "Joakim Nivre",
      "Dekai Wu"
    ],
    "book": "Proceedings of the Joint Fifth Workshop on Statistical Machine Translation and MetricsMATR",
    "id": "acl-W10-1724",
    "title": "Linear Inversion Transduction Grammar Alignments as a Second Translation Path",
    "url": "https://aclweb.org/anthology/W10-1724",
    "year": 2010
  },
  "references": [
    "acl-C96-2141",
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-J97-3002",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P07-1065",
    "acl-P07-2045",
    "acl-P08-1012",
    "acl-P09-1104",
    "acl-W09-2304",
    "acl-W09-3804"
  ],
  "sections": [
    {
      "text": [
        "Markus SAERS and Joakim NIVRE Dekai WU",
        "Computational Linguistics Group Human Language Technology Center Dept.",
        "of Linguistics and Philology Dept.",
        "of Computer Science and Engineering Uppsala University HKUST Sweden Hong Kong",
        "first.last@lingfil.uu.se dekai@cs.ust.hk",
        "We explore the possibility of using Stochastic Bracketing Linear Inversion Transduction Grammars for a full-scale German-English translation task, both on their own and in conjunction with alignments induced with GIZA++.",
        "The rationale for transduction grammars, the details of the system and some results are presented."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Lately, there has been some interest in using Inversion Transduction Grammars (ITGs) for alignment purposes.",
        "The main problem with ITGs is the time complexity, O(Gn) doesn't scale well.",
        "By limiting the grammar to a bracketing ITG (BITG), the grammar constant (G) can be eliminated, but O(n) is still prohibitive for large data sets.",
        "There has been some work on approximate inference of ITGs.",
        "Zhang et al.",
        "(2008) present a method for evaluating spans in the sentence pair to determine whether they should be excluded or not.",
        "The algorithm has a best case time complexity of O(n).",
        "Saers, Nivre & Wu (2009) introduce a beam pruning scheme, which reduces time complexity to O(bn).",
        "They also show that severe pruning is possible without significant deterioration in alignment quality (as measured by downstream translation quality).",
        "Haghighi et al.",
        "(2009) use a simpler aligner as guidance for pruning, which reduces the time complexity by two orders of magnitude.",
        "Their work also partially implements the phrasal ITGs for translation-driven segmentation introduced in Wu (1997), although they only allow for one-to-many alignments, rather than many-to-many alignments.",
        "A more extreme approach is taken in Saers, Nivre & Wu (2010).",
        "Not only is the search severely pruned, but the grammar itself is limited to a linearized form, getting rid of branching within a single parse.",
        "Although a small deterioration in downstream translation quality is noted (compared to harshly pruned SBITGs), the grammar can be induced in linear time.",
        "In this paper we apply sblitgs to a full size German-English WMT'10 translation task.",
        "We also use differentiated translation paths to combine sblitg translation models with a standard GIZA++ translation model."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "A transduction grammar is a grammar that generates a pair of languages.",
        "In a transduction grammar, the terminal symbols consist of pairs of tokens where the first is taken from the vocabulary of one of the languages, and the second from the vocabulary of the other.",
        "Transduction grammars have to our knowledge been restricted to transduce between languages no more complex than context-free languages (cfls).",
        "Transduction between CFLs was first described in Lewis & Stearns (1968), and then further explored in Aho & Ull-man (1972).",
        "The main motivation for exploring this was to build programming language compilers, which essentially translate between source code and machine code.",
        "There are two types of transduction grammars between CFLs described in the computer science literature: simple transduction grammars (STGs) and syntax-directed transduction grammars (sdtgs).",
        "The difference between them is that STGs are monotone, whereas SDTGs allow unlimited reordering in rule productions.",
        "Both allow the use of singletons to insert and delete tokens from either language.",
        "A singleton is a biterminal where one of the tokens is the empty string (e).",
        "Neither STGs nor SDTGs are intuitively useful in translating natural languages, since STGs have no way to model reordering, and SDTGs require exponential time to be induced from examples (parallel corpora).",
        "Since compilers in general work on well defined, manually specified programming languages, there is no need to induce them from examples, so the exponential complexity is not a problem in this setting - sdtgs can transduce in O(n) time, so once the grammar is known they can be used to translate efficiently.",
        "In natural language translation, the grammar is generally not known, in fact, state-of-the art translation systems rely heavily on machine learning.",
        "For transduction grammars, this means that they have to be induced from parallel corpora.",
        "An inversion transduction grammar (itg) strikes a good balance between stgs and sdtgs, as it allows some reordering, while requiring only polynomial time to be induced from parallel corpora.",
        "The allowed reordering is either the identity permutation of the production, or the inversion permutation.",
        "Restricting the permutations in this way ensures that an itg can be expressed in two-normal form, which is the key property for avoiding exponential time complexity in biparsing (parsing of a sentence pair).",
        "An itg in two-normal form (representing the transduction between L1 and L2) is written with identity productions in square brackets, and inverted productions in angle brackets.",
        "Each such rule can be construed to represent two (one Li and one L2) synchronized cfg rules:",
        "itgll)l2 cfgll cfgla",
        "Inducing an itg from aparallel corpus is still slow, as the time complexity is O(Gn).",
        "Several ways to get around this has been proposed (Zhang et al., 2008; Haghighi et al., 2009; Saers et al., 2009; Saers et al., 2010).",
        "Taking a closer look at the linear itgs (Saers et al., 2010), there are five rules in normal form.",
        "Decomposing these five rule types into monolingual rule types reveals that the monolingual grammars are linear grammars (lgs):",
        "litgLi,L2",
        "This means that litgs are transduction grammars that transduce between linear languages.",
        "There is also a nice parallel in search time complexities between cfgs and itgs on the one hand, and lgs and litgs on the other.",
        "Searching for all possible parses given a sentence is O(n) for cfgs, and O(n) for lgs.",
        "Searching for all possible biparses given a bisentence is O(n) for itgs, and O(n) for litgs.",
        "This is consistent with thinking of biparsing as finding every L2 parse for every L1 parse.",
        "Biparsing consists of assigning a joint structure to a sentence pair, rather than assigning a structure to a sentence.",
        "In this paper, only stochastic bracketing grammars (sbitgs and sblitgs) were used.",
        "A bracketing grammar has only one nonterminal symbol, denoted X.",
        "A stochastic grammar is one where each rule is associated with a probability, such that",
        "While training a Stochastic Bracketing itg (SBITG) or litg (SBLITG) with em, expectations of probabilities over the biparse-forest are calculated.",
        "These expectations approach the true probabilities, and can be used as approximations.",
        "The probabilities over the biparse-forest can be used to select the one-best parse-tree, which in turn forces an alignment over the sentence pair.",
        "The alignments given by sb itgs and sb litgs has been shown to give better translation quality than bidirectional ibm-models, when applied to short sentence corpora (Saers and Wu, 2009; Saers et al., 2009; Saers et al., 2010).",
        "In this paper we explore whether this hold for sb litgs on standard sentence corpora."
      ]
    },
    {
      "heading": "3. Setup",
      "text": [
        "The baseline system for the shared task was a phrase based translation model based on bidirectional ibm- (Brown et al., 1993) and hmm-models (Vogel et al., 1996) combined with the grow-diag-final-and heuristic.",
        "This is computed with the giza++ tool (Och and Ney, 2003) and the Moses toolkit (Koehn et al., 2007).",
        "The language model was a 5-gram srilm (Stol-cke, 2002).",
        "Parameters in the final translation system were determined with Minimum Error-Rate Training (Och, 2003), and translation quality was assessed with the automatic measures bleu (Pap-ineni et al., 2002) and nist (Doddington, 2002).",
        "A",
        " – [ e/f C ]",
        "A – ",
        "eC",
        "A – ",
        "fC",
        "A",
        " – [ Be/f ]",
        "A – ",
        "Be",
        "A – ",
        "Bf",
        "A",
        " – ( e/f C )",
        "A – ",
        "eC",
        "A – ",
        "Cf",
        "A",
        " – ( Be/f )",
        "A – ",
        "Be",
        "A – ",
        "fB",
        "A – e/e",
        "A",
        " – e",
        "A",
        " – e",
        "We chose to focus on the German-English translation task.",
        "The corpora resources available for that task is summarized in Table 1.",
        "We used the entire news commentary monolingual data concatenated with the English side of the Europarl bilingual data to train the language model.",
        "In retrospect, this was probably a bad choice, as others seem to prefer the use of two language models instead.",
        "We contrasted the baseline system with pure sblitg systems trained on different parts of the training data, as well as combined systems, where the sblitg systems were combined with the baseline system.",
        "The combination was done by adding the sblitg translation model as a second translation path to the base line system.",
        "To train our sblitg systems, we used the algorithm described in Saers et al.",
        "(2010).",
        "We set the beam size parameter to 50, and ran expectation-maximization for 10 iterations or until the log-probability of the training corpus started deteriorating.",
        "After the grammar was induced we obtained the one-best parse for each sentence pair, which also dictates a word alignment over that sentence pair, which we used instead of the word alignments provided by giza++.",
        "From that point, training did not differ from the baseline procedure.",
        "We trained a total of three pure sblitg system, one with only the news commentary part of the corpus, one with only the Europarl part, and one with both.",
        "We also combined all three sblitg systems with the baseline system to see whether the additional translation paths would help.",
        "The system we submitted corresponds to the \"giza++ and sblitg (only news)\" system, but with RandLM (Talbot and Osborne, 2007) as language model rather than srilm.",
        "This was because we lacked the necessary ram resources to calculate the full s rilm model before the system submission deadline."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "The results for the development test set are summarized in Table 2.",
        "The submitted system achieved a bleu score of 0.1759 and a nist score of 5.9579 for cased output on this year's test set (these numbers are not comparable to those in Table 2).",
        "To our surprise, adding the additional phrases as a second translation path does not seem to help.",
        "Instead a small deterioration in bleu is noted (0.22-0.40 points), whereas the differences in nist are mixed (-0.0098-+0.0071 points).",
        "Over all the variations were very small.",
        "The pure sblitg systems perform consistently below baseline, which could indicate that the grammar class is unable to capture the reorderings found in longer sentence pairs adequately in one parse.",
        "The variation between the pure sblitg systems can be explained by the size of the training data: more data - better quality.",
        "Corpus",
        "Type",
        "Size",
        "German-English Europarl German-English news commentary English news commentary German-English news commentary German-English news commentary",
        "out of domain",
        "in-domain",
        "in-domain",
        "in-domain tuning data in-domain test data",
        "1,219,343 sentence pairs 86,941 sentence pairs 48,653,884 sentences",
        "2,051 sentence pairs 2,489 sentence pairs",
        "System",
        "BLEU",
        "NIST",
        "GIZA++",
        "17.88",
        "5.9748",
        "sblitg",
        "17.61",
        "5.8846",
        "SBLITG (only Europarl)",
        "17.46",
        "5.8491",
        "SBLITG (only news)",
        "15.49",
        "5.4987",
        "GIZA++ and SBLITG",
        "17.66",
        "5.9650",
        "GIZA++ and SBLITG (only Europarl)",
        "17.58",
        "5.9819",
        "GIZA++ and SBLITG (only news)",
        "17.48",
        "5.9693"
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We tried to use sblitgs as word aligners on full size sentences, which has not been done to date, and noted that the formalism seems unable to account for the full complexity of longer sentence pairs.",
        "We also tried combining the translation models acquired with sblitg alignments to the baseline system, and noted very small differences, tending to a deterioration in quality.",
        "The fact that sblitgs seem unable to capture the complex relationship between an English and a German sentence in one parse means that we need to find either some more complex model or some way to use the entire parse forest to arrive at the alignment."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was funded by the Swedish National Graduate School of Language Technology (gslt), the Defense Advanced Research Projects Agency (darpa) under gale Contract No.",
        "HR0011-06-C-0023, and the Hong",
        "Kong Research Grants Council (rgc) under research grants GRF621008, DAG03/04.EG09, RGC6256/00E, and RGC6083/99E.",
        "Any opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the Defense Advanced Research Projects Agency.",
        "The computations were performed on uppmax resources under project p2007020."
      ]
    }
  ]
}
