{
  "info": {
    "authors": [
      "Yoav Goldberg",
      "Michael Elhadad"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1115",
    "title": "An Efficient Algorithm for Easy-First Non-Directional Dependency Parsing",
    "url": "https://aclweb.org/anthology/N10-1115",
    "year": 2010
  },
  "references": [
    "acl-D07-1013",
    "acl-D07-1096",
    "acl-D07-1099",
    "acl-D07-1100",
    "acl-D07-1101",
    "acl-D08-1052",
    "acl-D08-1059",
    "acl-D09-1127",
    "acl-E06-1011",
    "acl-N06-2033",
    "acl-P05-1012",
    "acl-P06-2089",
    "acl-P07-1096",
    "acl-P08-1108",
    "acl-W02-1001",
    "acl-W04-0308",
    "acl-W05-1504",
    "acl-W06-1616",
    "acl-W06-2920",
    "acl-W06-2929"
  ],
  "sections": [
    {
      "text": [
        "We present a novel deterministic dependency parsing algorithm that attempts to create the easiest arcs in the dependency structure first in a non-directional manner.",
        "Traditional deterministic parsing algorithms are based on a shift-reduce framework: they traverse the sentence from left-to-right and, at each step, perform one of a possible set of actions, until a complete tree is built.",
        "A drawback of this approach is that it is extremely local: while decisions can be based on complex structures on the left, they can look only at a few words to the right.",
        "In contrast, our algorithm builds a dependency tree by iteratively selecting the best pair of neighbours to connect at each parsing step.",
        "This allows incorporation of features from already built structures both to the left and to the right of the attachment point.",
        "The parser learns both the attachment preferences and the order in which they should be performed.",
        "The result is a deterministic, best-first, O(nlogn) parser, which is significantly more accurate than best-first transition based parsers, and nears the performance of globally optimized parsing models."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Dependency parsing has been a topic of active research in natural language processing in the last several years.",
        "An important part of this research effort are the CoNLL 2006 and 2007 shared tasks (Buchholz and Marsi, 2006; Nivre et al., 2007), which allowed for a comparison of many algorithms and approaches for this task on many languages.",
        "*Supported by the Lynn and William Frankel Center for Computer Sciences, Ben Gurion University",
        "Current dependency parsers can be categorized into three families: local-and-greedy transition-based parsers (e.g., MaltParser (Nivre et al., 2006)), globally optimized graph-based parsers (e.g., MstParser (McDonald et al., 2005)), and hybrid systems (e.g., (Sagae and Lavie, 2006b; Nivre and McDonald, 2008)), which combine the output of various parsers into a new and improved parse, and which are orthogonal to our approach.",
        "Transition-based parsers scan the input from left to right, are fast (O(n)), and can make use of rich feature sets, which are based on all the previously derived structures.",
        "However, all of their decisions are very local, and the strict left-to-right order implies that, while the feature set can use rich structural information from the left of the current attachment point, it is also very restricted in information to the right of the attachment point: traditionally, only the next two or three input tokens are available to the parser.",
        "This limited lookahead window leads to error propagation and worse performance on root and long distant dependencies relative to graph-based parsers (McDonald and Nivre, 2007).",
        "Graph-based parsers, on the other hand, are globally optimized.",
        "They perform an exhaustive search over all possible parse trees for a sentence, and find the highest scoring tree.",
        "In order to make the search tractable, the feature set needs to be restricted to features over single edges (first-order models) or edges pairs (higher-order models, e.g. (McDonald and Pereira, 2006; Carreras, 2007)).",
        "There are several attempts at incorporating arbitrary tree-based features but these involve either solving an ILP problem (Riedel and Clarke, 2006) or using computa-",
        "a ^^Airown fox jumped with joy brown a brown fox with fox fox joy a brown a brown",
        "Figure 1: Parsing the sentence \"a brown fox jumped with joy\".",
        "Rounded arcs represent possible actions.",
        "tionally intensive sampling-based methods (Naka-gawa, 2007).",
        "As a result, these models, while accurate, are slow (O(n) for projective, first-order models, higher polynomials for higher-order models, and worse for richer tree-feature models).",
        "We propose a new category of dependency parsing algorithms, inspired by (Shen et al., 2007): non-directional easy-first parsing.",
        "This is a greedy, deterministic parsing approach, which relaxes the left-to-right processing order of transition-based parsing algorithms.",
        "By doing so, we allow the explicit incorporation of rich structural features derived from both sides of the attachment point, and implicitly take into account the entire previously derived structure of the whole sentence.",
        "This extension allows the incorporation of much richer features than those available to transition-and especially to graph-based parsers, and greatly reduces the locality of transition-based algorithm decisions.",
        "On the other hand, it is still a greedy, best-first algorithm leading to an efficient implementation.",
        "We present a concrete O(nlogn) parsing algorithm, which significantly outperforms state-of-the-art transition-based parsers, while closing the gap to graph-based parsers.",
        "2 Easy-first parsing",
        "When humans comprehend a natural language sentence, they arguably do it in an incremental, left-toright manner.",
        "However, when humans consciously annotate a sentence with syntactic structure, they hardly ever work in fixed left-to-right order.",
        "Rather, they start by building several isolated constituents by making easy and local attachment decisions and only then combine these constituents into bigger constituents, jumping back-and-forth over the sentence and proceeding from easy to harder phenomena to analyze.",
        "When getting to the harder decisions a lot of structure is already in place, and this structure can be used in deciding a correct attachment.",
        "Our parser follows a similar kind of annotation process: starting from easy attachment decisions, and proceeding to harder and harder ones.",
        "When making later decisions, the parser has access to the entire structure built in earlier stages.",
        "During the training process, the parser learns its own notion of easy and hard, and learns to defer specific kinds of decisions until more structure is available."
      ]
    },
    {
      "heading": "3. Parsing algorithm",
      "text": [
        "Our (projective) parsing algorithm builds the parse tree bottom up, using two kinds of actions: AT-tachLeft(i) and AttachRight(i) .",
        "These actions are applied to a list of partial structures Pi,...,Pk, called pending, which is initialized with the n words of the sentence w\\,... ,wn.",
        "Each action connects the heads of two neighbouring structures, making one of them the parent of the other, and removing the daughter from the list of partial structures.",
        "AttachLeft(i) adds a dependency edge (pi,pi+1) and removes pi+1 from the list.",
        "At-tachRight(i) adds a dependency edge (pi+1, pi) and removes pi from the list.",
        "Each action shortens the list of partial structures by 1, and after n – 1 such actions, the list contains the root of a connected projective tree over the sentence.",
        "Figure 1 shows an example of parsing the sentence \"a brown fox jumped with joy\".",
        "The pseudocode of the algorithm is given in Algorithm 1.",
        "Algorithm 1: Non-directional Parsing Input: a sentence= w1 ...wnOutput: a set of dependency arcs over the sentence (Arcs)"
      ]
    },
    {
      "heading": "1. Acts = {AttachLeft, AttachRight}",
      "text": []
    },
    {
      "heading": "4. while length(pending) > 1 do",
      "text": [
        "best – argmax score(act(i))",
        "act^Acts"
      ]
    },
    {
      "heading": "6. (parent, child) – edgeFor (best)",
      "text": [
        "7 Arcs.add( (parent, child) )"
      ]
    },
    {
      "heading": "8. pending .remove (child)",
      "text": []
    },
    {
      "heading": "10. return Arcs",
      "text": [
        "ATTACHLEFT(i) ATTACHRlGHT(i)",
        "At each step the algorithm chooses a specific action/location pair using a function score(ACTlON(i)), which assign scores to action/location pairs based on the partially built structures headed by pi and pi+i, as well as neighbouring structures.",
        "The score() function is learned from data.",
        "This scoring function reflects not only the correctness of an attachment, but also the order in which attachments should be made.",
        "For example, consider the attachments (brown,fox) and (joy,with) in Figure (1.1).",
        "While both are correct, the scoring function prefers the (adjective,noun) attachment over the (prep,noun) attachment.",
        "Moreover, the attachment (jumped,with), while correct, receives a negative score for the bare preposition \"with\" (Fig.",
        "(1.1) - (1.4) ), and a high score once the verb has its subject and the PP \"with joy\" is built (Fig.",
        "(1.5) ).",
        "ideally, we would like to score easy and reliable attachments higher than harder less likely attachments, thus performing attachments in order of confidence.",
        "This strategy allows us both to limit the extent of error propagation, and to make use of richer contextual information in the later, harder attachments.",
        "Unfortunately, this kind of ordering information is not directly encoded in the data.",
        "We must, therefore, learn how to order the decisions.",
        "We first describe the learning algorithm (Section 4) and a feature representation (Section 5) which enables us to learn an effective scoring function."
      ]
    },
    {
      "heading": "4. Learning Algorithm",
      "text": [
        "We use a linear model score(x) = w • 0(x), where (f)(x) is a feature representation and w is a weight vector.",
        "We write 0act(i) to denote the feature representation extracted for action act at location i.",
        "The model is trained using a variant of the structured per-ceptron (Collins, 2002), similar to the algorithm of (Shen et al., 2007; Shen and Joshi, 2008).",
        "As usual, we use parameter averaging to prevent the percep-tron from overfitting.",
        "The training algorithm is initialized with a zero parameter vector w. The algorithm makes several passes over the data.",
        "At each pass, we apply the training procedure given in Algorithm 2 to every sentence in the training set.",
        "At training time, each sentence is parsed using the parsing algorithm and the current w. Whenever an invalid action is chosen by the parsing algorithm, it is not performed (line 6).",
        "instead, we update the parameter vector w by decreasing the weights of the features associated with the invalid action, and increasing the weights for the currently highest scoring valid action.",
        "We then proceed to parse the sentence with the updated values.",
        "The process repeats until a valid action is chosen.",
        "Note that each single update does not guarantee that the next chosen action is valid, or even different than the previously selected action.",
        "Yet, this is still an aggressive update procedure: we do not leave a sentence until our parameters vector parses it cor-",
        "act^Acts",
        "rectly, and we do not proceed from one partial parse to the next until w predicts a correct location/action pair.",
        "However, as the best ordering, and hence the best attachment point is not known to us, we do not perform a single aggressive update step.",
        "instead, our aggressive update is performed incrementally in a series of smaller steps, each pushing w away from invalid attachments and toward valid ones.",
        "This way we integrate the search of confident attachments into the learning process.",
        "Algorithm 2: Structured perceptron training for direction-less parser, over one sentence.",
        "Input: sentence,gold arcs,current w,feature",
        "representation <f> Output: weight vector w"
      ]
    },
    {
      "heading": "2. pending – sent",
      "text": []
    },
    {
      "heading": "3. while length(pending) > 1 do",
      "text": []
    },
    {
      "heading": "6. if choice G allowed then",
      "text": []
    },
    {
      "heading": "7. ( parent, child) – edgeFor (choice)",
      "text": [
        "8 Arcs.add( (parent, child) )"
      ]
    },
    {
      "heading": "9. pending .remove (child)",
      "text": [
        "good – arg max w • <f>act(j)"
      ]
    },
    {
      "heading": "14. return w",
      "text": [
        "Function isValid(action,Gold,Arcs)"
      ]
    },
    {
      "heading": "3. return false",
      "text": []
    },
    {
      "heading": "4. return true",
      "text": [
        "The function isValid(act(i), gold, arcs) (line 4) is used to decide if the chosen action/location pair is valid.",
        "it returns True if two conditions apply: (a) (pi,pj) is present in gold, (b) all edges (o,pj) in gold are also in arcs.",
        "In words, the function verifies that the proposed edge is indeed present in the gold parse and that the suggested daughter already found all its own daughters."
      ]
    },
    {
      "heading": "5. Feature Representation",
      "text": [
        "The feature representation for an action can take into account the original sentence, as well as the entire parse history: 4>act(i) above is actually 4>(act(i), sentence, Arcs,pending).",
        "We use binary valued features, and each feature is conjoined with the type of action.",
        "When designing the feature representation, we keep in mind that our features should not only direct the parser toward desired actions and away from undesired actions, but also provide the parser with means of choosing between several desired actions.",
        "We want the parser to be able to defer some desired actions until more structure is available and a more informed prediction can be made.",
        "This desire is reflected in our choice of features: some of our features are designed to signal to the parser the presence of possibly \"incomplete\" structures, such as an incomplete phrase, a coordinator without conjuncts, and so on.",
        "When considering an action ACTION(i), we limit ourselves to features of partial structures around the attachment point: pi-2,pi-i,pi,pi+i,pi+2,pi+3, that is the two structures which are to be attached by the action (pi and pi+i), and the two neighbouring structures on each side.",
        "While these features encode local context, it is local in terms of syntactic structure, and not purely in terms of sentence surface form.",
        "This let us capture some, though not all, long-distance relations.",
        "For a partial structure p, we use wp to refer to the head word form, tp to the head word POS tag, and lcp and rcp to the POS tags of the leftmost and rightmost child of p respectively.",
        "All our prepositions (IN) and coordinators (CC) are lexicalized: for them, tp is in fact wptp.",
        "We define structural, unigram, bigram and pp-attachment features.",
        "The structural features are: the length of the structures (lenp), whether the structure is a word (contains no children: ncp), and the surface distance between structure heads (APiPj ).",
        "The unigram and bigram features are adapted from the feature set for left-to-right Arc-Standard dependency parsing dedirectional algorithm.",
        "scribed in (Huang et al., 2009).",
        "We extended that feature set to include the structure on both sides of the proposed attachment point.",
        "In the case of unigram features, we added features that specify the POS of a word and its leftmost and rightmost children.",
        "These features provide the non-directional model with means to prefer some attachment points over others based on the types of structures already built.",
        "In English, the left-and rightmost POS-tags are good indicators of constituency.",
        "The pp-attachment features are similar to the bigram features, but fire only when one of the structures is headed by a preposition (IN).",
        "These features are more lexicalized than the regular bigram features, and include also the word-form of the rightmost child of the PP (rcWp).",
        "This should help the model learn lexicalized attachment preferences such as (hit, with-bat)."
      ]
    },
    {
      "heading": "6. Computational Complexity and Efficient Implementation",
      "text": [
        "The parsing algorithm (Algorithm 1) begins with n + 1 disjoint structures (the words of the sentence + ROOT symbol), and terminates with one connected structure.",
        "Each iteration of the main loop connects two structures and removes one of them, and so the loop repeats for exactly n times.",
        "The argmax in line 5 selects the maximal scoring action/location pair.",
        "At iteration i, there are n – i locations to choose from, and a naive computation of the argmax is O(n), resulting in an O(n ) algorithm.",
        "Each performed action changes the partial structures and with it the extracted features and the computed scores.",
        "However, these changes are limited to a fixed local context around the attachment point of the action.",
        "Thus, we observe that the feature extraction and score calculation can be performed once for each action/location pair in a given sentence, and reused throughout all the iterations.",
        "After each iteration we need to update the extracted features and calculated scores for only k locations, where k is a fixed number depending on the window size used in the feature extraction, and usually k <C n.",
        "Using this technique, we perform only (k + 1)n feature extractions and score calculations for each sentence, that is O(n) feature-extraction operations per sentence.",
        "Given the scores for each location, the argmax can then be computed in O(logn) time using a heap, resulting in an O(nlogn) algorithm: n iterations, where the first iteration involves n feature extraction operations and n heap insertions, and each subsequent iteration involves k feature extractions and heap updates.",
        "We note that the dominating factor in polynomial-time discriminative parsers, is by far the feature-extraction and score calculation.",
        "It makes sense to compare parser complexity in terms of these operations only.",
        "Table 1 compares the complexity of our parser to other dependency parsing frameworks.",
        "Structural",
        "for p in pi-2,Pi-i,Pi,Pi+i,Pi+2,Pi+3",
        "forP,q in (Pi-2,Pi-i),(Pi-i,Pi),(Pi,Pi+i),(Pi-",
        "+i,Pi + 2),(Pi+2,Pi+3)",
        "Unigram",
        "for p in Pi_2, Pi-i, Pi, Pi+1, Pi+2, Pi+3",
        "Bigram",
        "for P,q in (Pi, Pi+i),(Pi, Pi+2),(Pi-i,Pi),(Pi-i,Pi+2),(Pi+i,Pi+2)",
        "tptq , WpWq , tpWq , Wpt-q",
        "tptqICplCq , tptq rCp/Cq",
        "tptqlcprcq , i-pi-qrcprcq",
        "PP-Attachment",
        "if Pi is a preposition",
        "Wp{_ 1 rcpi , tp^_ 1 rcWpi",
        "if Pi+i is a preposition",
        "Wpi – \\Wpi+i rcpi+i î tpi-i Wpi+i rcWpi+i Wpi Wpi+i rcpi+i tpi Wpi+i rcWpi+i",
        "if Pi+2 is a preposition",
        "Wpi+i Wpi+2 rcpi+2 ' tpi+i Wpi+2 rcWpi+2",
        "Wpi Wpi + 2 rcpi+2 ' tpi Wpi + 2 rcWpi + 2",
        "Parser Runtime Features / Scoring",
        "NONDIR (This Work) O(nlogn) O(n)",
        "Table 1: Complexity of different parsing frameworks.",
        "Mst: first order MST parser, Mst2: second order MST parser, Malt: shift-reduce left-to-right parsing.",
        "Beam: beam search parser, as in (Zhang and Clark, 2008)",
        "In terms of feature extraction and score calculation operations, our algorithm has the same cost as traditional shift-reduce (MALT) parsers, and is an order of magnitude more efficient than graph-based (Mst) parsers.",
        "Beam-search decoding for left-to-right parsers (Zhang and Clark, 2008) is also linear, but has an additional linear dependence on the beam-size.",
        "The reported results in (Zhang and Clark, 2008) use a beam size of 64, compared to our constant of k = 6.",
        "Our Python-based implementation (the percep-tron is implemented in a C extension module) parses about 40 tagged sentences per second on an Intel based MacBook laptop."
      ]
    },
    {
      "heading": "7. Experiments and Results",
      "text": [
        "We evaluate the parser using the WSJ Treebank.",
        "The trees were converted to dependency structures with the Penn2Malt conversion program, using the head-finding rules from (Yamada and Matsumoto, 2003).We use Sections 2-21 for training, Section 22 for development, and Section 23 as the final test set.",
        "The text is automatically POS tagged using a trigram HMM based POS tagger prior to training and parsing.",
        "Each section is tagged after training the tagger on all other sections.",
        "The tagging accuracy of the tagger is 96.5 for the training set and 96.8 for the test set.",
        "While better taggers exist, we believe that the simpler HMM tagger overfits less, and is more representative of the tagging performance on non-WSJ corpus texts.",
        "Parsers We evaluate our parser against the transition-based Malt parser and the graph-based MST parser.",
        "We use version 1.2 of MALT parser, with the settings used for parsing English in the CoNLL 2007 shared task.",
        "For the Mst parser, we use the default first-order, projective parser settings, which provide state-of-the-art results for English.",
        "All parsers are trained and tested on the same data.",
        "Our parser is trained for 20 iterations.",
        "Evaluation Measures We evaluate the parsers using three common measures:",
        "(unlabeled) Accuracy: percentage of tokens which got assigned their correct parent.",
        "Root: The percentage of sentences in which the",
        "ROOT attachment is correct.",
        "Complete: the percentage of sentences in which all tokens were assigned their correct parent.",
        "Unlike most previous work on English dependency parsing, we do not exclude punctuation marks from the evaluation.",
        "Results are presented in Table 2.",
        "Our non-directional easy-first parser significantly outperforms the left-to-right greedy MALT parser in terms of accuracy and root prediction, and significantly outperforms both parsers in terms of exact match.",
        "The globally optimized MST parser is better in root-prediction, and slightly better in terms of accuracy.",
        "We evaluated the parsers also on the English dataset from the CoNLL 2007 shared task.",
        "While this dataset is also derived from the WSJ Treebank, it differs from the previous dataset in two important aspects: it is much smaller in size, and it is created using a different conversion procedure, which is more linguistically adequate.",
        "For these experiments, we use the dataset POS tags, and the same parameters as in the previous set of experiments: we train the non-directional parser for 20 iterations, with the same feature set.",
        "The CoNLL dataset contains some non-projective constructions.",
        "MALT and MST deal with non-projectivity.",
        "For the non-directional parser, we projectivize the training set prior to training using the procedure described in (Carreras, 2007).",
        "Results are presented in Table 3.",
        "Table 2: Unlabeled dependency accuracy on PTB Section 23, automatic POS-tags, including punctuation.",
        "While all models suffer from the move to the smaller dataset and the more challenging annotation scheme, the overall story remains the same: the non-directional parser is better than MAlT but not as good as MST in terms of parent-accuracy and root prediction, and is better than both Malt and Mst in terms of producing complete correct parses.",
        "That the non-directional parser has lower accuracy but more exact matches than the Mst parser can be explained by it being a deterministic parser, and hence still vulnerable to error propagation: once it erred once, it is likely to do so again, resulting in low accuracies for some sentences.",
        "However, due to the easy-first policy, it manages to parse many sentences without a single error, which lead to higher exact-match scores.",
        "The non-directional parser avoids error propagation by not making the initial error.",
        "On average, the non-directional parser manages to assign correct heads to over 60% of the tokens before making its first error.",
        "The Mst parser would have ranked 5 thin the shared task, and NonDir would have ranked 7th.",
        "The better ranking systems in the shared task are either higher-order global models, beam-search based systems, or ensemble-based systems, all of which are more complex and less efficient than the NONDIR parser.",
        "Parse Diversity The parses produced by the non-directional parser are different than the parses produced by the graph-based and left-to-right parsers.",
        "To demonstrate this difference, we performed an Oracle experiment, in which we combine the output of several parsers by choosing, for each sentence, the parse with the highest score.",
        "Results are presented",
        "Combination Accuracy Complete",
        "Table 4: Parser combination with oracle, choosing the highest scoring parse for each sentence of the test-set.",
        "in Table 4.",
        "A non-oracle blending of Malt+Mst+NonDir using Sagae and Lavie's (2006) simplest combination method assigning each component the same weight, yield an accuracy of 90.8 on the CoNLL 2007 English dataset, making it the highest scoring system among the participants.",
        "When we investigate the Pos category of mistaken instances, we see that for all parsers, nodes with structures of depth 2 and more which are assigned an incorrect head are predominantly PPs (headed by 'IN'), followed by NPs (headed by 'NN').",
        "All parsers have a hard time dealing with PP attachment, but Mst parser is better at it than NonDir, and both are better than Malt.",
        "Looking further at the mistaken instances, we notice a tendency of the PP mistakes of the NoNDiR parser to involve, before the PP, an NP embedded in a relative clause.",
        "This reveals a limitation of our parser: recall that for an edge to be built, the child must first acquire all its own children.",
        "This means that in case of relative clauses such as \"I saw the boy [who ate the pizza] with my eyes\", the parser must decide if the PP \"with my eyes\" should be attached to \"the pizza\" or not before it is allowed to build parts of the outer NP (\"the boy who.",
        ".",
        ".",
        "\").",
        "in this case, the verb \"saw\" and the noun \"boy\" are both outside of the sight of the parser when deciding on the PP attachment, and it is forced to make a decision in ignorance, which, in many cases, leads to mistakes.",
        "The globally optimized Mst does not suffer as much from such cases.",
        "We plan to address this deficiency in future work.",
        "Parser",
        "Accuracy",
        "Root",
        "Complete",
        "Malt",
        "88.36",
        "87.04",
        "34.14",
        "Mst",
        "90.05",
        "93.95",
        "34.64",
        "NONDIR (this work)",
        "89.70",
        "91.50",
        "37.50",
        "Malt+Mst",
        "92.29",
        "44.03",
        "NonDir+Malt",
        "92.19",
        "45.48",
        "NonDir+Mst",
        "92.53",
        "44.41",
        "NonDir+Mst+Malt",
        "93.54",
        "49.79",
        "CoNLL 2007",
        "Malt+Mst",
        "91.50",
        "33.64",
        "NonDir+Malt",
        "91.02",
        "34.11",
        "NonDir+Mst",
        "91.90",
        "34.11",
        "NonDir+Mst+Malt",
        "92.70",
        "38.31",
        "Parser",
        "Accuracy",
        "Root",
        "Complete",
        "Malt",
        "85.82",
        "87.85",
        "24.76",
        "Mst",
        "89.08",
        "93.45",
        "24.76",
        "NONDIR (this work)",
        "88.34",
        "91.12",
        "29.43"
      ]
    },
    {
      "heading": "8. Related Work",
      "text": [
        "Deterministic shift-reduce parsers are restricted by a strict left-to-right processing order.",
        "such parsers can rely on rich syntactic information on the left, but not on the right, of the decision point.",
        "They are forced to commit early, and suffer from error propagation.",
        "Our non-directional parser addresses these deficiencies by discarding the strict left-to-right processing order, and attempting to make easier decisions before harder ones.",
        "other methods of dealing with these deficiencies were proposed over the years: Several Passes Yamada and Matsumoto's (2003) pioneering work introduces a shift-reduce parser which makes several left-to-right passes over a sentence.",
        "Each pass adds structure, which can then be used in subsequent passes.",
        "sagae and Lavie (2006b) extend this model to alternate between left-to-right and right-to-left passes.",
        "This model is similar to ours, in that it attempts to defer harder decisions to later passes over the sentence, and allows late decisions to make use of rich syntactic information (built in earlier passes) on both sides of the decision point.",
        "However, the model is not explicitly trained to optimize attachment ordering, has an O(n) runtime complexity, and produces results which are inferior to current single-pass shift-reduce parsers.",
        "Beam Search several researchers dealt with the early-commitment and error propagation of deterministic parsers by extending the greedy decisions with various flavors of beam-search (Sagae and Lavie, 2006a; Zhang and Clark, 2008; Titov and Henderson, 2007).",
        "This approach works well and produces highly competitive results.",
        "Beam search can be incorporated into our parser as well.",
        "We leave this investigation to future work.",
        "strict left-to-right ordering is also prevalent in sequence tagging.",
        "Indeed, one major influence on our work is Shen et.al.",
        "'s bidirectional POS-tagging algorithm (shen et al., 2007), which combines a perceptron learning procedure similar to our own with beam search to produce a state-of-the-art POStagger, which does not rely on left-to-right processing.",
        "Shen and Joshi (2008) extends the bidirectional tagging algorithm to LTAG parsing, with good results.",
        "We build on top of that work and present a concrete and efficient greedy non-directional dependency parsing algorithm.",
        "Structure Restrictions Eisner and smith (2005) propose to improve the efficiency of a globally optimized parser by posing hard constraints on the lengths of arcs it can produce.",
        "such constraints pose an explicit upper bound on parser accuracy.Our parsing model does not pose such restrictions.",
        "shorter edges are arguably easier to predict, and our parses builds them early in time.",
        "However, it is also capable of producing long dependencies at later stages in the parsing process.",
        "Indeed, the distribution of arc lengths produced by our parser is similar to those produced by the Malt and Mst parsers."
      ]
    },
    {
      "heading": "9. Discussion",
      "text": [
        "We presented a non-directional deterministic dependency parsing algorithm, which is not restricted by the left-to-right parsing order of other deterministic parsers.",
        "Instead, it works in an easy-first order.",
        "This strategy allows using more context at each decision.",
        "The parser learns both what and when to connect.",
        "We show that this parsing algorithm significantly outperforms a left-to-right deterministic algorithm.",
        "While it still lags behind globally optimized parsing algorithms in terms of accuracy and root prediction, it is much better in terms of exact match, and much faster.",
        "As our parsing framework can easily and efficiently utilize more structural information than globally optimized parsers, we believe that with some enhancements and better features, it can outperform globally optimized algorithms, especially when more structural information is needed, such as for morphologically rich languages.",
        "Moreover, we show that our parser produces different structures than those produced by both left-to-right and globally optimized parsers, making it a good candidate for inclusion in an ensemble system.",
        "Indeed, a simple combination scheme of graph-based, left-to-right and non-directional parsers yields state-of-the-art results on English dependency parsing on the CoNLL 2007 dataset.",
        "We hope that further work on this non-directional parsing framework will pave the way to better understanding of an interesting cognitive question: which kinds of parsing decisions are hard to make, and which linguistic constructs are hard to analyze?"
      ]
    }
  ]
}
