{
  "info": {
    "authors": [
      "Stergos Afantenos",
      "Nicholas Asher"
    ],
    "book": "COLING",
    "id": "acl-C10-1001",
    "title": "Testing SDRT’s Right Frontier",
    "url": "https://aclweb.org/anthology/C10-1001",
    "year": 2010
  },
  "references": [
    "acl-P09-1075"
  ],
  "sections": [
    {
      "text": [
        "Testing SDRT's Right Frontier",
        "Stergos D. Afantenos and Nicholas Asher",
        "Institut de recherche en informatique de Toulouse (IRIT), CNRS, Université Paul Sabatier (stergos.afantenos, nicholas.asher}@irit.fr",
        "The Right Frontier Constraint (rfc), as a constraint on the attachment of new constituents to an existing discourse structure, has important implications for the interpretation of anaphoric elements in discourse and for Machine Learning (ml)ap-proaches to learning discourse structures.",
        "In this paper we provide strong empirical support for sdrt's version of rfc.The analysis of about 100 doubly annotated documents by five different naive annotators shows that sdrt's rfc is respected about 95% of the time.",
        "The qualitative analysis of presumed violations that we have performed shows that they are either click-errors or structural misconceptions."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A cognitively plausible way to view the construction of a discourse structure for a text is an incremental one.",
        "Interpreters integrate discourse constituent n into the antecedently constructed discourse structure D for constituents to n – 1 by linking n to some constituent in D with a discourse relation.",
        "sdrt's Right Frontier Constraint (rfc) (Asher, 1993; Asher and Lascarides, 2003) says that a new constituent n cannot attach to an arbitrary node in D. Instead it must attach to either the last node entered into the graph or one of the nodes that dominate this last node.",
        "Assuming that the last node is usually found on the right of the structure, this means that the nodes available for attachment occur on the right frontier (rf)of the discourse graph or sdrs.",
        "Researchers working in different theoretical paradigms have adopted some form of this constraint.",
        "Polanyi (1985; 1988) originally proposed the rfc as a constraint on antecedents to anaphoric pronouns.",
        "sdrt generalizes this to a condition on all anaphoric elements.",
        "As the attachment of new information to a contextually given discourse graph in sdrt involves the resolution of an anaphoric dependency, rfc furnishes a constraint on the attachment problem.",
        "(Webber, 1988; Mann and Thompson, 1987; 1988) have also adopted versions of this constraint.",
        "But there are important differences.",
        "While sdrt and rst both take rfc as a constraint on all discourse attachments (in dltag, in contrast, anaphoric discourse particles are not limited to finding an antecedent on the rf), sdrt's notion of rf is substantially different from that of rst's or Polanyi's, because sdrt's notion of a rf depends on a 2-dimensional discourse graph built from coordinating and subordinating discourse relations.",
        "Defining rfc with respect to SDRT's 2-dimensional graphs allows the rf to contain discourse constituents that do not include the last constituent entered into the graph (in contrast to rst).",
        "sdrt also allows for multiple attachments of a constituent to the rfc.",
        "sdrt's rfc has important implications for the interpretation of various types of anaphoric elements: tense (Lascarides and Asher, 1993), ellipsis (Hardt et al., 2001; Hardt and Romero, 2004; Asher, 2007), as well as pronouns referring to individuals and abstract entities (Asher, 1993; Asher and Lascarides, 2003).",
        "The rfc, we believe, will also benefit ml approaches to learning discourse structures, as a constraint limiting the search space for possible discourse attachments.",
        "Despite its importance, sdrt's rfc has never been empirically validated, however.",
        "We present evidence in this paper providing strong empirical support for sdrt's version of the constraint.",
        "We have chosen to study sdrt's notion of a rf, because of sdrt's greater expressive power over rst (Danlos, 2008), the greater generality of sdrt's definition of RFC, and because of sdrt's greater theoretical reliance on the constraint for making semantic predictions.",
        "SDRT also makes theoretically clear why the RFC should apply to discourse relation attachment, since it treats discourse structure construction as a dynamic process in which all discourse relations are essentially anaphors.",
        "The analysis of about 100 doubly annotated documents by five different naive annotators shows that this constraint, as defined in SDRT, is respected about 95% of the time.",
        "The qualitative analysis of the presumed violations that we have performed shows that they are either click-errors or structural misconceptions by the annotators.",
        "Below, we give a formal definition of sdrt's RFC; section 3 explains our annotation procedure.",
        "Details of the statistical analysis we have performed are given in section 4, and a qualitative analysis is provided in section 5.",
        "Finally, section 6 presents the implications of the empirical study for ML techniques for the extraction of discourse structures while sections 7 and 8 present the related work and conclusions."
      ]
    },
    {
      "heading": "2. The Right Frontier Constraint in SDRT",
      "text": [
        "In SDRT, a discourse structure or SDRS (Segmented Discourse Representation Structure) is a tuple <A, F, last >,where A is the set of labels representing the discourse constituents of the structure, last G A the last introduced label and F a function which assigns each member of A a well-formed formula of the SDRS language (defined (Asher and Lascarides, 2003, p 138)).",
        "sdrss correspond to A expressions with a continuation style semantics.",
        "SDRT distinguishes coordinating and subordinating discourse relations using a variety of linguistic tests (Asher and Vieu, 2005), and isolates structural relations (Parallel and Contrast) based on their semantics.",
        "The RF is the set of available attachment points to which a new utterance can be attached.",
        "What this set includes depends on the discourse relation used to make the attachment.",
        "Here is the definition from (Asher and Lascarides, 2003, p 148).",
        "Suppose that a constituent ß is to be attached to a constituent in the SDRS with a discourse relation other than Parallel or Contrast.",
        "Then the available attachment points for ß are:"
      ]
    },
    {
      "heading": "1.. The label a = LAST;",
      "text": []
    },
    {
      "heading": "2.. Any label 7 such that:",
      "text": [
        "(b) R(y, a) is a conjunct in F (A) for some label A,where R is a subordinating discourse relation.",
        "We gloss this as a<7."
      ]
    },
    {
      "heading": "3.. Transitive Closure:",
      "text": [
        "We can represent an sdrs as a graph G, whose nodes are the labels of the sdrss constituents and whose typed arcs represent the relations between them.",
        "The nodes available for attachment ofa new element ß in G are the last introduced node last and any other node dominating LAST, where the notion of domination should be understood as the transitive closure over the arrows given by subordinating relations or those holding between a complex segment and its parts.",
        "Subordinating relations like Elaboration extend the vertical dimension of the graph, whereas coordinating relations like Narration expand the structure horizontally.",
        "The graph of every sdrs has a unique top label for the whole structure or formula; however, there may be multiple < paths defined within a given SDRS, allowing for multiple parents, in the terminology of (Wolf and Gibson, 2006).",
        "Furthermore, SDRT allows for multiple arcs between constituents and attachments to multiple constituents on the RFC, making for a very rich structure.",
        "SDRT's RFC is restricted to non-structural relations, because structural relations postulate a partial isomorphism from the discourse structure of the second constituent to the discourse structure of the first, which provides its own attachment possibilities for subconstituents of the two related structures (Asher, 1993).",
        "Sometimes such parallelism or contrast, also known as discourse subordination (Asher, 1993), can be enforced in a long",
        "distance way by repeating the same wording in the two constituents.",
        "RFC has the name it does because the segments that belong on this set (the 7s in the above definition) are typically nodes on a discourse graph which are geometrically placed at the RF of the graph.",
        "Consider the following example embellished from Asher and Lascarides (2003):",
        "(1) (n1 ) John had a great evening last night.",
        "(n2)Hefirst had a great meal at Michel Sarran.",
        "(n3)Heate profiterolles de foie gras, (n4) which is a specialty of the chef.",
        "He had the lobster, (n6) which he had been dreaming about for weeks.",
        "(n7)Hethenwent out to a several swank bars.",
        "The graph of the sdrs for 1 looks like this:",
        "\\ Elaboration „, .Narration Elaboration arration ^Background",
        "where n' and n\" represent complex segments.",
        "Given that the last introduced utterance is represented by the node n7, the set of nodes that are on the rf are n7 (last), n' (the complex segment that includes n7)and n1 (connected via a subordinating relation to n').",
        "All those nodes are geometrically placed at the RF of the graph.",
        "sdrt's notion of a rf is more general than rst's or dltag's.",
        "First, sdrss can have complex constituents with multiple elements linked by coordinate relations that serve as arguments to other relations, thus permitting instances of shared structure that are difficult to capture in a pure tree notation (Lee et al., 2008).",
        "In addition, in RST the RF picks out the adjacent constituents, LAST and complex segments including LAST.",
        "Contrary to RST, SDRT,as it uses 2-dimensional graphs, predicts that an available attachment point for n7 is the non local and non adjacent n2, which is distinct from the complex constituent consisting of n2 to n6 This difference is crucial to the interpretation of the Narration:",
        "Narration claims a sequence of two events; making the complex constituent (essentially a sub-sdrs) an argument of Narration, as rst does, makes it difficult to recover such an interpretation.",
        "Danlos's (2008) interpretation of the Nu-clearity Principle provides an interpretation of the Narration([2-4],5) that is equivalent to the sdrs graph above.",
        "But even an optional Nuclearlity Principle interpretation won't help with discourse structures like (2) where the backgrounding material in n4 and the commentary in n6 do not and cannot figure as part of the Elaboration for semantic reasons.",
        "In our corpus described below, over 20% of the attachments were non adjacent; i.e. the attachment point for the new material did not include last.",
        "A further difference between sdrt and other theories is that, as sdrt's rfc is applied recursively over complex segments within a given SDRS, many more attachment points are available in sdrt.",
        "E.g., consider the sdrs for this example, adapted from (Wolf and Gibson, 2006):",
        "(3) Mary wanted garlic and thyme.",
        "(n2)She also needed basil.",
        "(n3) The recipe called for them.",
        "(n4) The basil would be hard to come by this time ofyear.",
        "Parallel",
        "Explanation ^E-elab",
        "Because n is the complex segment consisting of ni and n2, attachment to n with a subordinating discourse relation permits attachment n's open constituents as well."
      ]
    },
    {
      "heading": "3. Annotated Corpus",
      "text": [
        "Our corpus comes from the discourse structure annotation project ANNODIS which represents an on going effort to build a discourse graph bank for French texts with the twofold goal of testing various theoretical proposals about discourse",
        "resent many examples with Elaboration that involve crossing dependencies in Wolfand Gibson s (2006) representation without violation of the RFC.",
        "structure and providing a seed corpus for learning discourse structures using ml techniques.",
        "ann-odis's annotation manual provides detailed instructions about the segmentation of a text into Elementary Discourse Units (edus).",
        "edus correspond often to clauses but are also introduced by frame adverbials, appositive elements, correlative constructions ([the more you work,] [the more you earn]), interjections and discourse markers within coordinated VPs [John denied the charges] [but then later admitted his guilt].",
        "Appositive elements often introduce embedded edus; e.g., [Jim Powers, [President ofthe University ofTexas at Austin], resigned today.",
        "], which makes our segmentation more fine-grained than Wolf and Gibson's (2006) or annotation schemes for RST or the PDTB.",
        "The manual also details the meaning of discourse relations but says nothing about the structural postulates of sdrt.",
        "For example, there is no mention of the rfc in the manual and very little about hierarchical structure.",
        "Subjects were told to put whatever discourse relations from our list above between constituents they felt were appropriate.",
        "They were also told that they could group constituents together whenever they felt that as a whole they jointly formed the term of a discourse relation.",
        "We purposely avoided making the manual too restrictive, because one of our goals was to examine how well sdrt predicts the discourse structure of subjects who have little knowledge of discourse theories.",
        "In total 5 subjects with little to no knowledge of discourse theories that use rfc participated in the annotation campaign.",
        "Three were undergraduate linguistics students and two were graduate linguistics students studying different areas.",
        "The 3 undergraduates benefitted from a completed and revised annotation manual.",
        "The two graduate students did their annotations while the annotation manual was undergoing revisions.",
        "All in all, our annotators doubly annotated about 100 French newspaper texts and Wikipedia articles.",
        "Subjects first segmented each text into edus, and then they were paired off and compared their segmentations, resolving conflicts on their own or via a supervisor.",
        "The annotation of the discourse relations was performed by each subject working in isolation.",
        "annodis provided a new state of the art tool, glozz, for discourse annotation for the three undergraduates.",
        "With glozz annotators could isolate sections of text corresponding to several edus, and insert relations between selected constituents using the mouse.",
        "Though it did portray relations selected as lines between parts ofthe text, glozz did not provide a discourse graph or sdrs as part of its graphical interface.",
        "The representation often yielded a dense number of lines between segments that annotators and evaluators found hard to read.",
        "The inadequate interline spacing in glozz also contributed to certain number of click errors that we detail below in the paper.",
        "The statistics on the number of documents, edus and relations provided by each annotator are in table 1."
      ]
    },
    {
      "heading": "4. Experiments and Results",
      "text": [
        "Using annodis's annotated corpus, we checked for all edus n, whether n was attached to a constituent in the sdrs built from the previous edus in a way that violated the rfc.",
        "Given a discourse as a series of edus n1,n2,...,nn, we constructed for each m the corresponding sub-graph and calculated the set of nodes on the rf of this subgraph.",
        "We then checked whether the edu was attached to a node that was found in this set.",
        "We also checked whether any newly created complex segment was attached to a node on the rf of this sub-graph.",
        "To calculate the nodes on the rf, we slightly extended the annotated graphs, in order to add implied relations left out by the annotators.",
        "Disconnected Graphs While checking the rfc for the attachment of a node n, the sdrs graph at this point might consist of 2 or more disjoint subgraphs which get connected together at a later point.",
        "Because we did not want to decide which way these graphs should be connected, we defined a right frontier for each one using its own last.",
        "We then calculated the rf for each one of them and set the set of available nodes to be those in the union of the rfs of the disjoint subgraphs.",
        "If the subgraphs were not connected at the end of the incremental process in a way that conformed to rfc, we counted this as a violation.",
        "Annotators did not always provide us with a connected graph.",
        "annotator",
        "#Docs",
        "# EDUs",
        "# Relations",
        "undergrad 1",
        "27",
        "1342",
        "1216",
        "undergrad 2",
        "31",
        "1378",
        "1302",
        "undergrad 3",
        "31",
        "1376",
        "1173",
        "grad 1",
        "47",
        "1387",
        "1390",
        "grad 2",
        "48",
        "1314",
        "1321",
        "Postponed Decisions sdrt allows for the attachment not only of edus but also of subgraphs to an available node in the contextually given sdrs.",
        "For instance, in the following example, the intended meaning is given by the graph in which the Contrast is between the first label and the complex constituent composed of the disjunction of n2and n3.",
        "(n1 ) Bill doesn't like sports.",
        "(n2) But Sam does.",
        "(n3) Or John does.",
        "Altern.",
        "Naive annotators attached subgraphs instead of edus to the rf with some regularity (around 2%).",
        "This means that an edu could be attached to a node that was not present in the subgraph produced by There were two main reasons for this: (1) came from a syntactically fronted clause, a parenthetical or apposition in a sentence whose main clause produced ni+2 and Hi+1 was attached to ni+2;(2) was attached to a complex segment ,...] which was not yet introduced in the subgraph.",
        "Since the nodes to which is attached in such cases are not present in the graph, by definition they are not in the rf and they could be counted as violations.",
        "Nonetheless, if the nodes which connect nodes like eventually link up to the incrementally built sdrs in the right way, 7ri+1 might eventually end up linked to something on the rf.",
        "For this reason, we postponed the decision on nodes like until the nodes to which they are attached were explicitly introduced in the sdrs.",
        "The Coherence of Complex Segments In an sdrs, several edus may combine to form a complex segment a that serves as a term for a discourse relation R. The interpretation of the sdrs implies that all of a s constituents contribute to the rhetorical function specified by R. This implies that the coordinating relation Continuation holds between the edus inside a, unless there is some other relation between them that is incompatible with Continuation (like a subordinating relation).",
        "Continuations are often used in sdrt (Asher, 1993; Asher and Lascarides, 2003).",
        "During the annotation procedure, our subjects did not always explicitly link the edus within a complex segment.",
        "In order to enforce the coherence of those complex segments we added Continuation relations between the constituents of a complex segment unless there was already another path between those constituents.",
        "Expanding Continuations Consider the following discourse:",
        "(4) [John, [who owns a chain of restaurants] n2, [and is a director of a local charity organization,] n3 wanted to sell his yacht.",
        "]ni [He couldn't afford it anymore.",
        "]n4",
        "Annotators sometimes produced the following sdrt graph for the first three edus of this discourse:",
        "Continuation",
        "In this case the only open node is n3 due to the coordinating relation Continuation.",
        "Nonetheless, n4 should be attached to n1, without violating the rfc.",
        "Indeed, sdrt's definition of the Continuation relation enforces that if we have R(n1,n2) and Continuation(n2,n3) then we actually have the complex segment [n2,n3] with R(n1, [n2,n3]).",
        "So there is in fact a missing complex segment in (5).",
        "The proper sdrs graph of (4) is:",
        "annotator Continuation",
        "which makes n1 an available attachment site for n4.",
        "Such implied constituents have been added to the sdrs graphs.",
        "Factoring Related to the operation of Expansion, sdrt's definition of Continuation and various subordinating relations also requires that if we have R(a, [n1,n2,...,nn]) where [n1 ,n2 is a complex segment with",
        "n1 ,...nn linked by Continuation and R is Elaboration, Entity-Elaboration, Frame, Attribution, or Commentary, then we also have R(a, ni) for each i.",
        "We added these relations when they were missing.",
        "With the operations just described, we added several inferred relations to the graph.",
        "We then calculated statistics concerning the percentage of attachments for which the rfc is respected using the following formula:",
        "# edus attached to the RF # edus in total",
        "As we explained, an edu can be attached to an sdrt graph directly by itself or indirectly as part of a bigger complex segment.",
        "In order to calculate the nominator we determine first whether an edu directly attaches to the graph's rf, and if that fails we determine whether it is part of a larger complex segment which is attached to the graph s rf.",
        "The results obtained are shown in the first two columns of table 2.",
        "The rfc is respected by at least some attachment decision 95% of the time – i.e., 95% of the edus get attached to another node that is found on the rf.",
        "The breakdown across our annotators is given in table 2.",
        "sdrt allows for multiple attachments of an edu to various nodes in an sdrs; e.g. while an edu may be attached via one relation to a node on the rf, it may be attached to another node off the rf.",
        "To take account of all the attachments for a given edu, we need another way of measuring the percentage of attachments that respects the rfc.",
        "So we counted the ways each edu is related to a node in the sdrs for the previous text and then divided the number of attachment decisions that respect the rfc by the total number of attachment decisions – i.e.",
        ":",
        "# RF attachment decisions # Total attachment decisions",
        "RFCEDU I RFCr undergrad 1 undergrad 2 undergrad 3 grad 1 grad 2",
        "Mean for all annotators Mean for 3 undergrad",
        "Table 2: The % with which each annotator has respected sdrt's rfc using the edu and attachment decision measures.",
        "The third column of table 2 shows that having a stable annotation manual and glozz improved the results across our two annotator populations, even though the annotation manual did not say anything about rfc or about the structure of the discourse graphs.",
        "Moreover, the distribution of violations of the rfc follows a power law and only 4.56% of the documents contained more than 5 violations.",
        "This is strong evidence that there is little propagation of violations."
      ]
    },
    {
      "heading": "5. Analysis of Presumed Violations",
      "text": [
        "Although 95% of edus attach to nodes on the rf of an sdrt graph, 5% of edus don't.",
        "sdrt experts performed a qualitative analysis of some of these presumed violations.",
        "In many cases, the experts judged that the presumed violations were due to click-errors: sometimes the annotators simply clicked on something that did not translate into a segment.",
        "Sometimes, the experts judged that the annotators picked the wrong segment to attach a new segment or the wrong type of relation during the construction of the sdrt graph.",
        "For example, in the graph that follows the relation between segments 74 and 75 is not a Comment but an Entity-Elaboration.",
        "Continuation",
        "As expected, there were also \"structural\" errors, arising from a lack or a misuse of complex segments.",
        "Here is a typical example (translated from the original French):",
        "[Around her,]_74 [we should mention Joseph Racaille]_75 [responsible for the magnificent ar-rangements,]_76 [Christophe Dupouy]_77 [regular associate of Jean-Louis Murat responsible for mixing,]_78 [without forgetting her two guardian angels:]_79 [her agent Olivier Gluz-man]_80 [who signed after a love at first sight,]_81 [and her husband Mokhtar]_82 [who has taken care of the family]_83",
        "Here is the annotated structure up to EDU 78:",
        "\\fE-elab",
        "Note that the attachment of 77 to 75 is non-local and non-adjacent.",
        "The annotator then attaches EDU 79 to 75 which is blocked from the RF due to the Continuation coordinating relation.",
        "By not having created a complex segment due the enumeration that includes EDUs 75 to 78, the annotator had no option but to violate the RF.",
        "Here is the proper SDRT graph for segments 74 to 79 (where the attachment of 79 to 74 is also both non-local and non-adjacent): 74",
        "ntinuation",
        "In this case, before the introduction of EDU 79, edu 78 is last and by consequence 77,n and 74 are on the RF.",
        "Attaching 79 to 74 is thus legitimate.",
        "We also found more interesting examples of right frontier violations.",
        "One annotator produced a graph for a story which is about the attacks of 9/11/2001 and is too long to quote here.",
        "A simplified graph of the first part of the story is shown below.",
        "EDU 4 elaborates on the main event of the story but it is not on the RF for 19.",
        "However, 19 is the first recurrence of the complex definite description le 11 septembre 2001 since the title and the term's definition in EDU 4.",
        "x IC omment",
        "This reuse of the full definite description could be considered a case of sdrt's discourse subordination."
      ]
    },
    {
      "heading": "6. RFC and distances of attachment",
      "text": [
        "Our empirical study vindicates sdrt's RFC,but it also has computational implications.",
        "Using the RFC dramatically diminishes the number of attachment possibilities and thus greatly reduces the search space for any incremental discourse parsing algorithm.",
        "The mean of nodes that are open on the RF at any given moment on our ANNODIS data is 16.43% of all the nodes in the graph.",
        "Our data also allowed us to calculate the distance of attachment sites from last, which could be an important constraint on machine learning algorithms for constructing discourse structures.",
        "Given a pair of constituents ) distance is calculated either textually (the number of intervening EDUs between ni and nj)or topologically (the length the shortest path between ni and nj).",
        "Topological distance, however, does not take into account the fact that a textually further segment is cognitively less salient.",
        "Moreover, this measure can give the same distance to nodes that are textually far away between them due to long distance pop-ups (Asher and Lascarides, 2003).",
        "A purely textual distance, on the other hand, gives the same distance to an edu ni and a complex segment even if n1 and ni are textually distant (since both have the same span end).",
        "We used a measure combining both.",
        "The distance scheme that we used assigns to each EDU its textual distance from LAST in the graph under consideration, while a complex segment of rank 1 gets a distance which is computed from the highest distance of their constituent EDUs plus 1.",
        "For a constituent a of rank n we have:",
        "\\C omment",
        "The distribution of attachment follows a power law with 40% of attachments performed non-locally, that is on segments of distance 2 or more (figure 1).",
        "This implies that the distance between candidate attachment sites that are on the RF is an important feature for an ML algorithm.",
        "It is important to note at this point that following the baseline approach of always attaching on the last misses 40% of attachments.",
        "We also have 20.38% of the non-local, non-adjacent attachments in our annotations.",
        "So an RST parser using Marcu's (2000) adjacency constraint as do duVerle and Prendinger (2009) would miss these.",
        "Attachment distance",
        "Several studies have shown that the RFC may be violated as an anaphoric constraint when there are other clues, content or linguistic features, that determine the antecedent.",
        "(Poesio and di Euge-nio, 2001; Holler and Irmen, 2007; Asher, 2008; Prévot and Vieu, 2008), for example, show that anaphors such as definite descriptions and complex demonstratives, which often provide enough content on their own to isolate their antecedents, or pronouns in languages like German which must obey gender agreement, might remain felicitous although the discourse relations between them and their antecedents might violate the RFC.",
        "Usually there are few linguistic clues that help find the appropriate antecedent to a discourse relation, in contrast to the anaphoric expressions mentioned above.",
        "Exceptions involve stylistic devices like direct quotation that license discourse subordination.",
        "Thus, SDRT predicts that RFC violations for discourse attachments should be much more rare than those for the resolution of anaphors that provide linguistic clues about their antecedents.",
        "As regards other empirical validation of various versions of the RFC for the attachment of discourse constituents, Wolf and Gibson (2006) show an RST-like RFC is not supported in their corpus GraphBank.",
        "Our study concurs in that some 20% of the attachments in our corpus cannot be formulated in RST.",
        "On the other hand, we note that because of the 2 dimensional nature of sdrt graphs and because of the caveats introduced by structural relations and discourse subordination, the counterexamples from GraphBank against, say, RST representations do not carry over straightforwardly to sdrss.",
        "In fact, once these factors are taken into account, the RFC violations in our corpus and in GraphBank are roughly about the same."
      ]
    },
    {
      "heading": "8. Conclusions",
      "text": [
        "We have shown that sdrt's rfc has strong empirical support: the attachments of our 3 completely naive annotators fully comply with RFC 91.7% of the time and partially comply with it 96% of the time.",
        "As a constraint on discourse parsing SDRT's RFC, we have argued, is both empirically and computationally motivated.",
        "We have also shown that non-local attachments occur about 40% of the time, which implies that attaching directly on the LAST will not yield good results.",
        "Further, many of the non local attachments do not respect rst's adjacency constraint.",
        "We need sdrt's rfc to get the right attachment points for our corpus.",
        "We believe that empirical studies of the kind we have given here are essential to finding robust and useful features that will vastly improve discourse parsers.",
        "60",
        "0 1 1 1 1 1 1 1 1 1 _",
        "P",
        "e",
        "50",
        "\" 1 \"",
        "r c",
        "40",
        "-1 -",
        "e n",
        "30",
        "- 1 -",
        "t",
        "a",
        "20",
        "- 1 -",
        "g",
        "e",
        "10 0",
        " – |0>°00N0000000000000"
      ]
    }
  ]
}
