{
  "info": {
    "authors": [
      "Carina Silberer",
      "Simone Paolo Ponzetto"
    ],
    "book": "Workshop on Semantic Evaluations (SemEval)",
    "id": "acl-S10-1027",
    "title": "UHD: Cross-Lingual Word Sense Disambiguation Using Multilingual Co-Occurrence Graphs",
    "url": "https://aclweb.org/anthology/S10-1027",
    "year": 2010
  },
  "references": [
    "acl-J03-1002",
    "acl-P09-1030",
    "acl-W06-1669",
    "acl-W09-2413"
  ],
  "sections": [
    {
      "text": [
        "UHD: Cross-Lingual Word Sense Disambiguation Using Multilingual Co-occurrence Graphs",
        "Carina Silberer and Simone Paolo Ponzetto",
        "{silberer,ponzetto}@cl.uni-heideIberg.de",
        "We describe the University of Heidelberg (UHD) system for the Cross-Lingual Word Sense Disambiguation SemEval-2010 task (CL-WSD).",
        "Lhe system performs CL-WSD by applying graph algorithms previously developed for monolingual Word Sense Disambiguation to multilingual cooccurrence graphs.",
        "UHD has participated in the Best and out-of-frve (OOL) evaluations and ranked among the most competitive systems for this task, thus indicating that graph-based approaches represent a powerful alternative for this task."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Lhis paper describes a graph-based system for Cross-Lingual Word Sense Disambiguation, i.e. the task of disambiguating a word in context by providing its most appropriate translations in different languages (Lefever and Hoste, 2010, CL-WSD henceforth).",
        "Our goal at SemEval-2010 was to assess whether graph-based approaches, which have been successfully developed for monolingual Word Sense Disambiguation, represent a valid framework for CL-WSD.",
        "Lhese typically transform a knowledge resource such as WordNet (Fell-baum, 1998) into a graph and apply graph algorithms to perform WSD.",
        "In our work, we follow this line of research and apply graph-based methods to multilingual co-occurrence graphs which are automatically created from parallel corpora."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Our method is heavily inspired by previous proposals from Véronis (2004, Hyperlex) and Agirre et al.",
        "(2006).",
        "Hyperlex performs graph-based",
        "WSD based on co-occurrence graphs: given a monolingual corpus, for each target word a graph is built where nodes represent content words co-occurring with the target word in context, and edges connect the words which co-occur in these contexts.",
        "Lhe second step iteratively selects the node with highest degree in the graph (root hub) and removes it along with its adjacent nodes.",
        "Each such selection corresponds to isolating a high-density component of the graph, in order to select a sense of the target word.",
        "In the last step the root hubs are linked to the target word and the Minimum Spanning Lree (MSL) of the graph is computed to disambiguate the target word in context.",
        "Agirre et al.",
        "(2006) compare Hyperlex with an alternative method to detect the root hubs based on PageRank (Brin and Page, 1998).",
        "PageRank has the advantage of requiring less parameters than Hyperlex, whereas the authors ascertain equal performance of the two methods."
      ]
    },
    {
      "heading": "3. Graph-based Cross-Lingual WSD",
      "text": [
        "We start by building for each target word a multilingual co-occurrence graph based on the target word's aligned contexts found in parallel corpora (Sections 3.1 and 3.2).",
        "Multilingual nodes are linked by translation edges, labeled with the target word's translations observed in the corresponding contexts.",
        "We then use an adapted PageRank algorithm to select the nodes which represent the target word's different senses (Section 3.3) and, given these nodes, we compute the MSL, which is used to select the most relevant words in context to disambiguate a given test instance (Section 3.4).",
        "Lranslations are finally given by the incoming translation edges of the selected context words.",
        "Let Cs be all contexts of a target word w in a source language s, i.e. English in our case, within a (PoS-tagged and lemmatized) monolingual corpus.",
        "We first construct a monolingual cooccurrence graph G g = (VS,ES).",
        "We collect all pairs (cwi,cwj) of co-occurring nouns or adjectives in Cs (excluding the target word itself) and add each word as a node into the initially empty graph.",
        "Each co-occurring word pair is connected with an edge (vi,Vj) g Es, which is assigned a weight w(vi, Vj) based on the strength of association between the respective words cwi and cwj :",
        "w(vi,Vj) = 1 – max [p(cwi\\cwj),p(cwj\\cwi)].",
        "Lhe conditional probability of word cwi given word cwj is estimated by the number of contexts in which cwi and cwj co-occur divided by the number of contexts containing cwj.",
        "Given a set of target languages L, we then extend G g to a labeled multilingual graph G ml = (Vml,Eml) where:",
        "1 • y m l = Vs u UieL ^ is a set °f n°des representing content words from either the source (Vs) or the target (Vi) languages;",
        "2.",
        "EML = Es u \\JleL{Ei u E*,i} is a set ofedges.",
        "Lhese include (a) co-occurrence edges Ei ÇVixVi between nodes representing words in a target language (Vi), weighted in the same way as the edges in the monolingual graph; (b) labeled translation edges Esj which represent translations of words from the source language into a target language.",
        "Lhese edges are assigned a complex label t g Twj comprising a translation of the word w in the target language I and its frequency of translation, i.e. Es,i ç^x Tw>i x Vh",
        "Lhe multilingual graph is built based on a word-aligned multilingual parallel corpus and a multilingual dictionary.",
        "Lhe pseudocode is presented in Algorithm 1.",
        "We start with the monolingual graph from the source language (line 1) and then for each target language l g L in turn, we add the translation edges (vs,t,vi) g Esj of each word in the source language (lines 5-15).",
        "In order to include the information about the translations of w in the different target languages, each translation edge Algorithm 1 Multilingual co-occurrence graph.",
        "Input: target word w and its contexts Cs monolingual graph Gs = (Vs, Es)",
        "set of target languages L Output: a multilingual graph G ml 4: Ci := aligned sentences of Cs in lang.",
        "I 5: for each vs g Vs 6: TVsti := translations of vs found in Ci 7: CVs ç Cs := contexts containing w and vs 8: for each translation vi g TVayi 9: CVl := aligned sentences of CVs in lang.",
        "I 10: Tw c„ < – translation labels of w from Cv,",
        "il: if vi £ Vml then",
        "14: for each t g TWyCvi 16: for each Vi g Vi 17: for each Vj g V, i / j 18: if Viand Vj co-occur in Ci then 20: return Gml (vs, t, vi) receives a translation label t. Formally, let CVs ç Cs be the contexts where vs and w co-occur, and CVl the word-aligned contexts in language I of CVs, where vs is translated as vi.",
        "Lhen each edge between nodes vs and vi is labeled with a translation label i (lines 14-15): this includes a translation of w in C^, its frequency of translation and the information of whether the translation is monosemous, as found in a multilingual dictionary, i.e. EuroWordNet (Vossen, 1998) and PanDictionary (Mausam et al., 2009).",
        "Finally, the multilingual graph is further extended by inserting all possible co-occurrence edges (vi, Vj) g Ei between the nodes for the target language I (lines 16-19, i.e. we apply the step from Section 3.1 to I and Ci).",
        "As a result of the algorithm, the multilingual graph is returned (line 20).",
        "We compute the root hubs in the multilingual graph to discriminate the senses of the target word in the source language.",
        "Hubs are found using the adapted PageRank from Agirre et al.",
        "(2006):",
        "where d is the so-called damping factor (typically set to 0.85), deg(vi) is the number of adjacent nodes of node Viand Wij is the weight of the cooccurrence edge between nodes Viand Vj.",
        "Since this step aims to induce the senses for the target word, only nodes referring to words in English can become root hubs.",
        "However, in order to use additional evidence from other languages, we furthermore include in the computation of PageRank co-occurrence edges from the target languages, as long as these occur in contexts with 'safe', i.e. monosemous, translations of the target word.",
        "Given an English co-occurrence edge (vs,i,vsj) and translation edges (vs,i,viti) and (vsj,vij) to nodes in the target language I, labeled with monosemous translations, we include the co-occurrence edge (viti,vij) in the PageRank computation.",
        "For instance, animal and biotechnology are translated in German as Tier and Biotechnologie, both with edges labeled with the monosemous Pflanze: accordingly, we include the edge (Tier, Biotechnologie) in the computation of PR(vi), where Vi is either animal or biotechnology.",
        "Finally, following Véronis (2004), a MST is built with the target word as its root and the root hubs of G ml forming its first level.",
        "By using a multilingual graph, we are able to obtain MSTs which contain translation nodes and edges.",
        "Given a context W for the target word w in the source language, we use the MST to find the most relevant words in W for disambiguating w. We first map each content word cw g W to nodes in the MST.",
        "Since each word is dominated by exactly one hub, we can find the relevant nodes by computing the correct hub disHub (i.e. sense) and then only retain those nodes linked to disHub.",
        "Let Wh be the set of mapped content words dominated by hub h. Then, disHub can be found as:",
        "where d(cw) is a function which assigns a weight to cw according to its distance to w, i.e. the more words occur between w and cw within W, the smaller the weight, and dist(cw,h) is given by the number of edges between cw and h in the MST.",
        "Finally, we collect the translation edges of the retained context nodes WdisHub and we sum the translation counts to rank each translation."
      ]
    },
    {
      "heading": "4. Results and Analysis",
      "text": [
        "Experimental Setting.",
        "We submitted two runs for the task (UHD-1 and UHD-2 henceforth).",
        "Since we were interested in assessing the impact of using different resources with our methodology, we automatically built multilingual graphs from different sentence-aligned corpora, i.e. Europarl (Koehn, 2005) for UHD-1, augmented with the JRC-Acquis corpus (Steinberger et al., 2006) for UHD-2.",
        "Both corpora were tagged and lemma-tized with LreeLagger (Schmid, 1994) and word aligned using GIZA++ (Och and Ney, 2003).",
        "For German, in order to avoid the sparseness deriving from the high productivity of compounds, we performed a morphological analysis using Morphisto (Zielinski et al., 2009).",
        "To build the multilingual graph (Section 3.2), we used a minimum frequency threshold of 2 occurrences for a word to be inserted as a node, and retained only those edges with a weight less or equal to 0.7.",
        "After constructing the multilingual graph, we additionally removed those translations with a frequency count lower than 10 (7 in the case of German, due to the large amount of compounds).",
        "Finally, the translations generated for the Best evaluation setting were obtained by applying the following rule onto the ranked answer translations: add translation tri while count(tri) > count(tri-\\)/?>, where i is the i-th ranked translation.",
        "Results and discussion.",
        "The results for the Best and out-of-five (OOF) evaluations are presented in Tables 1 and 2 respectively.",
        "Results are computed using the official scorer (Lefever and Hoste, 2010) and no post-processing is applied to the system's output, i.e. we do not back-off to the baseline most frequent translation in case the system fails to provide an answer for a test instance.",
        "For the sake of brevity, we present the results for UHD-1, since we found no statistically significant difference in the performance of the two systems (e.g. UHD-2 outperforms UHD-1 only by +0.7% on the best evaluation for French).",
        "Lable 2: OOF results (UHD-1).",
        "Overall, in the best evaluation our system ranked in the middle for those languages where the majority of systems participated - i.e. second and fourth out of 7 submissions for french and Spanish.",
        "When compared against the baseline, i.e. the most frequent translation found in Europarl, our method was able to achieve in the best evaluation a higher precision for italian and Spanish (+1.9% and +2.1%, respectively), whereas French and German lie near below the baseline scores ( – 0.5% and – 1.0%, respectively).",
        "Lhe trade-off is a recall always below the baseline.",
        "In contrast, we beat the Mode precision baseline for all languages, i.e. up to +5.1% for Spanish.",
        "Lhe fact that our system is strongly precision-oriented is additionally proved by a low performance in the OOF evaluation, where we always perform below the baseline (i.e. the five most frequent translations in Europarl)."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We presented in this paper a graph-based system to perform CL-WSD.",
        "Key to our approach is the use of a co-occurrence graph built from multilingual parallel corpora, and the application of well-studied graph algorithms for monolingual WSD (Véronis, 2004; Agirre et al., 2006).",
        "Future work will concentrate on extensions of the algorithms, e.g. computing hubs in each language independently and combining them as a joint problem, as well as developing robust techniques for unsupervised tuning of the graph weights, given the observation that the most frequent translations tend to receive too much weight and accordingly crowd out more appropriate translations.",
        "Finally, we plan to investigate the application of our approach directly to multilingual lexical resources such as PanDictionary (Mausam et al., 2009) and Babel-Net (Navigli and Ponzetto, 2010).",
        "Language",
        "P R ModeP ModeR",
        "French German Italian Spanish",
        "20.22 16.21 12.20 9.32 15.94 12.78 20.48 16.33",
        "17.59 14.56 11.05 7.78 12.34 8.48 28.48 22.19",
        "Lable 1: Best results (UHD-1).",
        "Language",
        "P R ModeP ModeR",
        "French German Italian Spanish",
        "39.06 32.00 27.62 22.82 33.72 27.49 38.78 31.81",
        "37.00 26.79 25.68 21.16 27.54 21.81 40.68 32.38"
      ]
    }
  ]
}
