{
  "info": {
    "authors": [
      "Jonathan May",
      "Kevin Knight",
      "Heiko Vogler"
    ],
    "book": "ACL",
    "id": "acl-P10-1108",
    "title": "Efficient Inference through Cascades of Weighted Tree Transducers",
    "url": "https://aclweb.org/anthology/P10-1108",
    "year": 2010
  },
  "references": [
    "acl-J80-1001",
    "acl-J97-2003",
    "acl-P01-1067",
    "acl-P09-1108",
    "acl-W05-1506"
  ],
  "sections": [
    {
      "text": [
        "Efficient Inference Through Cascades of Weighted Tree Transducers",
        "Jonathan May and Kevin Knight",
        "Information Sciences Institute University of Southern California Marina del Rey, CA 90292",
        "Technische Universitat Dresden Institut für Theoretische Informatik 01062 Dresden, Germany",
        "heiko.vogler@tu-dresden.de",
        "Weighted tree transducers have been proposed as useful formal models for representing syntactic natural language processing applications, but there has been little description of inference algorithms for these automata beyond formal foundations.",
        "We give a detailed description of algorithms for application of cascades of weighted tree transducers to weighted tree acceptors, connecting formal theory with actual practice.",
        "Additionally, we present novel on-the-fly variants of these algorithms, and compare their performance on a syntax machine translation cascade based on (Yamada and Knight, 2001)."
      ]
    },
    {
      "heading": "1. Motivation",
      "text": [
        "Weighted finite-state transducers have found recent favor as models of natural language (Mohri, 1997).",
        "In order to make actual use of systems built with these formalisms we must first calculate the set of possible weighted outputs allowed by the transducer given some input, which we call forward application, or the set of possible weighted inputs given some output, which we call backward application.",
        "After application we can do some inference on this result, such as determining its k highest weighted elements.",
        "We may also want to divide up our problems into manageable chunks, each represented by a transducer.",
        "As noted by Woods (1980), it is easier for designers to write several small transducers where each performs a simple transformation, rather than painstakingly construct a single complicated device.",
        "We would like to know, then, the result of transformation of input or output by a cascade of transducers, one operating after the other.",
        "As we will see, there are various strategies for approaching this problem.",
        "We will consider offline composition, bucket brigade application, and on-the-fly application.",
        "Application of cascades of weighted string transducers (wsts) has been well-studied (Mohri, 1997).",
        "Less well-studied but of more recent interest is application of cascades of weighted tree transducers (wtts).",
        "We tackle application of wtt cascades in this work, presenting:",
        "• explicit algorithms for application of wtt cascades",
        "• novel algorithms for on-the-fly application of wtt cascades, and",
        "• experiments comparing the performance of these algorithms."
      ]
    },
    {
      "heading": "2. Strategies for the string case",
      "text": [
        "Before we discuss application of wtts, it is helpful to recall the solution to this problem in the wst domain.",
        "We recall previous formal presentations of wsts (Mohri, 1997) and note informally that they may be represented as directed graphs with designated start and end states and edges labeled with input symbols, output symbols, and weights.Fortunately, the solution for wsts is practically trivial – we achieve application through a series of embedding, composition, and projection operations.",
        "Embedding is simply the act of representing a string or regular string language as an identity wst.",
        "Composition of wsts, that is, generating a single wst that captures the transformations of two input wsts used in sequence, is not at all trivial, but has been well covered in, e.g., (Mohri, 2009), where directly implementable algorithms can be found.",
        "Finally, projection is another trivial operation – the domain or range language can be obtained from a wst by ignoring the output or input symbols, respectively, on its arcs, and summing weights on otherwise identical arcs.",
        "By embedding an input, composing the result with the given wst, and projecting the result, forward application is accomplished.",
        "We are then left with a weighted string acceptor (wsa), essentially a weighted, labeled graph, which can be traversed",
        "(a) Input string \"a a\" embedded in an identity wst (b) first wst in cascade (d) Offline composition approach: Compose the transducers (e) Bucket brigade approach: Apply wst (b) to wst (a) (f) Result of offline or bucket application after projection (g) Initial on-the-fly stand-in for (f) (h) On-the-fly stand-in after exploring outgoing edges of state ADF",
        "by well-known algorithms to efficiently find the k-best paths.",
        "Because WSTs can be freely composed, extending application to operate on a cascade of WSTs is fairly trivial.",
        "The only question is one of composition order: whether to initially compose the cascade into a single transducer (an approach we call offline composition) or to compose the initial embedding with the first transducer, trim useless states, compose the result with the second, and so on (an approach we call bucket brigade).",
        "The appropriate strategy generally depends on the structure of the individual transducers.",
        "A third approach builds the result incrementally, as dictated by some algorithm that requests information about it.",
        "Such an approach, which we call on-the-fly, was described in (Pereira and Riley, 1997; Mohri, 2009; Mohri et al., 2000).",
        "If we can efficiently calculate the outgoing edges of a state of the result WSA on demand, without calculating all edges in the entire machine, we can maintain a stand-in for the result structure, a machine consisting at first of only the start state of the true result.",
        "As a calling algorithm (e.g., an implementation of Dijkstra's algorithm) requests information about the result graph, such as the set of outgoing edges from a state, we replace the current stand-in with a richer version by adding the result of the request.",
        "The on-the-fly approach has a distinct advantage over the other two methods in that the entire result graph need not be built.",
        "A graphical representation of all three methods is presented in Figure 1."
      ]
    },
    {
      "heading": "3. Application of tree transducers",
      "text": [
        "Now let us revisit these strategies in the setting of trees and tree transducers.",
        "Imagine we have a tree or set of trees as input that can be represented as a weighted regular tree grammar (wrtg) and a WTT that can transform that input with some weight.",
        "We would like to know the k-best trees the WTT can produce as output for that input, along with their weights.",
        "We already know of several methods for acquiring k-best trees from a WRTG (Huang and Chiang, 2005; Pauls and Klein, 2009), so we then must ask if, analogously to the string case, WTTs preserve recognizability and we can form an application WRTG.",
        "Before we begin, however, we must define WTTs and WRTGs.",
        "A ranked alphabet is a finite set S such that every member a G S has a rank rk(a) G N. We call S(k) ç S,k G N the set of those a G S such that rk(a) = k. The set of variables is denoted X = {x\\,x2,...} and is assumed to be disjoint from any ranked alphabet used in this paper.",
        "We use _L to denote a symbol of rank 0 that is not in any ranked alphabet used in this paper.",
        "A tree t G Ts is denoted a(t\\,... , tk) where k > 0, a G S(k), and h,...,tk G TE.",
        "For a G S(0) we",
        "(i) On-the-fly stand-in after best path has been found",
        "write a G Ts as shorthand for a().",
        "For every set S disjoint from S, let Ts (S) = Tsus, where, for all s G S, rk(s) = 0.",
        "We define the positions of a tree t = a(ti,...,tfc), for k > 0, a G S(k), ti,...,tk G Ts, as a set pos(t) C N* such that pos(t) = {e} U {iv | 1 < i < k,v G pos(ti)}.",
        "The set of leaf positions lv(t) ç pos(t) are those positions v G pos(t) such that for no i G N, vi G pos(t).",
        "We presume standard lexicographic orderings < and < on pos.",
        "Let t, s G Ts and v G pos(t).",
        "The label of t at position v, denoted by t(v), the subtree of t at v, denoted by t|v, and the replacement at v by s, denoted by t[s]v, are defined as follows:",
        "a[s}£ = s.",
        "t[s]iv = a(t1, .",
        ".",
        ".",
        ", ti-i,ti[s]v ,ti+1, .",
        ".",
        ".",
        ", tk).",
        "The size of a tree t, size (t) is |pos(t) |, the cardinality of its position set.",
        "The yield set of a tree is the set of labels of its leaves: for a tree t, yd (t) = {t(v) | v G 1v(t)}.",
        "Let A and B be sets.",
        "Let p : A – Ts(B) be a mapping.",
        "We extend p to the mapping p : Ts (A) – Ts(B) such that for a G A, p(a) = p(a) and for k > 0, a G S(k), and ti,...,tk G Ts (A), p(a(ti,... ,tk )) = a(p(ti),...,p(tk )).",
        "Weindi-cate such extensions by describing p as a substitution mapping and then using p without further comment.",
        "We use R+ to denote the set {w G R | w > 0} and to denote R+ U {+oo}.",
        "Definition 3.1 (cf. (Alexandrakis and Bozapa-lidis, 1987)) A weighted regular tree grammar (wrtg) is a 4-tuple G = (N, s, P, n0) where:",
        "1.",
        "N is a finite set of nonterminals, with n0 G N the start nonterminal."
      ]
    },
    {
      "heading": "2.. S is a ranked alphabet of input symbols, where",
      "text": [
        "s n n = 0.",
        "3.",
        "P is a tuple (Pwhere P' is a finite set of productions, each production p of the form n – u, n G N, u G Ts(N), and n : P' – R+ is a weight function of the productions.",
        "We will refer to P as a finite set of weighted productions, each production p of the form n",
        "u.",
        "A production p is a chain production if it is of the form ni – nj, where ni,nj G N.",
        "A wrtg G is in normal form if each production is either a chain production or is of the form n – a(ni,... ,nk) where a G S(k) and ni,...,nk G N.",
        "n G N, and p G P of the form n – u, we obtain a derivation step from s to t by replacing some leaf nonterminal in s labeled n with u.",
        "Formally, s =>G t if there exists some v G lv(s) such that s(v) = n and s[u]v = t. We say this derivation step is leftmost if, for all v' G lv(s) where v' < v, s(v') G S. We henceforth assume all derivation steps are leftmost.",
        "If, for some m G N, pi G P, and ti G Ts(N) for all 1 < i < m, n0 =>pi ti... ^>Vrn tm, we say the sequence d = (pi,... ,pm) is a derivation of tm in G and that n0 =>* tm; the weight of d is wt(d) = n(pi) • ... • n(pm).",
        "The weighted tree language recognized by G is the mapping LG : Ts – such that for every t G Ts, LG(t) is the sum of the weights of all (possibly infinitely many) derivations of t in G. A weighted tree language f : Ts – is recognizable if there is a wrtg G such that f = LG.",
        "We define a partial ordering ^ on wrtgs such that for wrtgs Gi = (Ni, S,Pi,n0) and G2 = (N2, S,P2,n0), we say Gi ^ G2 iff Ni ç N2 and Pi ç P2, where the weights are preserved.",
        "A weighted extended top-down tree transducer (wxtt) is a 5-tuple M = (Q, S, A, R, q0) where:",
        "1.",
        "Q is a finite set of states.",
        "2.",
        "S and A are the ranked alphabets of input and output symbols, respectively, where (S U A) n Q = 0.",
        "3.",
        "R is a tuple (R',n), where R' is a finite set of rules, each rule r of the form q.y – u for q G Q, y G Ts(X), and u G TA(Q x X).",
        "We further require that no variable x G X appears more than once in y, and that each variable appearing in u is also in y.",
        "Moreover, n : R – is a weight function of the rules.",
        "As for wrtgs, we refer to R as a finite set of weighted rules, each rule r of the form",
        "q.y-> u.",
        "A wxtt is linear (respectively, nondeleting) if, for each rule r of the form q.y – u, each x G yd (y) n X appears at most once (respectively, at least once) in u.",
        "We denote the class of all wxtts as wxT and add the letters L and N to signify the subclasses of linear and nondeleting wtt, respectively.",
        "Additionally, if y is of the form a(xi,... ,xk ), we remove the letter \"x\" to signify the transducer is not extended (i.e., it is a \"traditional\" WTT (Fülöp and Vogler, 2009)).",
        "x Ts), and r G R of the form q.y – u, we obtain a derivation step from s to t by replacing some leaf of s labeled with q and a tree matching y by a transformation of u, where each instance of a variable has been replaced by a corresponding subtree of the y-matching tree.",
        "Formally, s =>rM t if there is a position v G pos(s), a substitution mapping",
        "p : X – Ts, and a rule q.y – u G R such that s(v) = (q,p(y)) and t = s[p'(u)]v, where p' is a substitution mapping Q x X – Ta(Q x Ts) defined such that p'(q',x) = (q',p(x)) for all q' G Q and x G X.",
        "We say this derivation step is leftmost if, for all v' G lv(s) where v' < v, s(v') G a.",
        "We henceforth assume all derivation steps are leftmost.",
        "If, for some s G Ts, m G N, n G R, and ti G TA(Q x Ts) for all 1 < i < m, (q0, s) =>ri ti... =>rm tm, we say the sequence d = (ri,..., rm) is a derivation of (s, tm) in M ; the weight of d is wt(d) = n(ri) • ... • n(rm).",
        "The weighted tree transformation recognized by M is the mapping tm : Ts x Ta – R+, such that for every s G Ts and t G Ta, tm(s, t) is the sum of the weights of all (possibly infinitely many) derivations of (s, t) in M. The composition of two weighted tree transformations t : Ts x Ta – and fi : Ta x Tp – R+ is the weighted tree transformation (t ; i) : Ts x Tp – where for every s G Ts and u G Tp, (t ; fi)(s, u) = £ teTA t (s, t) • f (t, u).",
        "We now consider transducer classes where recognizability is preserved under application.",
        "Table 1 presents known results for the top-down tree transducer classes described in Section 3.1.",
        "Unlike the string case, preservation of recognizability is not universal or symmetric.",
        "This is important for us, because we can only construct an application wrtg, i.e., a wrtg representing the result of application, if we can ensure that the language generated by application is in fact recognizable.",
        "Of the types under consideration, only wxLNT and wLNT preserve forward recognizability.",
        "The two classes marked as open questions and the other classes, which are superclasses of wNT, do not or are presumed not to.",
        "All subclasses of wxLT preserve backward recognizability.",
        "We do not consider cases where recognizability is not preserved in the remainder of this paper.",
        "If a transducer M of a class that preserves forward recognizability is applied to a WRTG G, we can call the forward application wrtg M (G)* and if M preserves backward recognizability, we can call the backward application wrtg M(G)<.",
        "Now that we have explained the application problem in the context of weighted tree transducers and determined the classes for which application is possible, let us consider how to build forward and backward application WRTGs.",
        "Our basic approach mimics that taken for WSTs by using an embed-compose-project strategy.",
        "As in string world, if we can embed the input in a transducer, compose with the given transducer, and project the result, we can obtain the application WRTG.",
        "Embedding a WRTG in a wLNT is a trivial operation – if the WRTG is in normal form and chain production-free, for every production of the form n – ► a(ni,..., nk ), create arule of the form",
        "n.a(xi, ...,xk ) – a(ni.xi,... ,nk .xk ).",
        "Range projection of a wxLNT is also trivial – for every q G Q and u G TA(Q x X ) create a production of the form q – u' where u' is formed from u by replacing all leaves of the form q.x with the leaf q, i.e., removing references to variables, and w is the sum of the weights of all rules of the form q.y – u in R. Domain projection for wxLT is best explained by way of example.",
        "The left side of a rule is preserved, with variables leaves replaced by their associated states from the right side.",
        "So,",
        "such as qi.a(xi,x2) – ► Y(q2.x2) necessitates the introduction of a new nonterminal L that can generate all of Ts with weight 1.",
        "The only missing piece in our embed-compose-project strategy is composition.",
        "Algorithm 1, which is based on the declarative construction of Maletti (2006), generates the syntactic composition of a wxLT and a wLNT, a generalization of the basic composition construction of Baker (1979).",
        "It calls Algorithm 2, which determines the sequences of rules in the second transducer that match the right side of a single rule in the first transducer.",
        "Since the embedded wrtg is of type wLNT, it may be either the first or second argument provided to Algorithm 1, depending on whether the application is forward or backward.",
        "We can thus use the embed-compose-project strategy for forward application of wLNT and backward application of wxLT and wxLNT.",
        "Note that we cannot use this strategy for forward application of wxLNT, even though that class preserves recognizability.",
        "Algorithm 1 COMPOSE Algorithm 2 COVER",
        "O(|Ri| max(|fi2|s,zeIQ2I)), where u is the largest right side tree in any rule in Ri 18: if q e H then"
      ]
    },
    {
      "heading": "4. Application of tree transducer cascades",
      "text": [
        "What about the case of an input WRTG and a cascade of tree transducers?",
        "We will revisit the three strategies for accomplishing application discussed above for the string case.",
        "In order for offline composition to be a viable strategy, the transducers in the cascade must be closed under composition.",
        "Unfortunately, of the classes that preserve recognizability, only wLNT is closed under composition (Gecseg and Steinby, 1984; Baker, 1979; Maletti et al., 2009; Fülop and",
        "Vogler, 2009).",
        "However, the general lack of composability of tree transducers does not preclude us from conducting forward application of a cascade.",
        "We revisit the bucket brigade approach, which in Section 2 appeared to be little more than a choice of composition order.",
        "As discussed previously, application of a single transducer involves an embedding, a composition, and a projection.",
        "The embedded WRTG is in the class wLNT, and the projection forms another WRTG.",
        "As long as every transducer in the cascade can be composed with a wLNT to its left or right, depending on the application type, application of a cascade is possible.",
        "Note that this embed-compose-project process is somewhat more burdensome than in the string case.",
        "For strings, application is obtained by a single embedding, a series of compositions, and a single projec-",
        "set of pairs (z, w) with z e Tr((Qi x Q2) x X) formed by one or more successful runs on u by rules in R2, starting from q2, and w e R+ the sum of the weights of all such runs.",
        "complexity",
        "14: for all v e pos(u) such that u(v) e A(k) for some k > 0 in prefix order do for all (z, Ö, w) e ri;ast do",
        "Form substitution mapping y> : (Q2 x X) - Tr((Qi x Q2 x X) U{±}).",
        "for i =1 to k do if u( vi) is of the form ( qi , x) e Qi x X then",
        "tion, whereas application for trees is obtained by a series of (embed, compose, project) operations.",
        "We next consider on-the-fly algorithms for application.",
        "Similar to the string case, an on-the-fly approach is driven by a calling algorithm that periodically needs to know the productions in a WRTG with a common left side nonterminal.",
        "The embed-compose-project approach produces an entire application WRTG before any inference algorithm is run.",
        "In order to admit an on-the-fly approach we describe algorithms that only generate those productions in a WRTG that have a given left nonterminal.",
        "In this section we extend Definition 3.1 as follows: a wrtg is a 6-tuple G = (N, S,P,n0,M,G) where N, S, P, and n0_are defined as in Definition 3.1,_and either M = G = 0, or M is a wxLNT and G is a normal form, chain production-free WRTG such that",
        "(a) Preservation of forward recognizability (b) Preservation of backward recognizability",
        "Table 1: Preservation of forward and backward recognizability for various classes of top-down tree transducers.",
        "Here and elsewhere, the following abbreviations apply: w = weighted, x = extended LHS, L = linear, N = nondeleting, OQ = open question.",
        "Square brackets include a superposition of classes.",
        "For example, w[x]T signifies both wxT and wT.",
        "Algorithm 3 PRODUCE",
        "1: inputs 4: outputs",
        "Gin ^ Gout and __ 6: complexity",
        "7: O(|R||P^'z'where y is the largest left side tree in any rule in R 8: if Pin contains productions of the form nin - – u then 9: return Gin 12: Let nin be of the form (n, q), where n e N and q e Q.",
        "Ta (N x Q) such that, for all v e yd (y) and q' e Q, if there exist n' e N and x e X such that 0(v) = n' and y(v) = x, then ^(q', x) = (n', q').",
        "Algorithm 4 REPLACE",
        "for all p e NORM(p', Nout) do",
        "G ^ M(G)>.",
        "In the latter case, G is a stand-in for M(G)>, analogous to the stand-ins for wsas and WSTs described in Section 2.",
        "Algorithm 3, PRODUCE, takes as input a wrtg Gin = (Nin, a, Pin, m, M, G) and a desired nonterminal nin and returns another WRTG, Gout that is different from Gin in that it has more productions^specifically those beginning with ninthat are in M(G)>.",
        "Algorithms using stand-ins should call PRODUCE to ensure the stand-in they are using has the desired productions beginning with the specific nonterminal.",
        "Note, then, that PRODUCE obtains the effect of forward applica-",
        "3: wrtg G = (N, E,P,no,M,G) in normal form, with no chain productions 5: outputs",
        "6: set r of pairs (0, w) where 0 is a mapping pos(y) – N and w e R+, each pair indicating a successful run on y by productions in G, starting from n, and w is the weight of the run.",
        "7: complexity 10: for all v e pos(y) such that y(v) e X in prefix order 18: return riiast",
        "Algorithm 5 MAKE-EXPLICIT",
        "3: outputs",
        "4: wrtg G' = (N', E, P', no, M, G), in normal form, such that if M = 0 and G = 0, LG/ = PM(G)>, and otherwise G' = G.",
        "5: complexity 8: H – {no} {seen nonterminals} 9: * – {no} {pending nonterminals} 17: if ni e H then",
        "S e A(k).",
        "type",
        "preserved?",
        "source",
        "w[x]T",
        "No",
        "See w[x]NT",
        "type",
        "preserved?",
        "source",
        "w[x]LT",
        "OQ",
        "(Maletti, 2009)",
        "w[x]T",
        "No",
        "See w[x]NT",
        "w[x]NT",
        "No",
        "(Gecseg and Steinby, 1984)",
        "w[x]LT",
        "Yes",
        "(Fulop et al., 2010)",
        "wxLNT",
        "Yes",
        "(Fulop et al., 2010)",
        "w[x]NT",
        "No",
        "(Maletti, 2009)",
        "wLNT",
        "Yes",
        "(Kuich, 1999)",
        "w[x]LNT",
        "Yes",
        "See w[x]LT",
        "(a) Input wrtg G (b) First transducer MA in the cascade (c) Second transducer MB in the cascade godo -► a(goao,giai) (d) Productions of MA(G)> built as a consequence of building the complete Mb (Ma (Gff_ goaobo -► a(goaobo,gidibo)",
        "tion in an on-the-fly manner.",
        "It makes calls to REPLACE, which is presented in Algorithm 4, as well as to a NORM algorithm that ensures normal form by replacing a single production not in normal form with several normal-form productions that can be combined together (Alexandrakis and Bozapalidis, 1987) and a CHAIN-REM algorithm that replaces a wrtg containing chain productions with an equivalent wrtg that does not (Mohri, 2009).",
        "As an example of stand-in construction, consider the invocation PRODUCE(Gi, g0a0), where Gi = ({g0a0}, [a,ip,a, p}, 0, g0a0, Ma, G), G is in Figure 2a, and Ma is in 2b.",
        "The stand-in wrtg that is output contains the first three of the four productions in Figure 2d.",
        "To demonstrate the use of on-the-fly application in a cascade, we next show the effect of PRODUCE when used with the cascade G o Ma ◦ MB, where MB is in Figure 2c.",
        "Our driving algorithm in this case is Algorithm 5, MAKE-",
        "(a) Rotation rules (b) Insertion rules (c) Translation rules",
        "ExPLICIT, which simply generates the full application wrtg using calls to PRODUCE.",
        "The input to MAKE-EXPLICIT is G2 = ({g0a0&0}, {a, a}, 0, g0a0b0, Mb, Gi).",
        "MAKE-EXPLICIT calls PRODUCE(G2, g0a0^).",
        "PRODUCE then seeks to cover b0.a(xi,x2) a(b0.xi,b0.x2) with productions from Gi , which is a stand-in for MA(G)>.",
        "At line 14 of REPLACE, Gi is improved so that it has the appropriate productions.",
        "The productions of Ma(G)> that must be built to form the complete MB(Ma(G)>)> are shown in Figure 2d.",
        "The complete Mb(Ma(G)>)> is shown in Figure 2e.",
        "Note that because we used this on-the-fly approach, we were able to avoid building all the productions in Ma(G)>; in particular we did not build g0a2 – p, while a bucket brigade approach would have built this production.",
        "We have also designed an analogous on-the-fly PRODUCE algorithm for backward application on linear wtt.",
        "We have now defined several on-the-fly and bucket brigade algorithms, and also discussed the possibility of embed-compose-project and offline composition strategies to application of cascades of tree transducers.",
        "Tables 2a and 2b summarize the available methods of forward and backward application of cascades for recognizability-preserving tree transducer classes."
      ]
    },
    {
      "heading": "5. Decoding Experiments",
      "text": [
        "The main purpose of this paper has been to present novel algorithms for performing application.",
        "However, it is important to demonstrate these algorithms on real data.",
        "We thus demonstrate bucket-brigade and on-the-fly backward application on a typical NLP task cast as a cascade of wLNT.",
        "We adapt the Japanese-to-English transla-",
        "(a) Forward application (b) Backward application",
        "Table 2: Transducer types and available methods of forward and backward application of a cascade.",
        "oc = offline composition, bb = bucket brigade, otf = on the fly.",
        "tion model of Yamada and Knight (2001) by transforming it from an English-tree-to-Japanese-string model to an English-tree-to-Japanese-tree model.",
        "The Japanese trees are unlabeled, meaning they have syntactic structure but all nodes are labeled \"X\".",
        "We then cast this modified model as a cascade of LNT tree transducers.",
        "Space does not permit a detailed description, but some example rules are in Figure 3.",
        "The rotation transducer R, a sample of which is in Figure 3a, has 6,453 rules, the insertion transducer I, Figure 3b, has 8,122 rules, and the translation transducer, T , Figure 3c, has 37,311 rules.",
        "We add an English syntax language model L to the cascade of transducers just described to better simulate an actual machine translation decoding task.",
        "The language model is cast as an identity wtt and thus fits naturally into the experimental framework.",
        "In our experiments we try several different language models to demonstrate varying performance of the application algorithms.",
        "The most realistic language model is a PCFG.",
        "Each rule captures the probability of a particular sequence of child labels given a parent label.",
        "This model has 7,765 rules.",
        "To demonstrate more extreme cases of the usefulness of the on-the-fly approach, we build a language model that recognizes exactly the 2,087 trees in the training corpus, each with equal weight.",
        "It has 39,455 rules.",
        "Finally, to be ultra-specific, we include a form of the \"specific\" language model just described, but only allow the English counterpart of the particular Japanese sentence being decoded in the language.",
        "The goal in our experiments is to apply a single tree t backward through the cascade LoRoloTot and find the 1-best path in the application wrtg.",
        "We evaluate the speed of each approach: bucket brigade and on-the-fly.",
        "The algorithm we use to obtain the 1-best path is a modification of the k-best algorithm of Pauls and Klein (2009).",
        "Our algorithm finds the 1-best path in a wrtg and admits an on-the-fly approach.",
        "The results of the experiments are shown in Table 3.",
        "As can be seen, on-the-fly application is generally faster than the bucket brigade, about double the speed per sentence in the traditional",
        "Table 3: Timing results to obtain 1-best from application through a weighted tree transducer cascade, using on-the-fly vs. bucket brigade backward application techniques.",
        "pcfg = model recognizes any tree licensed by a pcfg built from observed data, exact = model recognizes each of 2,000+ trees with equal weight, 1-sent = model recognizes exactly one tree.",
        "experiment that uses an English PCFG language model.",
        "The results for the other two language models demonstrate more keenly the potential advantage that an on-the-fly approach provides – the simultaneous incorporation of information from all models allows application to be done more effectively than if each information source is considered in sequence.",
        "In the \"exact\" case, where a very large language model that simply recognizes each of the 2,087 trees in the training corpus is used, the final application is so large that it overwhelms the resources of a 4gb MacBook Pro, while the on-the-fly approach does not suffer from this problem.",
        "The \"1-sent\" case is presented to demonstrate the ripple effect caused by using on-the fly.",
        "In the other two cases, a very large language model generally overwhelms the timing statistics, regardless of the method being used.",
        "But a language model that represents exactly one sentence is very small, and thus the effects of simultaneous inference are readily apparent – the time to retrieve the 1-best sentence is reduced by two orders of magnitude in this experiment."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have presented algorithms for forward and backward application of weighted tree transducer cascades, including on-the-fly variants, and demonstrated the benefit of an on-the-fly approach to application.",
        "We note that a more formal approach to application of wtts is being developed, independent from these efforts, by Fulop et al.",
        "(2010).",
        "method",
        "wst",
        "wxLNT",
        "wLNT",
        "oc",
        "V",
        "x",
        "V",
        "bb",
        "x",
        "V",
        "otf",
        "V",
        "V",
        "V",
        "method",
        "wst",
        "wxLT",
        "wLT",
        "wxLNT",
        "wLNT",
        "oc",
        "V",
        "x",
        "x",
        "x",
        "V",
        "bb",
        "V",
        "V",
        "V",
        "V",
        "V",
        "otf",
        "V",
        "V",
        "V",
        "V",
        "V",
        "LM type",
        "method",
        "time/sentence",
        "pcfg",
        "bucket",
        "28s",
        "pcfg",
        "otf",
        "17s",
        "exact",
        "bucket",
        ">1m",
        "exact",
        "otf",
        "24s",
        "1-sent",
        "bucket",
        "2.5s",
        "1-sent",
        "otf",
        ".06s"
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We are grateful for extensive discussions with Andreas Maletti.",
        "We also appreciate the insights and advice of David Chiang, Steve De-Neefe, and others at ISI in the preparation of this work.",
        "Jonathan May and Kevin Knight were 0904684.",
        "Heiko Vogler was supported by DFG VO 1011/5-1."
      ]
    }
  ]
}
