{
  "info": {
    "authors": [
      "Ondřej Bojar",
      "Kamil Kos",
      "David Mareček"
    ],
    "book": "Proceedings of the ACL 2010 Conference Short Papers",
    "id": "acl-P10-2016",
    "title": "Tackling Sparse Data Issue in Machine Translation Evaluation",
    "url": "https://aclweb.org/anthology/P10-2016",
    "year": 2010
  },
  "references": [
    "acl-P02-1040",
    "acl-P07-2045",
    "acl-W07-0738",
    "acl-W08-0309",
    "acl-W09-0401",
    "acl-W09-0422"
  ],
  "sections": [
    {
      "text": [
        "Tackling Sparse Data Issue in Machine Translation Evaluation *",
        "Ondrej Bojar, Kamil Kos, and David Marecek",
        "Charles University in Prague, Institute of Formal and Applied Linguistics",
        "{bojar,marecek}@ufal.mff.cuni.cz, kamilkos@email.cz",
        "We illustrate and explain problems of n-grams-based machine translation (MT) metrics (e.g. BLEU) when applied to morphologically rich languages such as Czech.",
        "A novel metric SemPOS based on the deep-syntactic representation of the sentence tackles the issue and retains the performance for translation to English as well."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Automatic metrics of machine translation (MT) quality are vital for research progress at a fast pace.",
        "Many automatic metrics of MT quality have been proposed and evaluated in terms of correlation with human judgments while various techniques of manual judging are being examined as well, see e.g. MetricsMATR08 (Przybocki et al., 2008), WMT08 and WMT09 (Callison-Burch et al., 2008; Callison-Burch et al., 2009).",
        "The contribution of this paper is twofold.",
        "Section 2 illustrates and explains severe problems ofa widely used BLEU metric (Papineni et al., 2002) when applied to Czech as a representative of languages with rich morphology.",
        "We see this as an instance of the sparse data problem well known for MT itself: too much detail in the formal representation leading to low coverage of e.g. a translation dictionary.",
        "In MT evaluation, too much detail leads to the lack of comparable parts of the hypothesis and the reference.",
        "* This work has been supported by the grants EuroMatrixPlus (FP7-ICT-2007-3-231720 of the EU and 7E09003 of the Czech Republic), FP7-ICT-2009-4-247762 (Faust), GA201/09/H057, GAUK 1163/2010, and MSM 0021620838.",
        "We are grateful to the anonymous reviewers for further research suggestions.",
        "/metricsmatr/2008/results/ http://www.statmt.org/wmt0 8 and wmt0 9 pctrans eurotranxp cu-tectomt cu-bojar 0.06 0.",
        "Section 3 introduces and evaluates some new variations of SemPOS (Kos and Bojar, 009), a metric based on the deep syntactic representation of the sentence performing very well for Czech as the target language.",
        "Aside from including dependency and n-gram relations in the scoring, we also apply and evaluate SemPOS for English."
      ]
    },
    {
      "heading": "2. Problems of BLEU",
      "text": [
        "BLEU (Papineni et al., 2002) is an established language-independent MT metric.",
        "Its correlation to human judgments was originally deemed high (for English) but better correlating metrics (esp.",
        "for other languages) were found later, usually employing language-specific tools, see e.g. Przybocki et al.",
        "(2008) or Callison-Burch et al.",
        "(2009).",
        "The unbeaten advantage of BLEU is its simplicity.",
        "Figure 1 illustrates a very low correlation to human judgments when translating to Czech.",
        "We plot the official BLEU score against the rank established as the percentage of sentences where a system ranked no worse than all its competitors (Callison-Burch et al., 2009).",
        "The systems developed at Charles University (cu-) are described in Bojar et al.",
        "(2009), uedin is a vanilla configuration of Moses (Koehn et al., 2007) and the remaining ones are commercial MT systems.",
        "In a manual analysis, we identified the reasons for the low correlation: BLEU is overly sensitive to sequences and forms in the hypothesis matching",
        "Con- Error firmed Flags 1-grams 2-grams 3-grams 4-grams",
        "firmed by the reference.",
        "This amounts to 34% of running unigrams, giving enough space to differ in human judgments and still remain unscored.",
        "Figure 3 documents the issue across languages: the lower the BLEU score itself (i.e. fewer confirmed n-grams), the lower the correlation to human judgments regardless of the target language (WMT09 shared task, 2025 sentences per language).",
        "Figure 4 illustrates the overestimation of scores caused by too much attention to sequences of tokens.",
        "A phrase-based system like Moses (cu-bojar) can sometimes produce a long sequence of tokens exactly as required by the reference, leading to a high BLEU score.",
        "The framed words in the illustration are not confirmed by the reference, but the actual error in these words is very severe for comprehension: nouns were used twice instead of finite verbs, and a misleading translation of a preposition was chosen.",
        "The output by pctrans preserves the meaning much better despite not scoring in either of the finite verbs and producing far shorter confirmed sequences."
      ]
    },
    {
      "heading": "3. Extensions of SemPOS",
      "text": [
        "SemPOS (Kos and Bojar, 2009) is inspired by metrics based on overlapping of linguistic features in the reference and in the translation (Gimenez and Marquez, 2007).",
        "It operates on so-called \"tec-togrammatical\" (deep syntactic) representation of the sentence (Sgall et al., 1986; Hajic et al., 2006), formally a dependency tree that includes only au-tosemantic (content-bearing) words.",
        "SemPOS as defined in Kos and Bojar (2009) disregards the syntactic structure and uses the semantic part of speech of the words (noun, verb, etc.).",
        "There are 19 fine-grained parts of speech.",
        "For each semantic part of speech t, the overlapping O(t) is set to zero if the part of speech does not occur in the reference or the candidate set and otherwise it is computed as given in Equation 1 below.",
        "Table 1: n-grams confirmed by the reference and containing error flags.",
        "the reference translation.",
        "This focus goes directly against the properties of Czech: relatively free word order allows many permutations of words and rich morphology renders many valid word forms not confirmed by the reference.",
        "These problems are to some extent mitigated if several reference translations are available, but this is often not the case.",
        "Figure 2 illustrates the problem of \"sparse data\" in the reference.",
        "Due to the lexical and morphological variance of Czech, only a single word in each hypothesis matches a word in the reference.",
        "In the case of pctrans, the match is even a false positive, \"do\" (to) is a preposition that should be used for the \"minus\" phrase and not for the \"end of the day\" phrase.",
        "In terms of BLEU, both hypotheses are equally poor but 90% of their tokens were not evaluated.",
        "Table 1 estimates the overall magnitude of this issue: For 1-grams to 4-grams in 1640 instances (different MT outputs and different annotators) of 200 sentences with manually flagged errors, we count how often the n-gram is confirmed by the reference and how often it contains an error flag.",
        "The suspicious cases are n-grams confirmed by the reference but still containing a flag (false positives) and n-grams not confirmed despite containing no error flag (false negatives).",
        "Fortunately, there are relatively few false positives in n-gram based metrics: 6.3% of unigrams and far fewer higher n-grams.",
        "The issue of false negatives is more serious and confirms the problem of sparse data if only one reference is available.",
        "30 to 40% of n-grams do not contain any error and yet they are not con-",
        "SRC Prague Stock Market falls to minus by the end of the trading day",
        "REF prazska burza se ke konci obchodovani propadla do minusu cu-bojar praha stock market klesne k minus na konci obchodniho dne pctrans praha trh cennych paprrâ pada minus do konce obchodniho dne",
        "Figure 2: Sparse data in BLEU evaluation: Large chunks of hypotheses are not compared at all.",
        "Only a single unigram in each hypothesis is confirmed in the reference.",
        "BLEU score",
        "Figure 3: BLEU correlates with its correlation to human judgments.",
        "BLEU scores around 0.1 predict little about translation quality.",
        "iel weriflci",
        "The semantic part of speech is denoted t; Ci and ri are the candidate and reference translations of sentence i, and cnt(w,t,rc) is the number of words w with type t in rc (the reference or the candidate).",
        "The matching is performed on the level of lemmas, i.e. no morphological information is preserved in ws.",
        "See Figure 5 for an example; the sentence is the same as in Figure 4.",
        "The final SemPOS score is obtained by macro-averaging over all parts of speech:",
        "where T is the set of all possible semantic parts of speech types.",
        "(The degenerate case of blank candidate and reference has SemPOS zero.)",
        "This section describes our modifications of SemPOS.",
        "All methods are evaluated in Section 3.2.",
        "Different Classification of Autosemantic Words.",
        "SemPOS uses semantic parts of speech to classify autosemantic words.",
        "The tectogram-matical layer offers also a feature called Functor describing the relation of a word to its governor similarly as semantic roles do.",
        "There are 67 functor types in total.",
        "Using Functor instead of SemPOS increases the number of word classes that independently require a high overlap.",
        "For a contrast we also completely remove the classification and use only one global class (Void).",
        "Deep Syntactic Relations in SemPOS.",
        "In SemPOS, an autosemantic word of a class is confirmed if its lemma matches the reference.",
        "We utilize the dependency relations at the tectogrammat-ical layer to validate valence by refining the overlap and requiring also the lemma of 1) the parent (denoted \"par\"), or 2) all the children regardless of their order (denoted \"sons\") to match.",
        "Combining BLEU and SemPOS.",
        "One of the major drawbacks of SemPOS is that it completely ignores word order.",
        "This is too coarse even for languages with relatively free word order like Czech.",
        "Another issue is that it operates on lemmas and it completely disregards correct word forms.",
        "Thus, a weighted linear combination of SemPOS and BLEU (computed on the surface representation of the sentence) should compensate for this.",
        "For the purposes of the combination, we compute BLEU only on unigrams up to fourgrams (denoted BLEU1, ..., BLEU4) but including the brevity penalty as usual.",
        "Here we try only a few weight settings in the linear combination but given a held-out dataset, one could optimize the weights for the best performance.",
        "SRC Congress yields: US government can pump 700 billion dollars into banks",
        "REF kongres ustoupil : vlada usa rrmze do bank napumpovat 700 miliard dolaru cu-bojar kongres vynosy : vlada usa muze cerpadlo 700 miliard dolaru v | bankach pctrans kongres vynasf : us vlada muze cerpat 700 miliardu dolaru do bank",
        "Figure 4: Too much focus on sequences in BLEU: pctrans' output is better but does not score well.",
        "BLEU gave credit to cu-bojar for 1, 3, 5 and 8 fourgrams, trigrams, bigrams and unigrams, resp., but only for 0, 0, 1 and 8 n-grams produced by pctrans.",
        "Confirmed sequences of tokens are underlined and important errors (not considered by BLEU) are framed.",
        "REF kongres/n ustoupit/v :/n vlada/n usa/n banka/n napumpovat/v 700/n miliarda/n dolar/n cu-bojar kongres/n vynos/n :/n vlada/n usa/n moci/v cerpadlo/n 700/n miliarda/n dolar/n banka/n pctrans kongres/n vynaset/v :/n us/n vlada/n cerpat/v 700/n miliarda/n dolar/n banka/n",
        "Figure 5: SemPOS evaluates the overlap of lemmas of autosemantic words given their semantic part of speech (n, v,... ).",
        "Underlined words are confirmed by the reference.",
        "SemPOS for English.",
        "The tectogrammatical layer is being adapted for English (Cinkova et al., 2004; Hajic et al., 2009) and we are able to use the available tools to obtain all SemPOS features for English sentences as well.",
        "We measured the metric performance on data used the evaluation of metric correlation with human judgments at the system level, we used the Pearson correlation coefficient p applied to ranks.",
        "In case of a tie, the systems were assigned the average position.",
        "For example if three systems achieved the same highest score (thus occupying the positions 1, 2 and 3 when sorted by score), each of them would obtain the average rank of 2 = 1+2+3.",
        "When correlating ranks (instead of exact scores) and with this handling of ties, the Pearson coefficient is equivalent to Spearman's rank correlation coefficient.",
        "The MetricsMATR08 human judgments include preferences for pairs of MT systems saying which one of the two systems is better, while the WMT08 and WMT09 data contain system scores (for up to 5 systems) on the scale 1 to 5 for a given sentence.",
        "We assigned a human ranking to the systems based on the percent of time that their translations were judged to be better than or equal to the translations of any other system in the manual evaluation.",
        "We converted automatic metric scores to ranks.",
        "Metrics' performance for translation to English and Czech was measured on the following testsets (the number of human judgments for a given source language in brackets):",
        "The MetricsMATR08 testset contained 4 reference translations for each sentence whereas the remaining testsets only one reference.",
        "Correlation coefficients for English are shown in Table 2.",
        "The best metric is Voidpar closely followed by Voidsons.",
        "The explanation is that Void compared to SemPOS or Functor does not lose points by an erroneous assignment of the POS or the functor, and that Voidpar profits from checking the dependency relations between autoseman-tic words.",
        "The combination of BLEU and Sem-POS outperforms both individual metrics, but in case of SemPOS only by a minimal difference.",
        "Additionally, we confirm that 4-grams alone have little discriminative power both when used as a metric of their own (BLEU4) as well as in a linear combination with SemPOS.",
        "The best metric for Czech (see Table 3) is a linear combination of SemPOS and 4-gram BLEU closely followed by other SemPOS and BLEUncombinations.",
        "We assume this is because BLEU4 can capture correctly translated fixed phrases, which is positively reflected in human judgments.",
        "Including BLEU1 in the combination favors translations with word forms as expected by the refer-",
        "Table 2: Average, best and worst system-level correlation coefficients for translation to English from various source languages evaluated on 10 different testsets.",
        "ence, thus allowing to spot bad word forms.",
        "In all cases, the linear combination puts more weight on SemPOS.",
        "Given the negligible difference between SemPOS alone and the linear combinations, we see that word forms are not the major issue for humans interpreting the translation – most likely because the systems so far often make more important errors.",
        "This is also confirmed by the observation that using BLEU alone is rather unreliable for Czech and BLEU-1 (which judges unigrams only) is even worse.",
        "Surprisingly BLEU-2 performed better than any other n-grams for reasons that have yet to be examined.",
        "The error metrics PER and TER showed the lowest correlation with human judgments for translation to Czech."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "This paper documented problems of single-reference BLEU when applied to morphologically rich languages such as Czech.",
        "BLEU suffers from a sparse data problem, unable to judge the quality of tokens not confirmed by the reference.",
        "This is confirmed for other languages as well: the lower the BLEU score the lower the correlation to human judgments.",
        "We introduced a refinement of SemPOS, an automatic metric of MT quality based on deep-syntactic representation of the sentence tackling",
        "Table 3: System-level correlation coefficients for English-to-Czech translation evaluated on 3 different testsets.",
        "the sparse data issue.",
        "SemPOS was evaluated on translation to Czech and to English, scoring better than or comparable to many established metrics.",
        "Metric",
        "Avg",
        "Best",
        "Worst",
        "Voidpar",
        "0.75",
        "0.89",
        "0.60",
        "Voidsons",
        "0.75",
        "0.90",
        "0.54",
        "Void",
        "0.72",
        "0.91",
        "0.59",
        "Functorsons",
        "0.72",
        "1.00",
        "0.43",
        "GTM",
        "0.71",
        "0.90",
        "0.54",
        "4-SemPOS+1-BLEU2",
        "0.70",
        "0.93",
        "0.43",
        "SemPOSpar",
        "0.70",
        "0.93",
        "0.30",
        "1-SemPOS+4-BLEUs",
        "0.70",
        "0.91",
        "0.26",
        "4-SemPOS+1-BLEUx",
        "0.69",
        "0.93",
        "0.43",
        "NIST",
        "0.69",
        "0.90",
        "0.53",
        "SemPOSsons",
        "0.69",
        "0.94",
        "0.40",
        "SemPOS",
        "0.69",
        "0.95",
        "0.30",
        "2-SemPOS+1-BLEU4",
        "0.68",
        "0.91",
        "0.09",
        "BLEU1",
        "0.68",
        "0.87",
        "0.43",
        "BLEU2",
        "0.68",
        "0.90",
        "0.26",
        "BLEU3",
        "0.66",
        "0.90",
        "0.14",
        "BLEU",
        "0.66",
        "0.91",
        "0.20",
        "TER",
        "0.63",
        "0.87",
        "0.29",
        "PER",
        "0.63",
        "0.88",
        "0.32",
        "BLEU4",
        "0.61",
        "0.90",
        "-0.31",
        "Functorpar",
        "0.57",
        "0.83",
        "-0.03",
        "Functor",
        "0.55",
        "0.82",
        "-0.09",
        "Metric",
        "Avg",
        "Best",
        "Worst",
        "3-SemPOS+1-BLEU4",
        "0.55",
        "0.83",
        "0.14",
        "2-SemPOS+1-BLEU2",
        "0.55",
        "0.83",
        "0.14",
        "2-SemPOS+1-BLEUi",
        "0.53",
        "0.83",
        "0.09",
        "4-SemPOS+1-BLEUs",
        "0.53",
        "0.83",
        "0.09",
        "SemPOS",
        "0.53",
        "0.83",
        "0.09",
        "BLEU2",
        "0.43",
        "0.83",
        "0.09",
        "SemPOSpar",
        "0.37",
        "0.53",
        "0.14",
        "Functorsons",
        "0.36",
        "0.53",
        "0.14",
        "GTM",
        "0.35",
        "0.53",
        "0.14",
        "BLEU4",
        "0.33",
        "0.53",
        "0.09",
        "Void",
        "0.33",
        "0.53",
        "0.09",
        "NIST",
        "0.33",
        "0.53",
        "0.09",
        "Voidsons",
        "0.33",
        "0.53",
        "0.09",
        "BLEU",
        "0.33",
        "0.53",
        "0.09",
        "BLEU3",
        "0.33",
        "0.53",
        "0.09",
        "BLEU1",
        "0.29",
        "0.53",
        "-0.03",
        "SemPOSsons",
        "0.28",
        "0.42",
        "0.03",
        "Functorpar",
        "0.23",
        "0.40",
        "0.14",
        "Functor",
        "0.21",
        "0.40",
        "0.09",
        "Voidpar",
        "0.16",
        "0.53",
        "-0.08",
        "PER",
        "0.12",
        "0.53",
        "-0.09",
        "TER",
        "0.07",
        "0.53",
        "-0.23"
      ]
    }
  ]
}
