{
  "info": {
    "authors": [
      "Yejin Choi",
      "Claire Cardie"
    ],
    "book": "Proceedings of the ACL 2010 Conference Short Papers",
    "id": "acl-P10-2050",
    "title": "Hierarchical Sequential Learning for Extracting Opinions and Their Attributes",
    "url": "https://aclweb.org/anthology/P10-2050",
    "year": 2010
  },
  "references": [
    "acl-C04-1200",
    "acl-D08-1013",
    "acl-D08-1083",
    "acl-H05-1043",
    "acl-H05-1044",
    "acl-I05-2011",
    "acl-J09-3003",
    "acl-P02-1022",
    "acl-W06-1673"
  ],
  "sections": [
    {
      "text": [
        "Hierarchical Sequential Learning for Extracting Opinions and their",
        "Attributes",
        "Yejin Choi and Claire Cardie",
        "Automatic opinion recognition involves a number of related tasks, such as identifying the boundaries of opinion expression, determining their polarity, and determining their intensity.",
        "Although much progress has been made in this area, existing research typically treats each of the above tasks in isolation.",
        "In this paper, we apply a hierarchical parameter sharing technique using Conditional Random Fields for fine-grained opinion analysis, jointly detecting the boundaries of opinion expressions as well as determining two of their key attributes – polarity and intensity.",
        "Our experimental results show that our proposed approach improves the performance over a baseline that does not exploit hierarchical structure among the classes.",
        "In addition, we find that the joint approach outperforms a baseline that is based on cascading two separate components."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Automatic opinion recognition involves a number of related tasks, such as identifying expressions of opinion (e.g. Kim and Hovy (2005), Popescu and Etzioni (2005), Breck et al.",
        "(2007)), determining their polarity (e.g. Hu and Liu (2004), Kim and",
        "Hovy (2004), Wilson et al.",
        "(2005)), and determining their strength, or intensity (e.g. Popescu and Etzioni (2005), Wilson et al.",
        "(2006)).",
        "Most previous work treats each subtask in isolation: opinion expression extraction (i.e. detecting the boundaries of opinion expressions) and opinion attribute classification (e.g. determining values for polarity and intensity) are tackled as separate steps in opinion recognition systems.",
        "Unfortunately, errors from individual components will propagate in systems with cascaded component architectures, causing performance degradation in the end-to-end system (e.g. Finkel et al.",
        "(2006)) – in our case, in the end-to-end opinion recognition system.",
        "In this paper, we apply a hierarchical parameter sharing technique (e.g., Cai and Hofmann (2004), Zhao et al.",
        "(2008)) using Conditional Random Fields (CRFs) (Lafferty et al., 2001) to finegrained opinion analysis.",
        "In particular, we aim to jointly identify the boundaries of opinion expressions as well as to determine two of their key attributes – polarity and intensity.",
        "Experimental results show that our proposed approach improves the performance over the baseline that does not exploit the hierarchical structure among the classes.",
        "In addition, we find that the joint approach outperforms a baseline that is based on cascading two separate systems."
      ]
    },
    {
      "heading": "2. Hierarchical Sequential Learning",
      "text": [
        "We define the problem of joint extraction of opinion expressions and their attributes as a sequence tagging task as follows.",
        "Given a sequence of tokens, x = xi ... xn, we predict a sequence of labels, y = yi ... yn, where y» G {0,9} are defined as conjunctive values of polarity labels and intensity labels, as shown in Table 1.",
        "Then the conditional probability p(y|x) for linear-chain CRFs is given as (Lafferty et al., 2001) where Zx is the normalization factor.",
        "In order to apply a hierarchical parameter sharing technique (e.g., Cai and Hofmann (2004), Zhao et al.",
        "(2008)), we extend parameters as follows.",
        "Opinion Expression",
        "Figure 1: The hierarchical structure of classes for opinion expressions with polarity (positive, neutral, negative) and intensity (high, medium, low) where gO and gO are feature vectors defined for Opinion extraction, gP and gP are feature vectors defined for Polarity extraction, and gS and gS are feature vectors defined for Strength extraction, and",
        "a, a e {opinion, no-opinion} ß,ß G {positive, negative, neutral, no-polarity} Y,ß G {high, medium, low, no-intensity} = ANo-opinion,opinion çO (no-opinion, opinion, x,i) + ANo-polarity, neutral çP (no-polarity, neutral, x + ANo-intensity, high ÇS (no-intensity, high, x, i)",
        "This hierarchical construction of feature and weight vectors allows similar labels to share the same subcomponents of feature and weight vectors.",
        "For instance, all A f (y»,x,i) such that y» G {1,2,3} will share the same component APOSITIVE gP(positve, x, i).",
        "Note that there can be other variations of hierarchical construction.",
        "For instance, one can add A<s gI(ö,x,i) and g'(5, ö,x,i) to Equation (1) for ö G",
        "{ 0, 1 , ... , 9 } , in order to allow more individualized learning for each label.",
        "Notice also that the number of sets of parameters constructed by Equation (1) is significantly smaller than the number of sets of parameters that are needed without the hierarchy.",
        "The former requires (2 + 4 + 4)+ (2 x 2 + 4 x 4 + 4 x 4) = 46 sets of parameters, but the latter requires (10) + (10 x 10) = 110 sets of parameters.",
        "Because a combination of a polarity component and an intensity component can distinguish each label, it is not necessary to define a separate set of parameters for each label."
      ]
    },
    {
      "heading": "3. Features",
      "text": [
        "We first introduce definitions of key terms that will be used to describe features.",
        "• PRIOR-POLARITY & PRIOR-INTENSITY:",
        "We obtain these prior-attributes from the polarity lexicon populated by Wilson et al.",
        "(2005).",
        "• EXP-POLARITY, EXP-INTENSITY & EXP-SPAN: i) Words in a given opinion expression often do",
        "not share the same prior-attributes.",
        "Such discontinuous distribution of features can make it harder to learn the desired opinion expression boundaries.",
        "Therefore, we try to obtain expression-level attributes (Exp-Polarity and Exp-Intensity) using simple heuristics.",
        "In order to derive Exp-Polarity, we perform simple voting.",
        "If there is a word with a negation effect, such as \"never\", \"not\", \"hardly\", \"against\", then we flip the polarity.",
        "For Exp-Intensity, we use the highest prior-intensity in the span.",
        "The text span with the same expression-level attributes are referred to as Exp-Span.",
        "positive",
        "positive",
        "positive",
        "neutral",
        "neutral",
        "neutral",
        "negative",
        "negative",
        "negative",
        "high",
        "medium",
        "low",
        "high",
        "medium",
        "low",
        "high",
        "medium",
        "low",
        "Label",
        "0",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "Polarity",
        "none",
        "positive",
        "positive",
        "positive",
        "neutral",
        "neutral",
        "neutral",
        "negative",
        "negative",
        "negative",
        "Intensity",
        "none",
        "high",
        "medium",
        "low",
        "high",
        "medium",
        "low",
        "high",
        "medium",
        "low",
        "Per-token features are defined in the form of go(a,x,i),gp(ß,x,i) and gs(Y,x,i).",
        "The domains of a, ß, y are as given in Section 3.",
        "Common Per-Token Features",
        "Following features are common for all class labels.",
        "The notation g indicates conjunctive operation of two values.",
        "• PART-OF-SPEECH(xi):",
        "based on GATE (Cunningham et al., 2002).",
        "• WORDNET-HYPERNYM(xi):",
        "based on WordNet (Miller, 1995).",
        "• OPINION-LEXICON(xi):",
        "based on opinion lexicon (Wiebe et al., 2002).",
        "• S HALLOW-PARSER(xi):",
        "based on CASS partial parser (Abney, 1996).",
        "• PRIOR-POLARITY(xi) Cg PRIOR-lNTENSITY(xi)",
        "• EXP-POLARITY(xi) Cg EXP-lNTENSITY(xi)",
        "• EXP-POLARITY(xi) Cg EXP-lNTENSITY(xi) Cg",
        "STEM(xi)",
        "boolean to indicate whether x» is in an Exp-Span.",
        "• DlSTANCE-TO-EXP-SPAN(xi): 0, 1, 2, 3 + .",
        "• EXP-POLARITY(xi) Cg EXP-lNTENSITY(xi) Cg EXP-SPAN(xi)",
        "Polarity Per-Token Features",
        "These features are included only for gO(a, x, i) and gS (y, x, i), which are the feature functions corresponding to the intensity-based classes.",
        "• PRIOR-POLARITY(xi), EXP-POLARITY((xi)",
        "• Stem(x») Cg Exp-Polarity(x»)",
        "• COUNT-OF-Polarity:",
        "where Polarity G {positive, neutral, negative}.",
        "This feature encodes the number of positive, neutral, and negative Exp-polarity words respectively, in the current sentence.",
        "• Stem(x») Cg COUNT-OF-Polarity",
        "• Exp-Polarity(x») Cg COUNT-OF-Polarity",
        "• Exp-Span(x») and Exp-Polarity(x»)",
        "• Distance-to-Exp-Span(x») Cg Exp-Polarity(xp)",
        "Intensity Per-Token Features",
        "• Prior-Intensity(x»), Exp-Intensity(x»)",
        "• Stem(x») Cg Exp-Intensity(x»)",
        "• COUNT-OF-STRONG, COUNT-OF-WEAK:",
        "the number of strong and weak Exp-intensity words in the current sentence.",
        "• Intensifier^): whether x» is an intensifier, such as \"extremely\", \"highly\", \"really\".",
        "• StrongModal(x»): whether x» is a strong modal verb, such as \"must\", \"can\", \"will\".",
        "• WeakModal(x»): whether x» is a weak modal verb, such as \"may\", \"could\", \"would\".",
        "• Diminisher(x»): whether x» is adiminisher, such as \"little\", \"somewhat\", \"less\".",
        "• Preceded-by-t (x»), Preceded-by-t(x») Cg Exp-Intensity(x»): where t G { Intensifier, StrongModal, Weak-MODAL, DIMINISHER}",
        "• T (xi) Cg EXP-lNTENSITY(xi),",
        "T (xi) Cg EXP-lNTENSITY(xi-i), T(xi-i) Cg EXP-lNTENSITY(xi+i)",
        "• Exp-Span(x») Cg Exp-Intensity(x»)",
        "• Distance-to-Exp-Span(x») Cg Exp-Intensity(xp)",
        "Transition features are employed to help with boundary extraction as follows:",
        "Polarity Transition Features",
        "Polarity transition features are features that are used only for gO (a, a, x, i) and gP (ß, ß, x, i).",
        "• Part-of-Speech(x») Cg Part-of-Speech(x»+i) Cg Exp-Polarity(x»)",
        "• Exp-Polarity(x») Cg Exp-Polarity(x»+i)",
        "Intensity Transition Features",
        "Intensity transition features are features that are used only for gO (a, a, x, i) and gS (y, 7, x, i).",
        "• Part-of-Speech(x») Cg Part-of-Speech(x»+i) Cg Exp-Intensity(x»)",
        "• Exp-Intensity(x») Cg Exp-Intensity(x»+i)"
      ]
    },
    {
      "heading": "4. Evaluation",
      "text": [
        "We evaluate our system using the Multi-Perspective Question Answering (MPQA) corpus.",
        "Our gold standard opinion expressions correspond to direct subjective expression and expressive subjective element (Wiebe et al., 2005).",
        "Our implementation of hierarchical sequential learning is based on the Mallet (McCallum, 2002) code for CRFs.",
        "In all experiments, we use a Gaussian prior of 1.0 for regularization.",
        "We use 135 documents for development, and test on a different set of 400 documents using 10-fold cross-validation.",
        "We investigate three options for jointly extracting opinion expressions with their attributes as follows:",
        "[Baseline-1] Polarity-Only n Intensity-Only:",
        "For this baseline, we train two separate sequence tagging CRFs: one that extracts opinion expressions only with the polarity attribute (using common features and polarity extraction features in Section 3), and another that extracts opinion expressions only with the intensity attribute (using common features and intensity extraction features in Section 3).",
        "We then combine the results from two separate CRFs by collecting all opinion entities extracted by both sequence taggers.",
        "This baseline effectively represents a cascaded component approach.",
        "[Baseline-2] Joint without Hierarchy: Here we use simple linear-chain CRFs without exploiting the class hierarchy for the opinion recognition task.",
        "We use the tags shown in Table 1.",
        "Joint with Hierarchy: Finally, we test the hierarchical sequential learning approach elaborated in Section 3.",
        "We evaluate all experiments at the opinion entity level, i.e. at the level of each opinion expression rather than at the token level.",
        "We use three evaluation metrics: recall, precision, and F-measure with equally weighted recall and precision.",
        "Table 4 shows the performance of opinion extraction without matching any attribute.",
        "That is, an extracted opinion entity is counted as correct if it overlaps with a gold standard opinion expression, without checking the correctness of its attributes.",
        "Table 2 and 3 show the performance of opinion extraction with the correct polarity and intensity respectively.",
        "From all of these evaluation criteria, Joint with hierarchy performs the best, and the least effective one is Baseline-1, which cascades two separately trained models.",
        "It is interesting that the simple sequential tagging approach even without exploiting the hierarchy (Baseline-2) performs better than the cascaded approach (Baseline-1).",
        "Method Description",
        "Positive",
        "Neutral",
        "Negative",
        "r(%) p(%) f(%)",
        "r(%) p(%) f(%)",
        "r(%) p(%) f(%)",
        "Polarity-Only n Intensity-Only (baseline i)",
        "29.6 65.7 40.8",
        "26.5 69.1 38.3",
        "35.5 77.0 48.6",
        "loint without Hierarchy (baseline2)",
        "30.7 65.7 41.9",
        "29.9 66.5 41.2",
        "37.3 77.1 50.3",
        "loint with Hierarchy",
        "31.8 67.1 43.1",
        "31.9 66.6 43.1",
        "40.4 76.2 52.8",
        "Table 2: Performance of Opinion Extraction with Correct Polarity Attribute",
        "Method Description",
        "High",
        "Medium",
        "Low",
        "r(%) p(%) f(%)",
        "r(%) p(%) f(%)",
        "r(%) p(%) f(%)",
        "Polarity-Only n Intensity-Only (baseline i)",
        "26.4 58.3 36.3",
        "29.7 59.0 39.6",
        "15.4 60.3 24.5",
        "loint without Hierarchy (baseline2)",
        "29.7 54.2 38.4",
        "28.0 57.4 37.6",
        "18.8 55.0 28.0",
        "loint with Hierarchy",
        "27.1 55.2 36.3",
        "32.0 56.5 40.9",
        "21.1 56.3 30.7",
        "Method Description",
        "r(%)",
        "p(%)",
        "f(%)",
        "Polar-Only n Intensity-Only",
        "43.3",
        "92.0",
        "58.9",
        "loint without Hierarchy",
        "46.0",
        "88.4",
        "60.5",
        "loint with Hierarchy",
        "48.0",
        "87.8",
        "62.0",
        "When evaluating with respect to the polarity attribute, the performance of the negative class is substantially higher than the that of other classes.",
        "This is not surprising as there is approximately twice as much data for the negative class.",
        "When evaluating with respect to the intensity attribute, the performance of the low class is substantially lower than that of other classes.",
        "This result reflects the fact that it is inherently harder to distinguish an opinion expression with low intensity from no opinion.",
        "In general, we observe that determining correct intensity attributes is a much harder task than determining correct polarity attributes.",
        "In order to have a sense of upper bound, we also report the individual performance of two separately trained models used for Baseline-1: for the Polarity-Only model that extracts opinion boundaries only with polarity attribute, the F-scores with respect to the positive, neutral, negative classes are 46.7, 47.5, 57.0, respectively.",
        "For the Intensity-Only model, the F-scores with respect to the high, medium, low classes are 37.1, 40.8, 26.6, respectively.",
        "Remind that neither of these models alone fully solve the joint task of extracting boundaries as well as determining two attributions simultaneously.",
        "As a result, when conjoining the results from the two models (Baseline-1), the final performance drops substantially.",
        "We conclude from our experiments that the simple joint sequential tagging approach even without exploiting the hierarchy brings a better performance than combining two separately developed systems.",
        "In addition, our hierarchical joint sequential learning approach brings a further performance gain over the simple joint sequential tagging method."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "Although there have been much research for finegrained opinion analysis (e.g., Hu and Liu (2004), directly comparable to our results; much of previous work studies only a subset of what we tackle in this paper.",
        "However, as shown in Section 4.1, when we train the learning models only for a subset of the tasks, we can achieve a better performance instantly by making the problem simpler.",
        "Our work differs from most of previous work in that we investigate how solving multiple related tasks affects performance on sub-tasks.",
        "The hierarchical parameter sharing technique used in this paper has been previously used by Zhao et al.",
        "(2008) for opinion analysis.",
        "However, Zhao et al.",
        "(2008) employs this technique only to classify sentence-level attributes (polarity and intensity), without involving a much harder task of detecting boundaries of sub-sentential entities."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We applied a hierarchical parameter sharing technique using Conditional Random Fields for finegrained opinion analysis.",
        "Our proposed approach jointly extract opinion expressions from unstructured text and determine their attributes – polarity and intensity.",
        "Empirical results indicate that the simple joint sequential tagging approach even without exploiting the hierarchy brings a better performance than combining two separately developed systems.",
        "In addition, we found that the hierarchical joint sequential learning approach improves the performance over the simple joint sequential tagging method."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported in part by National Science Foundation Grants BCS-0904822, BCS-",
        "Homeland Security under ONR Grant N0014-07-1-0152.",
        "We thank the reviewers and Ainur Yesse-nalina for many helpful comments."
      ]
    }
  ]
}
