{
  "info": {
    "authors": [
      "Sheldon Klein"
    ],
    "book": "Theoretical Issues in Natural Language Processing",
    "id": "acl-T75-2018",
    "title": "Meta-Compiling Text Grammars As a Model for Human Behavior",
    "url": "https://aclweb.org/anthology/T75-2018",
    "year": 1975
  },
  "references": [],
  "sections": [
    {
      "heading": "META-COMPILING TEXT GRAMMARS AS A MODEL FOR HUMAN BEHAVIOR",
      "text": []
    },
    {
      "heading": "I. BACKGROUND",
      "text": [
        "In our efforts to model the totality of synchronic and diachronic language behavior in complex social groups, we developed a meta-symbolic simulation system that includes a powerful behavioral simulation programming language that models, generates and manipulates events in the notation of a semantic network that changes through time, and a generalized, semantics-to-surface structure generation mechanism that can describe changes in the semantic universe in the syntax of any natural language for which a grammar is supplied.",
        "Because the system is a meta-theoretical device, it can handle generative semantic grammars formulated within a variety of theoretical frameworks.",
        "A key feature of the system is that the semantic deep structure of the non-verbal, behavioral rules may be represented in the same network notation as the semantics for natural language grammars, and, as a consequence, provide non-verbal context for linguistic rules.",
        "We are also experimenting with a natural language meta-compiling capability, that is, the use of the semantic network to generate productions in the simulation language itself -- productions in the form of 'texts' that may themselves be compiled as new behavioral rules during the flow of the simulation -- rules that may themselves control the process of deriving new rules.",
        "This feature permits non-verbal behavioral rules to be derived from natural language conversational inputs, and through inference techniques identical with those for inferring natural language generative semantic grammars.",
        "The total system has the power of at least the 2nd order predicate calculus, and will facilitate the formulation of highly abstract meta-models of discourse, including the logical quantification of such models.",
        "Achievements with the generative portion of the system include a text grammar model that generates 2100 word murder mystery stories in less than 19 seconds each, complete with calculation of the plot and specification of the deep structure as well as the surface syntax (Klein et al. 1973).",
        "The speed of this generation is 100 to 1000 times faster than other existing programs using transformational grammars.",
        "(The algorithm for the semantics-to-surface structure generative component is such that processing time increases only linearly as a function of sentence length and syntactic complexity.)",
        "More recent achievements include models of portions of Levi-Strauss' mythology work in The Raw & the Cooked (Levi-Strauss 1969) and a model for Propp's Morphology of the Folktale (Propp 1968) which generated 50 Russian fairytales, according to the rules of his text grammar, at an average speed of 128 words a second, again including plot computations and specification of deep structure as well as surface syntax (Klein et al. 1974, Klein et al. 1975).",
        "Our earliest automatic text generation work used syntactic dependency network/graphs with 2•valued labelling of edges as an approximation to semantic network/graphs with multivalued labelling of edges (Klein & Simmons 1963, Klein 1965a, 1965b).",
        "Our work on automatic inference of grammars includes the world's first program for learning context free, phrase structure grammars, for both natural and artificial languages, and the first program for learning transformational grammars (Klein 1967, Klein et al. 1968, Klein & Kuppin 1970).",
        "More recent inference work includes the formulation of techniques for automatic inference of generative semantic grammars (Klein 1973) and for the ontogeny of Pidgin and Creole languages (Klein & Rozencvejg 1974).",
        "In formulating components for automatic inference of rules in the meta-symbolic simulation system, we find that the common notation for the semantics of the non-verbal behavioral simulation rules and natural language means that the same learning heuristics may be used to infer behavioral rules as well as linguistic rules.",
        "The implication is that the totality of human verbal and non-verbal behavior, in complex social groups, both synchronically and diachronically, may now be modelled within the same notational framework.",
        "What for us started as a generalized device for testing varying theoretical models as part of an effort to model language change and variation (Klein 1974a, Klein & Rozencvejg 1974) now appears as the basis for a higher level theory of the linguistic basis of human behavior (Klein 1974b).",
        "II.",
        "WHAT IS A TEXT GRAMMAR?",
        "The text grammarian movement, centered in Germany and Holland, includes work such as that of van Dijk, Ihwe, Petcifi and Rieser (1972), PetOfi and Rieser (1973), Petafi (1973), van Dijk (1973), and van Dijk and Petiifi (1974).",
        "The underlying motivation of this group is the belief that Chomskian derived linguistic theories are inadequate to handle the complexities of complex narrative and discourse -- that more powerful logical devices are needed.",
        "An attempted refutation of the text grammarian position appeared in Dascal & Margalit (1974).",
        "Our own work on Propp and Levi-Strauss models refutes the refutation by demonstration (Klein et al. 1974).",
        "To provide the reader with an intuitive view of the nature of a text grammar, we offer the following two Russian fairytales generated by our automated model of Propp (Klein et al. 1974).",
        "The same text grammar",
        "generated both stories from a structural model at a level of abstraction that provided a semantic unification of the apparent surface diversity.",
        "Tale 1 THE BORISIEVICHES LIVE IN A DISTANCE PROVINCE.",
        "THE FATHER IS EMELYA.",
        "THE ONLY SON IS BORIS.",
        "MARTHA IS THE ONLY DAUGHTER.",
        "EMELYA HAS THE SHEEP.",
        "BORIS, MARTHA AND THE SHEEP ARE IN THE WOODS.",
        "BORIS SAYS MARTHA, DO NOT LEAVE THE WOODS.",
        "BORIS LEAVES TO GO BERRY GATHERING."
      ]
    },
    {
      "heading": "MARTHA LEAVES THE WOODS.",
      "text": [
        "A WOLF APPEARS IN THE DISTANT PROVINCE.",
        "EMELYA ASKS THE WOLF WHERE IS YOUR WISDOM.",
        "THE WOLF SAYS THAT MY WISDOM IS IN A MAGIC EGG."
      ]
    },
    {
      "heading": "THE WOLF PLUNDERS THE SHEEP. EMELYA SENDS MARTHA TO SEARCH FOR THE WOLF. MARTHA DECIDES TO SEARCH FOR THE WOLF. MARTHA LEAVES ON A SEARCH. MARTHA MEETS A WITCH ALONG THE WAY. THE WITCH PROPOSES THAT MARTHA LISTEN TO THE GUSLA WITHOUT FALLING ASLEEP. MARTHA RESPONDS BY STAYING AWAKE WHILE LISTENING TO THE GUSLA.",
      "text": [
        "A MAGIC WAFER IS CONSUMED BY MARTHA.",
        "MARTHA OBTAINS SUPERHUMAN STRENGTH."
      ]
    },
    {
      "heading": "MARTHA TRAVELS TO THE LOCATION OF THE WOLF IN ANOTHER KINGDOM. MARTHA IS DIRECTED BY A HEDGEHOG. MARTHA FINDS THE WOLF THEY FIGHT IN AN OPEN FIELD. MARTHA IS WOUNDED. MARTHA DEFEATS THE WOLF WITH THE AID OF SUPERHUMAN STRENGTH.",
      "text": []
    },
    {
      "heading": "BALDAK CALLS FOR HELP FROM NICHOLAS.",
      "text": [
        "NICHOLAS DECIDES TO SEARCH FOR THE MAGIC STEED."
      ]
    },
    {
      "heading": "NICHOLAS LEAVES ON A SEARCH. NICHOLAS MEETS A JUG ALONG THE WAY.",
      "text": [
        "THE JUG IS FIGHTING WITH ELENA OVER A MAGIC BOW.",
        "THE JUG ASKS NICHOLAS TO DIVIDE THE MAGIC BOW."
      ]
    },
    {
      "heading": "NICHOLAS TRICKS THE DISPUTANTS INTO LEAVING",
      "text": []
    },
    {
      "heading": "III. THE KEY QUESTION",
      "text": [
        "We perceive the locus of theoretical interest to be the process of verbal and non-verbal behavior transmission across generations.",
        "Our work on modelling speech communities includes designs for simulations in which many modelled individuals, each with his own semantic network, his own grammar(s), his own behavior rules, interact with each other according to the modelled rules of the social structure of the society (Klein 1974a).",
        "It is our hope to be able to model the transmission process of all the rules in the system.",
        "This means that newly born modelled individuals will infer rules for natural language and also for non-verbal behavioral simulation rules, as a function of inputs of texts supplied by other modelled individuals.",
        "The texts may be verbal discourse, or non-verbal sequences of behavior.",
        "The learning individual will actually compile and recompile new versions of his own behavioral rules as the simulation process proceeds.",
        "His own test productions of behavior scenarios as well as natural language discourse will be subject to evaluation and possible correction by other members of the modelled community, and their reactions as well as the consequences of the productions, will serve as a control on the entire learning process.",
        "And, as indicated earlier, the rules to be inferred, compiled and recompiled will include rules that govern the process of inference and compilation itself."
      ]
    },
    {
      "heading": "IV. LOGICAL QUANTIFICATION, SEMANTIC PARSING, PRESUPPOSITIONAL ANALYSIS",
      "text": [
        "We have mentioned the 2nd order or higher predicate calculus.",
        "For our purposes, the essential feature is that the logical quantification of the rules may be quantified by the contents of the rules themselves.",
        "Meta-compiling of rules governing meta-compiling is an example of this process.",
        "There are other techniques available.",
        "The behavioral rules operate with high-level classes that make it possible to formulate rules that can treat objects, characters and complex actions as manifestations of the",
        "same abstract semantic unit.",
        "A major type of behavior rule modification and extension is the ability to requantify the rules as a heuristic function of experience.",
        "The process does not involve recompilation -- rather modification of the domain of applicability of an existing rule.",
        "One of the types of semantic parsing possible in the system is the determination of the presuppositions of the semantic content of input text.",
        "The scenario rules that could have generated the text have preconditions, and these preconditions also have their own preconditions as specified by other rules.",
        "In cases where the semantic content of an input text is not potentially derivable from existing behavioral rules, the system can posit requantification (assignments and reassignments to semantic classes) to make the input text derivable.",
        "Or, if necessary, the same end can be achieved by compiling new rules that would make the text plausible.",
        "Generalization of the method makes it possible to build complex learning models for highly abstract, semantically driven text grammars.",
        "Perhaps the ultimate test is the modelling of the heuristic processes of Levi-Strauss.",
        "We hope to be able to build a model that learns text grammars with arbitrarily abstract semantics such as that manifested in Levi-Strauss (1969).",
        "At the moment, we are working on modelling the text grammar he himself has derived (Klein et al. 1975).",
        "The potential of our work is to handle a degree and kind of abstraction in semantics heretofore untouched by linguistics, including the modelling of the automatic creation of text grammars for dreams and myths as a function of cultural rules."
      ]
    },
    {
      "heading": "V. GENERALITY OF THE META-SYMBOLIC SIMULATION SYSTEM AS A THEORY TESTING DEVICE",
      "text": [
        "Our methodology and programming style have yielded a system wherein all the rules, and even the form of the theories in which they are cast, are input as data.",
        "As far as we can determine, this permits us to encode in our system virtually all the theoretical models currently prevalent in linguistics, plus heretofore unformulated models of vastly greater power.",
        "(Preliminary work in the classroom, for example, indicates that models of the work of Schenk and his students may easily be implemented in our system, with an increased speed of execution of about 50 to 1 in favor of our versions.)",
        "VI.",
        "THE METHODOLOGICAL SIGNIFICANCE OF OUR WORK Our work over the years has suggested and reinforced the following methodological principles:",
        "1.",
        "No significant theories can be formulated in Linguistics that are not computed based.",
        "2.",
        "The theoretical foundations of Computer Science are identical with those of Linguistics.",
        "3.",
        "Theoretical linguistic models that are not strongly linked to objective tasks are meaningless.",
        "No semantics is meaningful except in terms of the objective tasks it facilitates.",
        "4.",
        "The future of Linguistics,",
        "operating system for a 4th generation computer.",
        "5.",
        "An adequate linguistic theory must account for the function of language in social groups and its transmission through time and space.",
        "At the same time, such a theory must account for the highest semantic attainments of the human mind, including literature and art, and, in fact, the totality of symbolic processes.",
        "6.",
        "Input/output equivalence of model and modelled does not imply",
        "isomorphism between model and modelled.",
        "(Chomskian beliefs to the contrary have their roots in Leibniz' Theory of Monads and its required ontological argument.)",
        "There are no models of performance, only models of competence which can be compared, one against the other, for accuracy in predicting relations between input and output in real world systems.",
        "VII.",
        "THEORETICAL IMPLICATIONS A.",
        "The Non-inateness of Human Mental Structures Our work constitutes a refutation by counter example of the necessity for a correlation between models of human mental structures and the structure of the human brain.",
        "(A software system can operate with no inherent isomorphisms with a particular computer.)",
        "Nothing need be innate except the meta-compiling capacity and the perception of time.",
        "Our work suggests the logical possibility that the human mind can learn to learn, and learn how to learn to learn, and that each human may do it differently.",
        "The basic principles of language inference, which can be derived from a behavioristic psychological framework, can alone account for the structuring of mental processes as a software phenomenon, independent of physiological reality.",
        "It follows that humans can have different rules, different data structures, different hierarchical",
        "organizations, where the only controlling factor is the requirement that the internalized models permit the individuals to function and interact with the inputs and outputs of other individuals in a social group.",
        "B.",
        "History as the Metalanguage of History Implicit in our approach is an alternative to the concept of an infinite hierarchy of meta-languages, as formulated by Bertrand Russell in his Theory of Types in Principia Mathematica (Whitehead Russell 1911-1913).",
        "The concept of successive states of time, each linked with the possibility of defining (meta-compiling) new rules of the universe for the next state, (including the rules for defining new rules), suggests that there need be only a single metalanguage and a single language in any state at any point in time, and that each serves, in turn, as the metalanguage for the other in successive time frames.",
        "This is not a stochastic process.",
        "It is the concepts of time and meta-compiling that appear to be the fundamental aspects of human cognition.",
        "The principle may be universal for all human behavioral/symbolic processes, and students of the philosophy of history will now recognize our meta-symbolic simulation system as equivalent to an automated Hegelian dialectic philosophy which specifies that each successive state of historical development is controlled by the metalanguage of its previous state, and becomes the metalanguage of its successor state."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
