{
  "info": {
    "authors": [
      "Charles F. Schmidt"
    ],
    "book": "Theoretical Issues in Natural Language Processing",
    "id": "acl-T75-2037",
    "title": "Understanding Human Action",
    "url": "https://aclweb.org/anthology/T75-2037",
    "year": 1975
  },
  "references": [],
  "sections": [
    {
      "heading": ". INTRODUCTION",
      "text": [
        "Wittgenstein has said, \"If a lion could 51k, we could not understand him\" (1958).",
        "ae point of this rather cryptic comment is idoubtedly Wittgenstein's contention that inguage or \"language games\" are embedded in lathe termed \"forms of life.\"",
        "That is, we 'e able to understand each other not just 5cause we share common knowledge about the rntactic and semantic conventions for the 5e of words, but also because we share ammon knowledge about the forms of life or )cial reality within which we live and act.",
        "Lttgenstein s remarkable lion would 'esumably not share our social reality nor a have knowledge of the lion's social aality.",
        "Consequently, Wittgenstein would intend that this lion's exhibition of Beech would not result in our being able to ,mmunicate with him nor he with us.",
        "If Wittgenstein were here today, he Lght well contend that a computer that pesn't understand the forms of life of man Ill not really be able to understand the peech of man.",
        "Such an assertion would probably 3nerate quite a bit of controversy amongst 'lose of us interested in natural language aderstanding.",
        "Clearly, how one reacts to lis assertion will depend upon how one Lshes to explicate the notion of lderstanding.",
        "As a psychologist primarily lterested in how persons understand and Dmmunicate with each other, I am inclined ) take Wittgenstein's contention quite ariously.",
        "The work on belief systems, which will a discussed here, has been aimed at Kploring and explicating this relationship etween language use or language games and he larger social reality or forms of life ithin which these language games are layed.",
        "Consequently, the focus of this ork has not been upon the parsing of entences nor even upon the understanding of aragraphs, but rather upon the nderstanding of human action.",
        "In pursuing this line of research, it as been assumed that language use is not nderstood in this stronger sense of nderstand unless what someone says can be elated to and understood in terms of the peaker's beliefs, intentions, and goals.",
        "The central notions in reasoning about uman action are the concepts of a plan and f a reason or motive for performing a plan.",
        "person's action is explained or understood hen this action can be identified as part f the actor's plan and the reason why the ctor chose to perform that plan can be iven.",
        "A model of how persons reason about uman action must include then: (1) assumptions about how actors reason about human action, that is, how a person arrives at a plan; (2) assumptions about what can count as a reason for a person choosing to perform or carry out a plan of action; and, finally, in order to use this theory as a recognizer of plans one must include (3) procedures for moving from the observation or linguistic report of actions to the identification of the plans and motivations that have generated these reported or observed actions of other persons.",
        "Natural language is used to describe, explain and evaluate human action and speaking is itself a human action.",
        "Thus, natural language provides both the metalanguage that is used to discuss human action and the vehicle for performing the various human actions which Austin, Searle, and others (cf. Austin, 1962; Searle, 1969; Strawson, 1964; Gandhi, 1974) have referred to as speech acts.",
        "Consequently, a goal of this research is to develop a system which will accept a linguistically encoded description of a sequence of actions and then be capable of answering questions about the beliefs and motivations which the system believes explains these actions.",
        "Since natural language represents the metalanguage within which human action is described and explained, natural language has been examined in order to identify the concepts which are peculiar to the discussion of human action.",
        "Once these concepts are identified, then the problem is one of determining: (1) how to represent these concepts; (2) how these concepts are organized into a \"theoretical\" system; and (3) the nature of the processes which use this system of concepts to reason about reported or observed actions.",
        "In the development of BELIEVER some fairly concrete ideas about the representation and organization of these concepts have been developed and various procedures for using these concepts to identify the plans and purposes of the actors have been tried, but this latter problem remains an area where a great deal of work must yet be done.",
        "In order to try to communicate our thinking as succinctly as possible the introduction of technical notation will be avoided.",
        "The papers by Schmidt (1972; Schmidt and D'Addamio, 1973) and by Bruce (Bruce and Schmidt, 1974; Bruce, 1974) all focus upon representation and organization.",
        "The papers by Schmidt(1973) and Brown(1974) discuss the implemetation of earlier algorithms for plan recognition and the interested reader is referred to these papers for additional detail and technical discussion.",
        "The assumption that action is understood by attributing a plan and motive to the actor has highlighted the importance of the following types of concepts which are found in natural language.",
        "Those concepts which have figured prominently in the theoretical development are: (1) Acts such as: give, buy, say, ask, promise, help, ... (2) Act Relations such as: make possible, motivate, prevent, allow, ... (3) Cognitive",
        "States such as: believe, know, expect, ... (4) Dispositional Properties such as: can, ought, ... (5) Motivational States such as: want, desire, ... (6) Role Relations such as: father of, friend of, ... and Role Terms such as: father, friend, customer, ... (7) Evaluative States such as: values, likes, hates, ....",
        "Conceptual types 1 through 3 above and the concept of 'can' figure most prominently in reasoning about plans, whereas conceptual types 5 through 7 and the concept of 'ought' are importantly involved in reasoning about motive.",
        "II.",
        "PLANS AND THE REPRESENTATION OF ACTS Considered from the point of view developed here, a plan is not simply an appropriately structured sequence of actions.",
        "Rather, a plan is the internal representation or set of'beliefs about how a particular goal may be achieved that is attributed to the actor in order to explain the observed or reported actions of that particular actor.",
        "This distinction is important to recognize in thinking about human action.",
        "Failure to maintain this distinction can lead one to consider the following two statements to be equivalent: (A) P performed act(i) and state(k) was a consequence of act(i) and state(k) enabled P to perform act(j).",
        "(B) P performed act(i) and state(k) was a consequence of act(i) and state(k) enabled P to perform act(j) and P performed act(i) in order to be able to perform act(j).",
        "It is obvious from the way in which A and B have been stated that B implies A but not the converse.",
        "The second statement attributes to the actor the belief that doing act(i) would result in his being able to do act(j).",
        "Thus, the logic of explaining action in terms of plans involves more than a recognition of an intersection between a consequence of one action and a precondition on some subsequent action.",
        "If it did not our jails would be much fuller.",
        "If plans do involve beliefs of this type and if we agree that statement A does not imply statement B then precisely how are we able, as observers of actions, to move at times from an observation or report which satisfies A to a statement equivalent to B?",
        "One possibility is that we might directly observe beliefs.",
        "Except for a few staunch believers in ESP, this position seems to have very few adherents.",
        "A second possibility is that we are able to make observations of one kind or another which are independent of the observed actions which allow us to regularly and reliably infer the belief states of others.",
        "There are a few psychologists who seem willing to argue for this position in principle although I know of no psychological evidence to support this position.",
        "In any case, it seems unlikely that our commonsense theory of human action contains rules of inference of this type which have somehow escaped the notice of the scientists in psychology.",
        "Having argued that beliefs are attributed to another neither through a process of deduction nor a process of induction, the problem of trying to characterize exactly what kind of \"logic\" is involved remains.",
        "The logic of this type of reasoning may be roughly characterized in the following way.",
        "First, if the observer has made some observation which is of the form of statement A, then the observer recognizes that this observation counts as one reason for believing that a statement of the form of B is the case.",
        "The observer may know or believe other propositions which may also count as reasons for believing a proposition of the form of B and the observer may know or believe still other propositions which may count as reasons for not believing that a statement of the form of B correctly characterizes the beliefs of the actor.",
        "Next, the consistency of these various reasons must be assessed.",
        "The action is understood when the observer has arrived at some consistent set of reasons for attributing to the actor certain beliefs and motives which explain the actor s performance of the action in question.",
        "Now if this accurately characterizes the reasoning process, then acts must, for purposes of reasoning about plans, be represented in a fashion that will yield access to the kinds of beliefs that must be attributed to the actor if his action is to be described using a particular act concept.",
        "For example, the action 'P handing a quarter to R' where P and R are two different persons, may under various circumstances be described as an act of 'buying,' 'repaying,' 'helping,' and so on.",
        "Which particular description is most appropriate will depend upon whether or not there is a basis for attributing to the actor, P, the additional beliefs and motives that are implied by the concepts 'buy, repay, and 'help.' The class of actions termed speech acts has been extensively discussed and the nature of our approach to representing acts may be briefly exemplified by considering the speech act request' or 'ask.' Table 1 presents in a very informal way the kinds of information which must be represented and associated with 'request' in some way in order to capture the structure of the plan or subplan that 'request' stands for.",
        "Those terms in Table 1 which have been capitalized form the basis for the formal representation of speech acts.",
        "Except for those statements which appear under the subheading of Outcome Possibilities, each statement refers to psychological states of the actors.",
        "Thus, an act name is simply a way of organizing a set of beliefs about how a \"move\" of this type might be related to other moves or actions and to the cognitive and motivational states of the actors.",
        "The statements referred to as the Can Conditions express those conditions which must be true in order for this action to have been planned.",
        "C1 expresses the fact that the agent must have believed that he was able to transmit his message to the recipient.",
        "This is expressed at a very",
        "general level by stating that any causing which the agent performs which brings about the recipient's knowledge of the agent's message can count as an action done in order to partially make possible the performance of the request.",
        "For example, uttering a sentence in the recipient's presence, sending the recipient a telegram or letter, requesting another person to give the message to the recipient, etc.",
        "are all actions which could under the appropriate circumstances be viewed as part of the agent's requesting X of the recipient.",
        "Thus, the information in C1 provides a basis for generating hypotheses about how other observed actions might be related to this plan of requesting.",
        "Statements C2 and C3 differ from Cl in that whereas Cl states that some action of a particular type must be taken by the agent, statements C2 and C3 simply state expectations that the agent must have.",
        "However, by stating what conditions the agent must expect, these statements may also provide a basis for recognizing that previous actions are related to the plan of requesting.",
        "For example, if the agent first addresses the recipient by name, this action may have been done in order to provide a basis for expecting that the recipient will listen to his request.",
        "Similarly, the agent may precede a request for a ride home with a request for information about whether or not the recipient drove to work today.",
        "This information would provide the agent the basis for forming a belief about condition (3) of C3.",
        "Whereas the Can Conditions provide a basis for generating hypotheses about how previous actions might fit into the plan of requesting, the Goal Hypotheses provide the information needed to generate hypotheses about how the action of requesting might itself fit into some larger plan of the agent.",
        "For example, G2 provides the basis for the hypothesis that the purpose of the agent's request was to create in the recipient some set of beliefs that will partially provide the reason or motivation for the recipient to cause X.",
        "The Outcome Possibilities express the information needed to recognize cases where A's plan goes awry or generates side-effects which enable latter actions which were not the focus of the agent's plan.",
        "For example, someone might overhear the agent's request and offer to fulfill the agent's request.",
        "This would then be a very different situation from the one that might result from a similar offer from the intended recipient of the request.",
        "In 01, 02 and in the various normative statements the concept UNDERSTAND is introduced.",
        "UNDERSTAND is being used here in a technical sense that deserves comment.",
        "From the point of view of BELIEVER, part of the actor's knowledge of his social world is that other person's are capable of interpreting and coming to an understanding of any observed action.",
        "That is, other persons also possess belief systems and therefore in communicating with another one must recognize that the overt action, what has been termed the message, will be interpreted by others within the context of their beliefs about the actor's plan and motive.",
        "Thus, the theory of human action is essentially recursive.",
        "This is recognized more explicitly in the statement of C3 which states that the agent must select a message which when taken together with the agent s beliefs about the recipient's current beliefs can be expected to result in the recipient arriving at an understanding of the agent's action as a request.",
        "This characteristic of communication helps to explain why most everyday communication occurs in such an abbreviated form.",
        "To use a non-abbreviated form can be insulting since it could be interpreted by the recipient as a presupposition by the agent that the recipient is unable to recognize and understand the other's action.",
        "The term COMMUNICATIONACT is used in 01 and 02 in recognition of the fact that the recipient or observer of an action may understand the agent's action in a way other than that intended by the agent."
      ]
    },
    {
      "heading": "The Motivational Hypotheses and Normative Obligations represent statements",
      "text": [
        "which are most importantly involved in reasoning about motive.",
        "The Motivational Hypotheses provide the basis for generating hypotheses about the agent's wants whereas the Normative Obligations provide information about the motivational side effects of performing actions to which various social norms apply.",
        "For example, N1 is essentially a statement of the sincerity norm which applies to all communication acts and asserts that the communicator ought to believe what he is communicating.",
        "N2 states that it is improper to ignore someone whom you believe is speaking to you.",
        "N2 is related to C2 since N2 provides the norm which can be used to provide the basis for expecting another person to try to understand the agent's message.",
        "Finally, N3 states that if the recipient has understood the agent's action as a request and if the recipient is not planning to fulfill that request, then the recipient ought to explain to the agent why he will not honor the request.",
        "Thus, this norm provides a basis for generating hypotheses about the recipient's response to the agent's request or the agent's response to the lack of a response from the recipient.",
        "This latter case is especially important since one of the interesting characteristics of human action is that under certain circumstances, the lack of a response counts as an action which itself must be explained.",
        "Clearly, if an act of omission is to be recognized, the observer must have a basis for expecting the act that was omitted.",
        "N3 also provides the basis for various strategic actions.",
        "For example, the panhandler who asks a bypasser for a dollar and then demands with great moral indignation an explanation for the bypasser 's lack of response is playing upon this particular norm.",
        "Having focussed in some detail upon the presentation of this one particular act, is now possible to briefly and roughly ate the position that this leads to ncerning memory and inference.",
        "First, it assumed that human conceptual memory is some sense organized around various ints-of-view.",
        "The representation sketched Table 1 suggests the 'meaning' of equest' from our Belief System point of ew.",
        "However, 'request' also has a presentation from a linguistic point of ew and this would require that different nds of information and relations be ecified that would reflect this point of ew.",
        "Thus, the general assumption is that ncepts can play various roles in various heories' that the Understander posseses.",
        "ich particular point of view is \"active\" a particular time should depend upon the als of the understanding system at that dnt in time.",
        "Thus, the position here is t that the kind of representation for the mcept 'request' that is presented in Table replaces or is logically prior to a :presentation of 'request' as a linguistic itity.",
        "Secondly, and more specifically with aspect to the conceptual memory for )ncepts within the Belief Systems domain, le assumption has been made that the Tanization of knowledge reflects the role iat that knowledge plays within the ;heory' that the Understander uses to Cason about the domain.",
        "The various Ibheadings provided in Table 1 and the Lscussion of this information was intended ) reflect the view that the conceptual :ructures of human memory contain formation about how they fit into or can used to answer or reason about the arious types of questions that must be anerated and answered by a reasoning rocess that is attempting to understand an ction in a particular way.",
        "Thus, these Incepts are \"hypotheses\" laden structures hich serve as the basis for generating the oals and subgoals of the reasoning process.",
        "rom this point of view, reasoning about ction is itself a goal driven process where he \"top-level\" goals are to find a plan and motive for the actor which explains his ction.",
        "An attempt to view the actor's ction as a request, provides the basis for enerating new goals for the understanding ystem.",
        "That is, the request structure pecifies the kind of additional information o be assembled which would count as reasons or viewing the observed act as a request.",
        "Finally, since it is assumed that the nderstanding of human action is a heory-driven process, it is also assumed hat the representation of particular events n memory reflects the operation of this ,heory.",
        "Understanding is viewed as a :onstructive process and what will be 'emembered is not simply a representation of 'what happened\", but rather an organization ?rid elaboration of what happened that 'eflects the way in which the observer has lnderstood what happened."
      ]
    },
    {
      "heading": "Acknowledgements: G. Brown, B. Bruce, J.",
      "text": [
        "Goodson, A. Sedlak and N. Sridharan have all been involved at one time or antoher in this work on belief systems and they along with S. Amarel and W. Fabens have contributed to much of the work described here.",
        "Most of what makes sense in this paper is due to their various contributions.",
        "The nonsense is the author's own."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
