{
  "info": {
    "authors": [
      "Douwe Gelling",
      "Trevor Cohn",
      "Phil Blunsom",
      "Joao Graca"
    ],
    "book": "Proceedings of the NAACL-HLT Workshop on the Induction of Linguistic Structure",
    "id": "acl-W12-1909",
    "title": "The PASCAL Challenge on Grammar Induction",
    "url": "https://aclweb.org/anthology/W12-1909",
    "year": 2012
  },
  "references": [
    "acl-D07-1031",
    "acl-D07-1043",
    "acl-D07-1096",
    "acl-D10-1056",
    "acl-D10-1117",
    "acl-D10-1120",
    "acl-D11-1036",
    "acl-D11-1059",
    "acl-E99-1010",
    "acl-J92-4003",
    "acl-J93-2004",
    "acl-N06-1041",
    "acl-P04-1061",
    "acl-P07-1031",
    "acl-P11-1067",
    "acl-P11-1087",
    "acl-W06-2920",
    "acl-W07-0604",
    "acl-W12-1910",
    "acl-W12-1911",
    "acl-W12-1912",
    "acl-W12-1913",
    "acl-W12-1914",
    "acl-W12-1915"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents the results of the PASCAL Challenge on Grammar Induction, a competition in which competitors sought to predict part-of-speech and dependency syntax from text.",
        "Although many previous competitions have featured dependency grammars or parts-of-speech, these were invariably framed as supervised learning and/or domain adaption.",
        "This is the first challenge to evaluate unsupervised induction systems, a sub-field of syntax which is rapidly becoming very popular.",
        "Our challenge made use of a 10 different treebanks annotated in a range of different linguistic formalisms and covering 9 languages.",
        "We provide an overview of the approaches taken by the participants, and evaluate their results on each dataset using a range of different evaluation metrics."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Inducing grammatical structure from text has long been fundamental problem in Computational Linguistics and Natural Language Processing.",
        "In recent years interest has grown, spurred by advances in unsupervised statistical modelling and machine learning.",
        "The task has relevance to cognitive scientists and linguists attempting to gauge the learnability of natural language by human children, and also natural language processing researchers who seek syntactic representations for languages with few linguistic resources.",
        "Grammar learning has been popular in previous challenges.",
        "For example the CoNLL shared tasks in 2006 and 2007 (Buchholz and Marsi, 2006; Nivre et al., 2007) involved supervised learning of dependency parsers across a wide range of different languages.",
        "Our challenge has many similarities to these, in that we focus on dependency grammars, however we seek to evaluate unsupervised algorithms only using syntactically annotated data for evaluation and not for training.",
        "Additionally we also consider the related task of part-of-speech (POS) induction, and the next logical challenge: the joint task of POS and dependency induction.",
        "Other related challenges can be found in the formal grammar community (e.g., the Omphalos1 competition) in which competitors seek to learn synthetic languages.",
        "In contrast we seek to model natural language text, which entails many different challenges.",
        "Research into unsupervised grammar and POS induction holds considerable promise, although current approaches are still a long way from solving the general problem.",
        "For example, the majority of recent research into dependency grammar induction has adopted the evaluation setting of Klein and Manning (2004) who learn grammars on strings of POS tags, rather than on words themselves.",
        "One aim of this challenge is to popularise the more difficult and ambitious task of inducing grammars directly from text, which can be viewed as integrating the POS and grammar induction tasks.",
        "A second aim is to foster grammar and POS induction research across a wider variety of languages, and improving the standard of evaluation.",
        "We have collated data from existing treebanks in a variety of different languages, domains and linguistic formalisms.",
        "This gives a diverse range of",
        "data upon which to test induction algorithms, yielding a deeper insight into their strengths and shortcomings.",
        "One key problem in grammar induction research is how to evaluate the models' predictions given that often many different analyses are linguistically plausible, e.g., the choice of whether determiners or nouns should head noun phrases, or how to represent coordination.",
        "Simply comparing against a single gold standard often results in poor reported performance because the model has discovered a different analysis to that used when annotating the treebank.",
        "For this reason it has been popular to use lenient measures for comparing predicted trees to the treebank gold standard trees, such as undirected accuracy and the neutral edge distance (Schwartz et al., 2011).",
        "As well as evaluating using these popular metrics, we also propose a new method of evaluation which is also lenient in that it rewards different types of linguistically plausible output, but requires consistency in the output, something the previous methods cannot do.",
        "The paper is organised as follows.",
        "Section 2 describes the tasks and our data format and section 3 outlines the different treebanks used for the challenge.",
        "The baselines, our own benchmark systems and the competitors entries are described in section 5.",
        "In section 6 we present and analyse the results for the three different tracks.",
        "Finally we conclude in section 7."
      ]
    },
    {
      "heading": "2 Task Definition",
      "text": [
        "The three tracks of the WILS challenge are described below.",
        "First we describe the data format for the submissions common to the three tracks (POS induction, Dependency induction, and jointly inducing both), and then the three tracks are described along with the respective evaluation metrics."
      ]
    },
    {
      "heading": "2.1 Data format",
      "text": [
        "All datasets were presented in a file format similar to that used in the CoNLL tasks, but with slight modifications.",
        "In particular the last two columns are removed, as no projective head or projective dependency relations were used, and an extra POS column was inserted at column 6 to accommodate the Universal POS tagset (Petrov et al., 2011).",
        "Each line in a file then either consists of 9 columns, separated by a tab character, or is an empty line.",
        "Empty lines separate sentences, and all other lines give the annotation for a single token in the sentence as follows:",
        "1.",
        "ID: Token counter, gives the index of current word in the sentence.",
        "Indexing starts at 1.",
        "2.",
        "FORM: Surface form of the token in the sentence.",
        "3.",
        "LEMMA: Stemmed form of the word form if available.",
        "4.",
        "CPOSTAG: Coarse-grained POS tag.",
        "5.",
        "POSTAG: Fine-grained POS tag, or CPOSTAG again if not available.",
        "6.",
        "UPOSTAG: Universal POS tag, based on the POSTAG and CPOSTAG.",
        "7.",
        "FEATS: List of syntactic / morphological features, separated by a vertical pipe (|).",
        "8.",
        "HEAD: Syntactic head of the token, with 0 indicating the root node.",
        "9.",
        "DEPREL: The general type of the dependency",
        "relation, e.g., subject.",
        "In this setup, the LEMMA, FEATS and DEPREL columns are optional, in which case an underscore ( ) will be used as a placeholder.",
        "Each treebank was split into training, development and testing partitions.",
        "The HEAD and DEPREL entries were only supplied for the development and the final testing sets,2 but not for the training partition.",
        "The competitors were encouraged to develop their unsupervised entries on the union of the three partitions, and make sparse use of the development set, i.e., for sanity checking more than model fitting in order to minimise the extent of supervision."
      ]
    },
    {
      "heading": "2.2 POS induction",
      "text": [
        "In the POS induction track, participants developed systems to induce the Part-of-Speech (POS) classes for each word in the testing corpus.",
        "In order to train the systems, the same training and development sets",
        "which were not to be used for training, only evaluation.",
        "Participants submitted predicted tags for each token, which were scored against the gold-standard.",
        "For evaluation, we used 4 different metrics.",
        "The first is the many-to-one metric (M-1) (also known as cluster purity), which is widely used for cluster evaluation as well as evaluation of POS induction.",
        "This metric assigns each word cluster to its most common tag, and then measures the proportion of correctly tagged words.",
        "The second metric is the one-to-one mapping (1-1), a constrained version of Many-to-one mapping in which each predicted tag is associated with only one gold-standard tag and vice versa (Haghighi and Klein, 2006).",
        "Word clusters are assigned greedily to tags, and in the event of there being more word classes than tags, some word classes will be left unassigned.",
        "Another metric that was used is Variation of information (VI) (Meila, 2003), which is based the conditional entropy of between the two different clusterings (Johnson, 2007).",
        "Lastly, we use the V-measure (VM) metric (Rosenberg and Hirschberg, 2007), which is another entropy-based measure, but defined in terms of a F score to balance precision and recall terms (we use equal weighting of the two factors).",
        "Please see Christodoulopoulos et al. (2010) for further details about these metrics.3 For these metrics, a higher score is better, with the exception of VI.",
        "For all these metrics, the induced tags are evaluated against the universal pos tags, as this means there are a consistent number of tags across the languages.",
        "Using these metrics, the results will vary as a result of predicting a different number of tags (in particular, more tags will mean a higher score for M1, and the converse is true for 1-1).",
        "However, using the universal POS tags, we think will make results less sensitive to large differences in POS inventory between languages (such as for the Dutch dataset)."
      ]
    },
    {
      "heading": "2.3 Dependency induction",
      "text": [
        "For the Dependency induction track, the training data consisted of the original treebank data, but without dependency annotations.",
        "A development set was also provided, which included the dependency annotations, but this was meant mainly as a way to",
        "plementation of the POS induction metrics, which we have used in our evaluation.",
        "verify systems, as we mean to minimise the amount of supervision in the task.",
        "The participants were later supplied with test sets for which the systems could generate predictions.",
        "Only after the predictions were submitted were the fully annotated test sets released.",
        "The dependency inductions were evaluated on 3 metrics: directed accuracy, undirected accuracy and Neutral Edge Detection (NED) (Schwartz et al., 2011).",
        "Directed accuracy is the ratio of correctly predicted dependencies (including direction) over total amount of predicted dependencies.",
        "Undirected accuracy is much the same, but also considers a predicted dependency correct if the direction of the dependency is reversed (e.g. if the predicted dependency is not A ? B, but B ? A).",
        "Lastly, the NED metric is a variant of undirected accuracy that also rewards cases where an edge-flip occurs, meaning that the predicted parent of a token is actually the grandparent of that same token in the gold-standard data.",
        "Note that before evaluating with these metrics punctuation was removed from all sentences, and any child words under a punctuation node were reattached to their nearest ancestor that wasn't punctuation.",
        "The final 'joint' task consisted of inducing dependency structure from only the tokens in the corpus, without recourse to the gold POS tags.",
        "Where POS is predicted (e.g., in a pipeline), we included these in our general POS evaluation.",
        "The induced dependency trees were evaluated with the same metrics as in the dependency induction track, but are considered separately.",
        "We expect these systems to have lower scores overall due to the lack of gold-standard POS tags."
      ]
    },
    {
      "heading": "3 Treebanks",
      "text": [
        "We selected a number of different treebanks for use in the challenge, aiming to represent a wide range of different languages, dialects and genres of text.",
        "In total we used ten different treebanked corpora in nine different languages.",
        "For the practical reasons of simplifying the administration of the challenge and allowing the data to be reused in future research, we chose corpora with licences allowing either free redistribution, or those held by the Linguis",
        "tic Data Consortium (LDC).4 Many of these datasets have been used before in dependency grammar or part-of-speech research, particularly the shared tasks at CoNLL 2006 and 2007.",
        "For the purpose of the competition, we have updated these datasets to include any annotation updates or additional data, where available.",
        "It is important for unsupervised approaches to have sufficient amounts of data, especially given the common sentence length limitations imposed by most dependency grammar models.",
        "As described in section 2, we have included an extra field for the universal part-of-speech (UPOS) using Petrov et al. (2011)'s automatic conversion tool.5 Below we describe the different treebanks used, and the conversion process into our data format for the purpose of the competition.",
        "Please see Table 1 for statistics on each of the treebanks.",
        "Dependency treebanks We used the following dependency treebanks: Arabic The Prague Arabic Dependency Treebank V1 (Hajic et al., 2004).",
        "6 Basque The Basque 3lb dependency treebank (Aduriz et al., 2003).",
        "Czech The Prague Dependency Treebank 2.0 (Bo?hmova? et al., 2001).",
        "7 Danish The Copenhagen Dependency Treebank version 2 (Buch-Kromann et al., 2007).",
        "English The CHILDES US/Brown subcorpus (Sagae et al., 2007).",
        "Slovene The jos500k Treebank (Erjavec et al., 2010).",
        "8 Swedish The Talbanken treebank (Nivre et al., 2006).",
        "The conversion of each of these treebanks was quite straightforward as they were already annotated for dependencies.",
        "Moreover, many of these corpora had been used previously in the CoNLL 2006 and 2007 shared tasks, and therefore we were able to reuse this data and/or their conversion scripts.",
        "In the case of Arabic and Swedish we used the exact same data, simply converting from CoNLL dependency format into our own format (removing redundant columns and adding a UPOS column).",
        "While many of the other corpora had also",
        "si/jos/msd/html-en/index.html been used previously, our data is different, making use of subsequent corrections to these treebanks and additional annotated data now available.",
        "First language acquisition provides an important motivation for grammar induction research, consequently we have included data from the CHILDES database of child-directed speech.",
        "We use the Brown sub-corpus, a longitudinal study of parent-child interactions for three children aged between 18 months and 5 years old.",
        "The corpus has been manually annotated with syntactic dependencies (Sagae et al., 2007) and morphology.",
        "From this we take all child-directed utterances, extracting word, morphology, part-of-speech and dependency markup, and developed our own conversion into UPOS.",
        "Our testing and development sets were drawn from the first 15 Eve files which were manually annotated for dependency structure.",
        "The rest of the corpus, which had not been manually annotated for syntax, was merged to form the training set.",
        "Phrase-structure treebanks As well as dependency treebanks, we used three different phrase-structure treebanks: The Dutch Alpino treebank (Bouma et al., 2000), the English Penn Treebank V3 (Marcus et al., 1993),9 and the Portuguese Flo-resta Sinta(c)tica treebank (Afonso et al., 2002).",
        "As these treebanks do not explicitly mark dependencies, we automatically extracted these using head finding heuristics.",
        "Thankfully the difficult work of creating such scripts has already been done as part of the CoNLL shared tasks.",
        "We have reused their scripts to create dependency representations of these treebanks, before converting into our file format and augmenting with UPOS annotation.",
        "In the case of Dutch, we have reused the same CoNLL 2006 data; note that this dataset includes predicted part-of-speech rather than gold standard annotation (Buchholz and Marsi, 2006).",
        "For the Portuguese, we used the same Bosque 7.3 sub-corpus10 from CoNLL 2006, additionally including in our training set the recently-annotated Selva 1.0 subcorpus.",
        "The Penn Treebank is the most common data set in parsing and grammar induction.",
        "We have patched",
        "10 An updated version of this corpus is available, however the file format had changed significantly and we were unable to adapt the conversion scripts in time for the competition.",
        "ar cs da en-childes en-ptb eu nl pt sl sv annotation d d d d p d p p d d",
        "the size of each treebank, the number of types for the different granularities of part-of-speech tags and morphological features (note that UPOS has a fixed set of 12 tags), and the proportion of word types that were not present in training.",
        "the treebank to include NP-internal structure using Vadas and Curran's annotations (Vadas and Curran, 2007), which was then converted to dependency structures using the penn-converter11 script (Johansson and Nugues, 2007).",
        "This tool has a number of options controlling the linguistic decisions in converting from phrase-structure to dependency trees, e.g., the treatment of coordination.",
        "We extracted five versions of the treebank, each encoding each different sets of linguistic assumptions (Tsar-faty et al., 2011).12 These are denoted default, old-LTH, CoNLL-2007, functional and lexical; for the main results we used the standard options, we also report separately evaluations using each of the five variants.",
        "The treebank was partitioned into training (sections 0-22), development (sec.",
        "24) and testing sets (sec.",
        "23)."
      ]
    },
    {
      "heading": "4 Baselines and Benchmarks",
      "text": [
        "A number of standard baselines and previously published benchmark systems were implemented for each task in order to place the submitted systems in context.",
        "used.",
        "Note however that it could, in principle, be used for similar evaluations.",
        "The standard baseline for grammar induction models is to assume either left branching or right branching analyses (LB, RB).",
        "These capture the tendency for languages to favour one attachment direction over another.",
        "The most frequently cited and extended model for dependency induction is DMV (Klein and Manning, 2004).",
        "We provide results for this model trained on each of the coarse (DMVc), fine (DMVp), and universal (DMVu) POS tag sets, all initialised with the original harmonic initialiser.",
        "As a further baseline we also evaluated the dependency trees resulting from directly using the harmonic initialiser without any training (H).",
        "As a strong benchmark we include the results of the non-parametric Bayesian model previously published in Blunsom and Cohn (2010) (BC).",
        "The stated results are for the unlexicalised model described in that paper where the final analysis is formed by choosing the maximum marginal probability dependency links estimated from forty independent Gibbs sampler runs.",
        "For part-of-speech tagging we include results from an implementation of the Brown word clustering algorithm (Brown et al., 1992) (Bc,p,u), and the mkcls tool written by Franz Och (Och, 1999) (MKc,p,u).",
        "Both of these benchmarks were trained with the number of classes matching the number in the gold standard of each of the tagsets in turn: coarse (c), fine (p), and universal (u).",
        "A notable",
        "property of both of these word class models is that they enforce a one-tag-per-type restriction that ensures there is a one-to-one mapping between word types and classes.",
        "For POS tagging we also provide benchmark results from two previously published models.",
        "The first of these is the Pitman-Yor HMM model described in (Blunsom and Cohn, 2011), which incorporates ta one-tag-per-type restriction (BC).",
        "This model was trained with the same number of tags as in the gold standard fine tag set for each corpus.",
        "The second benchmark is the HMM with Sparsity Constraints trained using Posterior Regularization (PR) described in (Grac?a et al., 2011).",
        "In this model the HMM emission probabilitiy distribution are estimated using small Maximum Entropy models (features set described in the original paper).",
        "The models were trained for 200 iterations of PR using both the same number of hidden states as the coarse Gc and universal Gu gold standard.",
        "All parameters were set to the values described in the original paper."
      ]
    },
    {
      "heading": "5 Submissions",
      "text": [
        "The shared task received submissions covering a diverse range of approaches to the dependency and part-of-speech induction challenges.",
        "Encouragingly all of these submissions made significant departures from the benchmark HMM and DMV approaches which have dominated the published literature on these tasks in recent years.",
        "The submissions were characterised by varied choices of model structure, parameterisation, regularisation, and the degree to which light supervision was provided through constraints or the use of labelled tuning data.",
        "In the following sections we summarise the approaches taken by the systems submitted for each task."
      ]
    },
    {
      "heading": "5.1 Part-of-Speech Induction",
      "text": [
        "The part-of-speech induction challenge received two submission, (Chrupa?a, 2012; Christodoulopoulos et al., 2012).",
        "Both of these submissions based their induction systems on LDA inspired models for clustering word types by the contexts in which they appear.",
        "Notably, the strongest of the provided benchmarks and the two submissions modelled part-of-speech tags at the type level, thus restricting all tokens of a given word type to share the same tag.",
        "Though clearly out of step with the gold standard tagging, this one-tag-per-type restriction has previously been shown to be a crude but effective way of regularising models towards a good solution.",
        "Below we summarise the approach of each submission, identified by the surname of the first author on the submitted system description.",
        "Chrupa?a (2012) employed a two stage approach to inducing part-of-speech tags.",
        "The first stage used an LDA style probabilistic model to induce a distribution over possible tags for a given word type.",
        "These distributions were then hierarchically clustered and the final tags selected using the prefix of the path from the root node to the word type in the cluster tree.",
        "The length of the prefixes, and thus the number of tags, was tuned on the labelled development data.",
        "The system of Christodoulopoulos et al. (2012) was based upon an LDA type model which included both contexts and other conditionally independent features (Christodoulopoulos et al., 2011).",
        "This base system was then iterated with a DMV system and with the resultant dependencies being repeatedly fed back into the POS model as features.",
        "This submission is notable for being one of the first to attempt joint POS and dependency induction rather than taking a pipeline approach."
      ]
    },
    {
      "heading": "5.2 Dependency Induction",
      "text": [
        "The dependency parsing task saw a variety of approaches with only a couple based on the previously dominant DMV system.",
        "Two forms of light supervision were popular, the first being the inclusion of pre-specified constraints or rules for allowable dependency links, and the second being the tuning of model parameters or selecting between competing models on the labelled development data.",
        "Obviously the merits of such supervision would depend on the desired application for the induced parser.",
        "The direct comparison of models which include a form of universal prior syntactic information with those that don't does permit interesting development linguistic questions to be explored in future.",
        "Bisk and Hockenmaier (2012) chose to induce a restricted form of Combinatory Categorial Grammar (CCG), the parses of which were then mapped to dependency structures.",
        "Restrictions on head-child dependencies were encoded in the allowable cate",
        "gories for each POS tag and the heads of sentences.",
        "Key features of their approach were a maximum likelihood objective function and an iterative procedure for generating composite categories from simple ones.",
        "Such composite categories allow the parameterisation of larger units than just head-child dependencies, improving over the more limited conditioning of DMV.",
        "Marac?ek and Z?abokrtsky?",
        "(2012) introduced a number of novel features in their dependency induction submission.",
        "Wikipedia articles were used to quantify the reducibility of word types, the degree to which the word could be removed from a sentence and grammaticality maintained.",
        "This metric was then used, along with a model of child fertility and dependency distance, within a probabilistic model.",
        "Inference was performed by using a local Gibbs sampler to approximate the marginal distribution over head-child links.",
        "S?gaard (2012) presented two model-free heuristic algorithms.",
        "The first was based on heuristically adding dependency edges based on rules such as adjacency, function words, and morphology.",
        "The resulting structure is then run through a PageRank algorithm and another heuristic is used to select a tree from the resulting ranked dependency edges.",
        "The second approach takes the universal rules of Naseem et al. (2010) but rather than estimating a probabilistic model with these rules, a rule based heuristic is used to select a parse rather.",
        "This second model-free approach in particular provides a strong baseline for probabilistic models built upon hand-specified dependency rules.",
        "Tu (2012) described a system based on an extended DMV model.",
        "Their work focussed on the exploration of multiple forms of regularisation, including Dirichlet priors and posterior regularisation, to favour both sparse conditional distributions and low ambiguity in the induced parse charts.",
        "While many previous works have included sparse priors on the conditional head-child distributions the additional regularisation of the ambiguity over parse trees is a novel and interesting addition.",
        "The labelled development sets were employed to both select between models employing different regularisation, and to tune model parameters."
      ]
    },
    {
      "heading": "5.3 POS and Dependency Induction",
      "text": [
        "There was only a single submission for the task of inducing dependencies without gold standard part-of-speech tags supplied.",
        "Christodoulopoulos et al. (2012) submitted the same joint tagging and DMV system used for the POS induction task to the dependency induction task.",
        "Results on the development data indicated that this iterated joint training had a significant benefit for the induced tags and a smaller benefit for the dependency structures induced."
      ]
    },
    {
      "heading": "6 Results",
      "text": [
        "The main results for the three tasks are shown in Tables 2, 3, and 4, for the POS induction, dependency induction and joint tasks, respectively.13 We now present a detailed analysis of each of the three tasks."
      ]
    },
    {
      "heading": "6.1 POS induction",
      "text": [
        "The main evaluation results for the POS induction task are shown in Table 2, which compares the induced clusters against the gold universal tags (UPOS).14 Given the diversity of scenarions used by each system (e.g. number of hidden states, tuning on development data) a direct comparison between the systems can only be illustrative.",
        "A first observation is that depending on the particular evaluation metric employed the ranking of the systems changes substantially, for instance the Gu system is the best using the 1-1 and VI metric but is the worst of the entries (excepting the baselines) when using the other two metrics.",
        "Focusing on the VM metric, which was shown empirically not to have low bias with respect to the word classes (Christodoulopoulos et al., 2010), the best entry is the BC system which has the best performance in 9 out of 10 entries followed by the CGS and the C system.",
        "Note that this ranking holds also for the comparison against fine POS tags, shown in Table 7.",
        "An interesting aspect is that almost all systems beat the strong Brown (B) and mkcls (MK) baseline across the different metrics when we restrict our attention to the cases where the same number 13Additional tables of results are in the appendix, and further results are online at http://wiki.cs.ox.ac.uk/ InducingLinguisticStructure.",
        "14See also Table 7 for the comparison against the fine POS tags; we base our analysis on UPOS instead as this tag set has a fixed size irrespective of the treebank.",
        "the gold UPOS tags.",
        "Each system is shown in a column, where the title is an acronym of the authors?",
        "last names, or else the name of a benchmark system (B is the Brown clusterer and MK is mkcls).",
        "The superscripts c, p and u denote different applications of the same method with a number of word classes set to equal the true number of coarse tags, full tags or universal tags, respectively, for each treebank.",
        "of hidden states are used (the exception being the G system which occasionally underperformed against MK).",
        "Interestingly the assumption of one-tag-per-word, made by all but the G system, works very well in practice leading to consistently strong results.",
        "This suggests that dealing with word ambiguity is still an unresolved issue in unsupervised POS induction.",
        "Comparing the performance of the systems for different languages, as expected the languages for which we have a larger corpora (English CHILDES and PTB and Czech) tend to result in systems with better accuracies.",
        "An interesting future question is how do the propose methods scale when training on really large corpora (e.g., wikipedia) both in terms of performance (accuracy) but also in the resources they required.",
        "Finally, the wild divergences in the system rankings when considering the different evaluation metrics calls for some sort of external evaluation using the induced clusters as features to other end systems, for instance semi-supervised tagging.",
        "The main question is if there will be a definitive ranking between systems for a diverse set of tasks, or if on the contrary the effectiveness of the output of each system will vary according to the task at hand."
      ]
    },
    {
      "heading": "6.2 Dependency induction",
      "text": [
        "The main evaluation results for the dependency task are shown in Table 3.",
        "From this we make several observations.15 Firstly, for almost all the corpora the participants systems have outperformed the simple baselines, and by a significant margin.",
        "There are three exceptions to this: for Arabic, Basque and Danish the left or right-branching baselines outperforms most or all of the competitors.",
        "This may indicate that these languages are inherently difficult, or may simply be a consequence of these three languages having the least data of all of our corpora.",
        "Basque and Dutch proved to be the hardest of the treebanks, with the lowest overall scores, and the CHILDES (English) and Portuguese were the easiest.",
        "The reasons for this are not immediately clear, 15Table 3 evaluates against the full test sets, however it is traditional to present results for short sentences mirroring the common training setup.",
        "See Tables 8 and 9 for results over sentences with 10 words or fewer, excluding punctuation.",
        "Note that our analysis is based on the results for the full test set.",
        "although we speculate that Basque is difficult due to its dissimilarity from other European languages, and therefore may not match the assumptions underlying models developed primarily on English.",
        "Dutch is difficult as its annotation was non-projective, and it has a very large set of POS tags, while CHILDES is made easier due to its extremely short and simple sentences.",
        "In terms of declaring a ?winner?, it is clear that Tu's system ranks best under directed accuracy and NED, and a very narrow second (to the organisers?",
        "submission, BC) for undirected accuracy.",
        "Moreover Tu's system was a consistent performed across all corpora, with no single result well below the results of the other participants.",
        "Note that the three different metrics often predict the same winner across the different treebanks, however there are some large discrepancies, such as Portuguese and Dutch where the directed and undirected accuracy metrics concur, but NED produces a very different ranking.",
        "It is unclear which metric should be trusted more than another; this could only be assessed by correlating these metrics with some form of secondary evaluation, such as in a task based setting or obtaining human grammaticality judgements.16 The benchmark systems include DMV (Klein and Manning, 2004), which has historical importance in terms of being the first research systems to outperform simple baselines for dependency induction, and also the model upon which most recent dependency induction research is based, including many of the competitors in the competition.",
        "We observe that in most cases the competitors have outperformed the DMV models, in many cases by a large margin.",
        "In all cases DMV improved over its initialisation condition (the harmonic initialiser), although often this improvement was only slight, underscoring the importance of good initialisation.",
        "The effect of inducing DMV grammars from various different granularity of POS tags made little difference in most cases, although for Dutch17 and the English PTB there change was more dramatic.",
        "16It was our intention to include a task-based evaluation for machine translation, but this proved impractical for the competition due to the volumes of data that we would require each participant to process.",
        "17Note that for Dutch the full POS tags were not gold standard, but were system predictions.",
        "first column (BC) is our benchmark system, the next seven are participants systems, and the remaining columns consist of the DMV benchmark and various simple baselines.",
        "The superscripts c, p and u denote which type of POS was used, and S1 and S2 denote two different submissions for S?gaard (2012).",
        "Overall the full POS tagset lead to the best performance over the coarse and universal tags (considering undirected accuracy or NED), which is to be expected as there is considerably more syntactic information contained in the full POS.",
        "This must be balanced against the additional model complexity from expanding its parameter space, which may explain why the difference in performance differences are so small.",
        "The same pattern can also be seen in Marac?ek and Z?abokrtsky?",
        "(2012)'s submission, whose system using full POS (Mp) outperformed their other variants."
      ]
    },
    {
      "heading": "6.3 Joint task",
      "text": [
        "As we had only one submission for the joint problem of POS and dependency induction, there are few conclusions we can draw for this joint task (see Table 4 for the results, and Table 9 for the short sentence evaluation).",
        "Compared to the dependency induction task using gold standard POS, as shown in Table 3, the accuracy for the joint models are lower.",
        "Interestingly, the DMV model performs best when using the same number of word clusters as there are POS tags, mirroring the findings reported",
        "for evaluating the predicted dependency structures in the joint task (i.e., not using supplied POS tags).",
        "The first column is the participant's system and the next three are DMV models trained on the Brown word clusters (see section 6.1).",
        "above with gold standard tags.",
        "The best joint system was the DMVp model, which only marginally underperformed the equivalent DMV model trained on gold POS.",
        "This is an encouraging finding, suggesting that word clusters are able to represent important POS distinctions to inform deeper syntactic processing."
      ]
    },
    {
      "heading": "6.4 Analysis",
      "text": [
        "Until now we have adopted the standard metrics in dependency evaluation: namely directed head attachment accuracy, and its more lenient counterparts, undirected accuracy and NED.",
        "The latter metrics reward structures that almost match the gold standard tree, by way of rewarding child-parent edges that are predicted in the reverse direction, i.e., attaching the child as the parent (NED takes this further, by also rewarding the grandparent-child edge when this occurs).",
        "This allows some degree of flexibility when considering various contentious linguistic decisions such as whether a preposition should head a preposition phrase, or the head of the child noun-phrase.",
        "This added leniency comes at a price, as shown in Table 3 where the undirected accuracy and NED results are considerably higher than directed accuracy, and display less spread of values (look in particular at the random trees, Ra).",
        "Is is unclear that the predicted trees are truly predicting linguistically plausible structures, but instead that the differences are due largely to chance.",
        "Moreover, systems that predict linguistic phenomena inconsistently between sentences or across types of related phenomena are rewarded under these lenient metrics.",
        "For these reasons we also consider a different, less permissive, evaluation method, using multiple references of the treebank where each is annotated with different styles of dependency.",
        "As described in section 2, we processed the Penn treebank five times with different options to the LTH conversion tool.",
        "This affected the treatment of coordination, preposition phrases, subordinate clauses, infinitival clauses etc.",
        "Next we compare the directed accuracy of the systems against these five different ?gold standard?",
        "references, which are displayed in Table 5, alongside the maximum score for each system.",
        "Note that most systems performed well against the standard, conll2007 and functional references but poorly against the lexical and oldLTH references.18 Considering the latter two references, a different system would be selected as the highest performing, namely Bisk and Hockenmaier (2012) (BH) over Blunsom and Cohn (2010) (BC) which wins in the other cases.",
        "18The common difference here is that the latter two references do not treat prepositions as heads of PPs.",
        "This evaluation method rewards many different linguistically plausible structures, but in such a way that the predictions must be consistent between different sentences in the testing set, and in their treatment of related linguistic phenomena.",
        "One caveat is that this method can only be used when there are many references, although in many cases different outputs can be generated automatically, e.g., by adjusting head-finding heuristics in converting between phrase-structure to dependency trees.",
        "The previous analysis has rated each system in terms of overall performance against treebank trees, however this doesn't necessarily mean that the predictions of the best ranked system will be the most useful ones in a task-based setting.",
        "Take the example of information extraction, in which a central problem is to identify the arguments (subject, object etc) of a given verb.",
        "This setting gives rise to some types of dependency edges being more valuable than others.",
        "We present comparative results for the Penn treebank in Table 6 showing the directed accuracy for different types of dependency relations.",
        "Observe that there is a wide spread of accuracies for predicting the head word of the sentence (ROOT), and similarly for verbs?",
        "subject and object arguments.",
        "These scores are similar to the scores for the local modifiers shown, such as NMOD which describe the arguments of a noun.",
        "This is surprising as noun edges tend to be much shorter than for the arguments to a verb, and thus should be easier to predict.",
        "Also interesting are the spread of results for the CC edges (these link a coordinating conjunction to its head), suggesting that the systems learn to represent coordination in very different ways to the method used in the reference.",
        "Figure 1 illustrates the directed accuracy over different lengths of dependency edge.",
        "For all systems the accuracy diminishes with edge length, however some fall at a much faster rate.",
        "The two best systems (Tu, BC) have similar overall accuracy results, but it is clear that Tu does better on short edges while BC does better on longer ones.",
        "The same pattern was also observed when considering the average accuracy over all treebanks (not shown), although the systems?",
        "results were closer together.",
        "stratified by dependency relation.",
        "For clarity, only 9 important relation types are shown.",
        "The vertical bars separate different groups of relations, from left to right, relating to the main verb, general modifiers and coordination."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "This challenge set out to evaluate the state-of-the-art in part-of-speech and dependency grammar induction, promoting research in this field and, importantly, providing a fair means of evaluation.",
        "The participants submissions used a wide variety of different approaches, many of which we shown to have improved over competitive benchmark systems.",
        "While the results were overall very positive, it is fair to say that the tasks of part-of-speech and grammar induction are still very much open challenges, and that there is still considerable room for improvement.",
        "The data submitted to this evaluation campaign will provide a great resource for devising new methods of evaluation, and we plan to pursue this avenue in future work, in particular task-based evaluation such as in an information extraction or machine translation setting."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "This challenge was funded by the PASCAL 2 (Pattern Analysis, Statistical Modelling and Computational Intelligence) European Network of Excellence.",
        "We would also like to thank the treebank providers for allowing us to use their resources, assisting us in converting these into our desired format, and helping to resolve various questions.",
        "In particular, special thanks to Zdenek Zabokrtsky and Jan (Czech and Arabic), Tomaz Erjavec (Slovene), and Eckhard Bick and Diana Santos (Portuguese).",
        "We are also indebted to the organisers of the previ",
        "ified by dependency length.",
        "For clarity only a subset of the systems are shown, and edges of length 10 or more were omitted.",
        "ous CoNLL 2006 and 2007 competitions, who contributed significant efforts into collating so many treebanks and developing treebank conversion tools, making our job much easier than it would otherwise have been.",
        "Thanks to Sebastian Reidel, Joakim Nivre and Sabine Buchholz for promptly answering our questions.",
        "We would like to thank the LDC, who allowed their licenced data to be used free of charge by the competitors, and Ilya Ahtaridis who administered the licencing and corpus distribution.",
        "Thanks also to Valentin Spitkovski and Christos Christodoulopoulos who kindly provided us with their evaluation scripts, and finally, the participants themselves for taking part."
      ]
    }
  ]
}
