{
  "info": {
    "authors": [
      "Matt Post",
      "Chris Callison-Burch",
      "Miles Osborne"
    ],
    "book": "Proceedings of the Seventh Workshop on Statistical Machine Translation",
    "id": "acl-W12-3152",
    "title": "Constructing Parallel Corpora for Six Indian Languages via Crowdsourcing",
    "url": "https://aclweb.org/anthology/W12-3152",
    "year": 2012
  },
  "references": [
    "acl-J07-2003",
    "acl-N03-1017",
    "acl-N04-1022",
    "acl-N04-1035",
    "acl-N06-1014",
    "acl-N10-1024",
    "acl-N12-1006",
    "acl-P03-1021",
    "acl-P06-1121",
    "acl-P07-2045",
    "acl-P11-1122",
    "acl-P11-2031",
    "acl-W01-1409",
    "acl-W06-3119",
    "acl-W11-2160"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recent work has established the efficacy of Amazon's Mechanical Turk for constructing parallel corpora for machine translation research.",
        "We apply this to building a collection of parallel corpora between English and six languages from the Indian subcontinent: Bengali, Hindi, Malayalam, Tamil, Telugu, and Urdu.",
        "These languages are low-resource, under-studied, and exhibit linguistic phenomena that are difficult for machine translation.",
        "We conduct a variety of baseline experiments and analysis, and release the data to the community."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The quality of statistical machine translation (MT) systems is strongly related to the amount of parallel text available for the language pairs.",
        "However, most language pairs have little or no readily available bilingual training data available.",
        "As a result, most contemporary MT research tends to opportunistically focus on language pairs with large amounts of parallel data.",
        "A consequence of this bias is that language exhibiting certain linguistic phenomena are underrepresented, including languages with complex morphology and languages with divergent word orderings.",
        "In this paper, we describe our work gathering and refining document-level parallel corpora between English and each of six verb-final languages spoken on the Indian subcontinent: Bengali, Hindi, Malayalam, Tamil, Telugu, and Urdu.",
        "This paper's contributions are as follows: ?",
        "We apply an established protocol for using Amazon's Mechanical Turk (MTurk) to collect parallel data to train and evaluate translation systems for six Indian languages.",
        "?",
        "We investigate the relative performance of syntactic translation models over hierarchical ones, showing that syntax results in higher BLEU scores in most cases.",
        "?",
        "We explore the impact of training data quality on the quality of the resulting model.",
        "?",
        "We release the corpora to the research community under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC BY-SA"
      ]
    },
    {
      "heading": "2 Why Indian languages?",
      "text": [
        "Indian languages are important objects of study for a number of reasons.",
        "These languages are low-resource languages in terms of the availability of MT systems2 (and NLP tools in general) yet together they represent nearly half a billion native speakers (Table 1).",
        "Their speakers are well-educated, with many of them speaking English either natively or as a second language.",
        "Together with the degree of Internet penetration in India, it is reasonably straightforward to find and hire non-expert translators through crowdsourcing services like Amazon's Mechanical Turk.",
        "the continuous aspect, while PAST denotes past tense.",
        "In addition to a general desire to collect suitable training corpora for low-resource languages, Indian languages demonstrate a variety of linguistic phenomena that are divergent from English and understudied.",
        "One example is head-finalness, exhibited most obviously in a subject-object-verb (SOV) pattern of sentence structure, in contrast to the general SVO ordering of English sentences.",
        "One of the motivations underlying linguistically-motivated syntactic translation systems like GHKM (Galley et al., 2004; Galley et al., 2006) or SAMT (Zollmann and Venugopal, 2006) is to describe such transformations.",
        "This difference in word order has the potential to serve as a better test bed for syntax-based MT3 compared to translating between English and European languages, most of which largely share its word order.",
        "Figure 1 contains an example of SOV reordering in Tamil.",
        "A second important phenomenon present in these languages is a high degree of morphological complexity relative to English (Figure 2).",
        "Indian languages can be highly agglutinative, which means that words are formed by concatenating morphological affixes that convey information such as tense, person, number, gender, mood, and voice.",
        "Morphological complexity is a considerable hindrance at all stages of the MT pipeline, but particularly alignment, where inflectional variations mask patterns from alignment tools that treat words as atoms.",
        "3Weuse hierarchical to denote translation grammars that use only a single nonterminal (Chiang, 2007), in contrast to syntactic systems, which make use of linguistic annotations (Zollmann and Venugopal, 2006; Galley et al., 2006).",
        "tive speakers according to Lewis (2009)."
      ]
    },
    {
      "heading": "3 Data collection",
      "text": [
        "The source of the documents for our translation task for each of the languages in Table 1 was the set of the top-100 most-viewed documents from each language's Wikipedia.",
        "These lists were obtained using page view statistics compiled from dammit.lt/ wikistats over a one year period.",
        "We did not apply any filtering for topic or content.",
        "Table 2 contains a manually categorized list of documents for Hindi, with some minimal annotations indicating how the documents relate to those in the other languages.",
        "These documents constitute a diverse set of topics, including culture, the internet, and sex.",
        "We collected the parallel corpora using a three-step process designed to ensure the integrity of the non-professional translations.",
        "The first step was to build a bilingual dictionary (?3.1).",
        "These dictionaries were used to bootstrap the experimental controls in the collection of four translations of each source sentence (?3.2).",
        "Finally, as a measure of data quality, we independently collect votes on the which of the four redundant translations is the best (?3.3)."
      ]
    },
    {
      "heading": "3.1 Dictionaries",
      "text": [
        "A key component of managing MTurk workers is to ensure that they are competently and conscientiously undertaking the tasks.",
        "As non-speakers of all of the Indian languages, we had no simple and scalable way to judge the quality of the workers?",
        "translations.",
        "Our solutionwas to bootstrap the process by first building bilingual dictionaries for each of the datasets.",
        "The dictionaries were then used to produce glosses of the complete source sentences, which we compared to the translations produced by the workers as a rough means of manually gauging trust (?3.2).",
        "The dictionaries were built in a separate MTurk",
        "source-language types, while translations lists the number of words or phrases they translated to (i.e., the number of pairs in the dictionary).",
        "Controls for Hindi were obtained using Google translate, the only one of these languages that were available at the outset of this project.",
        "task, in which workers were asked to translate single words and short phrases from the complete set of Wikipedia documents.",
        "For each word, MTurk workers were presented with three sentences containing that word, which provided context.",
        "The control for this task was obtained from the Wikipedia article titles which are linked across languages, and can thus be assumed to be translations of each other.",
        "Workers who performed too poorly on these known translations had their work rejected.",
        "Table 3 lists the size of the dictionaries we constructed."
      ]
    },
    {
      "heading": "3.2 Translations",
      "text": [
        "With the dictionaries in hand, we moved on to translate the entireWikipedia documents.",
        "Each human intelligence task (HIT) posted onMTurk contained ten sequential source-language sentences from a document, and asked the worker to enter a free-form translation for each.",
        "We collected four translations from different translators for each source sentence.",
        "To discourage cheating through cutting-and-pasting into automatic translation systems, sentences were presented as images.",
        "Workers were paid $0.70 per HIT.",
        "We then manually determined whether to accept or reject a worker's HITs based on a review of each worker's submissions, which included a comparison of the translations to a monotonic gloss (produced with the dictionary), the percentage of empty translations, the amount of time the worker took to complete the HIT, geographic location (self-reported and geolocated by way of the worker's IP address), and by comparing different translations of the same source segments against one another.",
        "We obtained translations of the source-language documents in a relatively short amount of time.",
        "Figure 3 depicts the number of translations collected as a function of the amount of time from the posting of the task.",
        "Malayalam provided the highest throughput, generating half a million words in just under a",
        "English words) as a function of elapsed days.",
        "For Malayalam, we collected half a million words of translations in just under a week.",
        "week.",
        "For comparison, the Europarl corpus (Koehn, 2005) has about 50million words of English for each of the Spanish and French parallel corpora.",
        "As has been previously reported (Zbib et al., 2012), cost is another advantage of building training data on Mechanical Turk.",
        "Germann (2001) puts the cost of professionally translated English at about $0.30 perword for translation fromTamil.",
        "Our translations were obtained for less than $0.01 per word.",
        "The rate of collection could likely be increased by raising these payments, but it is unclear whether quality would be affected by raising the base pay (although it could be improved by paying for subsequent quality control HITs, like editing).",
        "The tradeoff for low-cost translations is increased variance in translation quality when compared to the more consistently-good professional translations.",
        "Figure 4 contains some hand-picked examples of the sorts of translations we obtained.",
        "Later, in the Experiments section (?4), we will investigate the effects this variance in translation quality has on the quality of the models that can be constructed.",
        "For now, the variancemotivated the collection of an additional dataset, described in the next section."
      ]
    },
    {
      "heading": "3.3 Votes",
      "text": [
        "A prevailing issue with translations collected on MTurk is the prevalence of low-quality translations.",
        "Quality suffers for a variety of reasons: Turkers lack formal training, often translate into a nonna-tive tongue, may give insufficient attention to the task, and likely desire to maximize their throughput (and thus their wage).",
        "Unlike Zaidan and Callison-Burch (2011), who embed controls containing source language sentences with known professional translations, we had no professionally translated data.",
        "Therefore, we could not measure the BLEU score of the Turkers.",
        "Motivated by desire to have some measure of the relative quality and variance of the translations, we designed another task in which we presented an independent set of Turkers with an original sentence and its four translations, and asked them to vote on which was best.4 Five independent workers voted on the translations of each source sentence.",
        "Tallying the resulting votes, we found that roughly 65% of the sentences had five votes cast on just one or two of the translations, and about 95% of the sentences had all the votes cast on one, two, or three sentences.",
        "This suggests both (1) that there was a difference in the quality of the translations, and (2) the voters were able to discern these differences, and took their task seriously enough to report them."
      ]
    },
    {
      "heading": "3.4 Data sets",
      "text": [
        "For each parallel corpus, we created a standardized test set in the following manner.",
        "We first manually assigned each of the Wikipedia documents for each language into one of the following nine categories: EVENTS, LANGUAGE AND CULTURE, PEOPLE, PLACES, RELIGION, SEX, TECHNOLOGY, THINGS, or MISC.",
        "We then assigned documents to training, development, development test, and test sets in round-robin fashion using a ratio of roughly 7:1:1:1.",
        "For training data, each source sentence was repeated four times in order to allow it to be paired with each of its translations.",
        "For the development and test sets, the multiple translations served as alternate references.",
        "Table 4 lists sentence-and word-level statistics for the datasets for each lan",
        "ting of the translations has been preserved exactly.",
        "The parenthesized number indicates the number of votes received in the voting task (?3.3).",
        "language dict train dev devtest test",
        "the first row, parallel sentences in the second.",
        "(The dictionaries contains short phrases in addition to words, which accounts for the difference in dictionary word and line counts.)"
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "In this section, we present experiments on the collected data sets in order to quantify their performance.",
        "The experiments aim to address the follow",
        "ing questions: 1.",
        "How well can we translate the test sets?",
        "2.",
        "Do linguistically motivated translation models improve translation results?",
        "3.",
        "What is the effect of data quality onmodel quality?"
      ]
    },
    {
      "heading": "4.1 Setup",
      "text": [
        "A principal point of comparison in this paper is between Hiero grammars (Chiang, 2007) and SAMT grammars (Zollmann and Venugopal, 2006), the latter of which make use of linguistic annotations to improve nonterminal reordering.",
        "These grammars were trained with the Thrax grammar extractor using its default settings, and translated using Joshua (Weese et al., 2011).",
        "We tuned with minimum error-rate training (Och, 2003) using Z-MERT (Zaidan, 2009) and present the mean BLEU score on test data over three separate runs (Clark et al., 2011).",
        "MBR reranking (Kumar and Byrne, 2004) was applied to Joshua's 300-best (unique) output, and evaluation was conducted with case-insensitive BLEU with four references.",
        "The training data was produced by pairing a source sentence with each of its four translations.",
        "We also added the dictionaries to the training data.",
        "We built five-gram language models from the target side of the training data using interpolated Kneser-Ney smoothing.",
        "We also experimented with a larger-scale language model built from English Gigaword, but, notably, found a drop of over a point in BLEU score.",
        "This points forward to some of the difficulties encountered with the lack of text normalization, discussed in ?5."
      ]
    },
    {
      "heading": "4.2 Baseline translations",
      "text": [
        "We begin by presenting BLEU scores for Hiero and SAMT translations of each of the six Indian language test sets (Table 5).",
        "For comparison purposes, we also present BLEU scores from Google translations of these languages (where available).",
        "We observe that systems built with SAMT grammars improve measurably above the Hiero models, with the exception of Tamil and Telugu.",
        "As an external reference point, the Google baseline translation scores far surpass the results of any of our systems, but were likely constructed from much larger datasets.",
        "Table 6 lists some manually-selected examples of",
        "erences).",
        "BLEU scores are the mean of three MERT runs.",
        "the sorts of translations we obtained from our systems.",
        "While anecdotal and not characteristic of overall quality, together with the generally good BLEU scores, these examples provide a measure of the ability to obtain good translations from this dataset."
      ]
    },
    {
      "heading": "4.3 Voted training data",
      "text": [
        "We noted above the high variance in the quality of the translations obtained on MTurk.",
        "For data collection efforts, there is a question of how much time and effort to invest in quality control, since it comes at the expense of simply collecting more data.",
        "We can either collect additional redundant translations (to increase quality) or translate more foreign sentences (to increase coverage).",
        "To test this, we constructed two smaller datasets, each making use of only one of the four translations of each source sentence: ?",
        "Selected randomly ?",
        "Selected by choosing the translation that received a plurality of the votes (?3.3), breaking ties randomly (best) We again included the dictionaries in the training data (where available).",
        "Table 7 contains results on the same test sets as before.",
        "These results do not clearly indicate that quality control through redundant translations are worth the extra expense.",
        "Novotney and Callison-Burch (2010) had a similar finding for crowdsourced transcriptions."
      ]
    },
    {
      "heading": "5 Further Analysis",
      "text": [
        "The previous section has shown that reasonable BLEU scores can be obtained from baseline translation systems built from these corpora.",
        "While translation quality is an issue (for example, very lit??????????",
        "?????",
        "?????",
        "in srilanka solar government chola rule in sri lanka in srilanka chozhas ruled chola reign in sri lanka",
        "in bold are translations of the second Tamil word.",
        "eral translations, etc), the previous section's voted dataset experiments suggest this is not one of the most important issues to address.",
        "In this section, we undertake a manual analysis of the collected datasets to inform future work.",
        "There are a number of issues that arise due to non-Roman scripts, high-variance translation quality, and the relatively small amount of training data."
      ]
    },
    {
      "heading": "5.1 Orthographic issues",
      "text": [
        "Manual analysis demonstrates that inconsistencies with orthography are a serious problem.",
        "An example of this can be found in Figure 5, which contains a set of translations of a Tamil sentence.",
        "In particular, the spelling of the Tamil word ?????",
        "has three different realizations among the sentence's translations.",
        "The discrepancy between zha and la is due to phonetic variants (phonetic similarity may also account for the word solar).",
        "This discrepancy is present throughout the training and test data, where the la variant is preferred to -zha by about 6:1 (the counts are 848 and 142, respectively).",
        "In addition to mistakes potentially caused by foreign scripts, there are many mistakes that are simply spelling errors.",
        "Table 8 contains examples of misspellings (along with their counts) in the training portion of the Urdu-English dataset.",
        "As a point of comparison, there are no misspellings of the word in Europarl.",
        "Such errors are present in many collections, of course, but they are particularly harmful in small datasets, and they appear to be especially prevalent in datasets like these, translated as they were by non-native speakers.",
        "Whether caused by Turker carelessness or difficulty in translation from non-Roman scripts, these are common issues, solutions for which could yield significant improvement in translation performance.",
        "ter of the training data (plus dictionary), selected in two ways: best (result of vote), and random.",
        "There is little difference, suggesting quality control may not be terribly important.",
        "We did not collect votes for Malayalam.",
        "misspelling count",
        "portion of the Urdu-English data, along with their counts."
      ]
    },
    {
      "heading": "5.2 Alignments",
      "text": [
        "Inconsistent orthography fragments the training data, exacerbating problems already present due to morpohological richness.",
        "One place this is manifested is during alignment, where different spellings mask patterns from the standard alignment techniques.",
        "We observe a large number of poor alignments, due to interactions among these problems, as well as the small size of the training data, well-documented alignment mistakes (such as garbage collecting), and the divergent sentence structures.",
        "In particular, it seems that the defacto alignment heuristics may be particularly ill-suited to these language pairs and data conditions.",
        "Figure 6 (top) contains an example of a particularly poor alignment produced by the default alignment heuristic, the grow-diagand method described in Koehn et al. (2003).",
        "As a means of testing this, we varied the alignment combination heuristics using five alternatives described in Koehn et al. (2003) and available in the symal program distributed with Moses (Koehn et al., 2007).",
        "Experiments on Tamil produce a range of BLEU scores between 7.45 and 10.19 (each result is the average of three MERT runs).",
        "If we plot grammar size versus BLEU score, we observe a general trend that larger grammars seem to positively correlate with BLEU score.",
        "We tested this more generally across languages using the Berkeley aligner5 (Liang et al., 2006) instead of GIZA alignments, and found a consistent increase in BLEU score for the Hiero grammars, often putting them on par with the original SAMT results (Table 9).",
        "Manual analysis suggests that the Berkeley aligner produces fewer, more reasonable-looking alignments than the Moses heuristics (Figure 6).",
        "This suggest a fruitful approaches in revisiting assumptions underlying alignment heuristics."
      ]
    },
    {
      "heading": "6 Related Work",
      "text": [
        "Crowdsourcing datasets has been found to be helpful for many tasks in natural language processing.",
        "Ger-mann (2001) showed that humans could perform surprisingly well with very poor translations obtained from non-expert translators, in part likely because coarse-level translational adequacy is sufficient for the tasks they evaluated.",
        "That work was also pitched as a rapid resource acquisition task, meant to test our ability to quickly build systems in emergency settings.",
        "This work further demonstrates the ability to quickly acquire training data for MT systems with",
        "grow-diag-and alignment combination heuristic (top); the Berkeley aligner is better (bottom).",
        "A ?",
        "is a correct guess, an X marks a false positive, and a ?",
        "denotes a false negative.",
        "Hiero's extraction heuristics yield 4 rules for the top alignment and 16 for the bottom.",
        "reasonable translation accuracy.",
        "Closely related to our work here is that of Novot-ney and Callison-Burch (2010), who showed that transcriptions for training speech recognition systems could be obtained from Mechanical Turk with near baseline recognition performance and at a significantly lower cost.",
        "They also showed that redundant annotation was not worthwhile, and suggested that money was better spent obtaining more data.",
        "Separately, Ambati and Vogel (2010) probed the MTurk worker pool for workers capable of translating a number of low-resource languages, including Hindi, Telugu, and Urdu, demonstrating that such workers could be found and quantifying acceptable",
        "ments instead of GIZA++ heuristics.",
        "The gain columns denotes improvements relative to the Hiero systems in Table 5.",
        "In many cases (bold gains), the BLEU scores are at or above even the SAMT models from that table.",
        "wages and collection rates.",
        "The techniques described here are similar to those described in Zaidan and Callison-Burch (2011), who showed that crowdsourcing with appropriate quality controls could be used to produce professional-level translations for Urdu-English translation.",
        "This paper extends that work by applying their techniques to a larger set of Indian languages and scaling it to training-data-set sizes."
      ]
    },
    {
      "heading": "7 Summary",
      "text": [
        "We have described the collection of six parallel corpora containing four-way redundant translations of the source-language text.",
        "The Indian languages of these corpora are low-resource and understudied, and exhibit markedly different linguistic properties compared to English.",
        "We performed baseline experiments quantifying the translation performance of a number of systems, investigated the effect of data quality on model quality, and suggested a number of approaches that could improve the quality of models constructed from the datasets.",
        "The parallel corpora provide a suite of SOV languages for translation research and experiments."
      ]
    },
    {
      "heading": "Acknowledgments We thank Lexi Birch for dis",
      "text": [
        "cussions about strategies for selecting and assembling the data sets.",
        "This research was supported in part by gifts from Google and Microsoft, the Euro-MatrixPlus project funded by the EuropeanCommission (7th Framework Programme), and a DARPA grant entitled ?Crowdsourcing Translation?.",
        "The views in this paper are the authors?",
        "alone."
      ]
    }
  ]
}
