{
  "info": {
    "authors": [
      "Pinaki Bhaskar",
      "Aniruddha Ghosh",
      "Santanu Pal",
      "Sivaji Bandyopadhyay"
    ],
    "book": "Proceedings of the Seventh Workshop on Building Educational Applications Using NLP",
    "id": "acl-W12-2023",
    "title": "Detection and Correction of Preposition and Determiner Errors in English: HOO 2012",
    "url": "https://aclweb.org/anthology/W12-2023",
    "year": 2012
  },
  "references": [
    "acl-C08-1109",
    "acl-C10-2031",
    "acl-T75-2001",
    "acl-W10-4236",
    "acl-W12-2006"
  ],
  "sections": [
    {
      "text": [
        "The 7th Workshop on the Innovative Use of NLP for Building Educational Applications, pages 201?207, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics Detection and Correction of Preposition and Determiner Errors in English: HOO 2012 Pinaki Bhaskar Aniruddha Ghosh Santanu Pal Sivaji Bandyopadhyay Department of Computer Science and Engineering, Jadavpur University 188, Raja S. C. Mallick Road Kolkata ?",
        "700032, India pinaki.bhaskar @gmail.com arghyaonline @gnail.com santanu.pal.ju @gmail.com sivaji_cse_ju @yahoo.com Abstract This paper reports on our work in the HOO 2012 shared task.",
        "The task is to automatically detect, recognize and correct the errors in the use of prepositions and determiners in a set of given test documents in English.",
        "For that, we have developed a hybrid system of an n-gram statistical model along with some rule-based techniques.",
        "The system has been trained on the HOO shared task's training datasets and run on the test set given.",
        "We have submitted one run, which has demonstrated an F-score of 7.1, 6.46 and 2.58 for detection, recognition and correction respectively before revision and F-score of 8.22, 7.59 and 3.16 for detec-tion, recognition and correction respectively after revision."
      ]
    },
    {
      "heading": "1 Introduction Writing research papers or theses in English is a very challenging task for those researchers and scientists whose first language or mother tongue is not English. Depicting their research works properly in English is a hard job for them. Generally their papers, which are submitted to conferences, may be rejected not because of their research works but because of the English writing, which makes the papers harder for the reviewer to understand the intentions of author. This kind of problem will be faced in any field where someone has to provide",
      "text": [
        "material in a language other than his/her first lan-guage.",
        "The mentoring service of Association for Computational Linguistics (ACL) is one part of a re-sponse.",
        "This service can address a wider range of problems than those related purely to writing.",
        "The aim of this service is that a research paper should be judged only on its research content.",
        "The organizer of ?Help Our Own?",
        "(HOO) proposed and initiated a shared task in 2011 (Dale and Kilgarriff, 2010), which attempts to tackle the problem by developing tools or techniques for the non-native speaker of English, which will automatically correct the English prose of the papers so that they can be accepted.",
        "This tools and techniques may also help native English speakers.",
        "This task is simply expressed as text-to-text generation or Natural language Generation (NLG).",
        "In the 2011 shared task, all possible errors were covered which made the task enormously huge.",
        "In 2012, the task is more specific and only deals with determiners and prepositions as described in (Dale and Kilgarriff, 2011).",
        "For this shared task, HOO, we have developed two models, one is rule-based model and the other is the statistical model for both determiners and prepositions.",
        "Then we have combined both these models and developed our system for HOO 2012.",
        "2 Related Work The English language belongs to the Germanic languages branch of the Indo-European language family, widely spoken on six continents.",
        "The HOO",
        "shared task is organized to help authors with writing tasks.",
        "Identifying grammatical and linguistic errors in text is an open challenge to researchers.",
        "In recent times, researchers (Heidorn, 2000) have provided quite a benchmark for spell checker and grammar checkers, which is commonly available.",
        "In this task it is aimed to correct errors beyond the scope of these commonly available checkers i.e. detection and correction of jarring errors at part-of-speech (POS) level, syntax level and semantic lev-el.",
        "Earlier Heidorn (1975) developed augmented phrase structure grammar.",
        "(Tetreault et.",
        "al., 2008) has dealt with error pattern with preposition by non-native speakers.",
        "Meurers and Wunsch (2010) showed a surface based state-of-the-art machine learning technique, which deals with some frequently used prepositions.",
        "(Elghafari et al., 2010) worked on Data-Driven Prediction of Prepositions in English.",
        "Boyd et al. (2011) used an n-gram based machine-learning approach.",
        "Last year we have also participated in this shared task; our system report was reported in (Bhaskar et.",
        "al., 2011).",
        "3 Corpus Statistics There are two sets of data, training set and test set provided by the organizer.",
        "The training set has 1000 documents, which are collected from the FCE dataset.",
        "The publicly available dataset was in the native FCE format.",
        "So, the organizer first convert-edit to the HOO data format.",
        "Then CUP annotators found the errors and marked them up in the dataset.",
        "This year the task is only about the errors related to prepositions and determiners.",
        "So the organizer set only six types of errors, listed in table 1, which were dealt with this year.",
        "Hence, the other errors were discarded and replace with its corresponding standoff annotation in the training set.",
        "The training set consists of 1000 documents of total 374680 words, which means 375 words per document.",
        "All the standoff annotations of training set were provided and an example of the standoff annotation is shown in the figure 1.",
        "Table 2 gives the error statistics of training set as reported in (Dale et.",
        "al., 2012).",
        "The test dataset has another 100 documents, which contain total of 18013 words at an average of 180 words per document.",
        "The test data was processed as the training data was done, but the stand-off annotation of the test documents was not provided before the task completion.",
        "The documents were provided in XML format as shown in the figure 2.",
        "Error Type Tag Original Correction Replacement Preposition RT He was born on January He was born in January Missing Preposition MT Because it reminds me my child-hood.",
        "Because it reminds me of my child-hood.",
        "Unwanted Preposition UT Regarding to the accommodation Regarding the accommodation Replacement Determiner RD I used to going with my friends to the camp.",
        "I used to going with my friends to a camp.",
        "Missing Determiner MD That will be nice to go on 1st of July That will be nice to go on the 1st of July Unwanted Determiner UD The most suitable time for shopping is weekend when parents don't work and children haven't got a school.",
        "The most suitable time for shopping is weekend when parents don't work and children haven't got school.",
        "Table 1.",
        "Examples of the six types of error.",
        "Error Type # Training # Test # before Revised # after Revised UT 822 43 39 MT 1104 57 56 RT 2618 136 148 Prep 4545 236 243 UD 1048 53 62 MD 2230 125 131 RD 609 39 37 Det 3887 217 230 Total 8432 453 473 Words/ Error 44.18 39.77 38.08 Table 2.",
        "Error Statistics in the Training set.",
        "<edit end=\"779\" file=\"0004\" in-dex=\"0008\" part=\"1\" start=\"775\" type=\"UD\"> <original>the </original> <corrections> <correction> <empty/> </correction> </corrections> </edit> <edit end=\"1041\" file=\"0004\" in-dex=\"0010\" part=\"1\" start=\"1039\" type=\"RT\"> <original>in</original> <corrections> <correction>at</correction> </corrections> </edit> Figure 1: An example of a standoff error annotation 4 System Description The task is consisted of two coarse parts ?",
        "Preposition and Determiner detection, recognition and cor-rection.",
        "In our previous year's hybrid model, to resolve preposition errors, a rule-based model was developed and for determiner errors, a linear statistical method was used.",
        "There was no linear statistical model for prepositions.",
        "So this year we have induced a statistical model to incorporate larger coverage of preposition error detection, which is not detected by the appropriate preposition list described in section 4.1.2.",
        "To resolve preposition errors and determiner errors we have built a hybrid model for both of them and used a voting technique among the rule based and statistical model for determiners and rule based post processing for prepositions.",
        "The system architecture is shown in the figure 3.",
        "<?xml version=\"1.0\" encod-ing=\"utf-8\"?> <HOO version=\"2.1\"> <HEAD sortkey=\"\" source-type=\"FCE\"> <CANDIDATE> <AGE>20-30</AGE> </CANDIDATE> </HEAD> <BODY> <PART id=\"1\"> <P>Dear Chris</P> <P>I was great ?</P> .",
        ".",
        ".",
        "</PART> </BODY> </HOO> Figure 2: An example of the XML format of documents 4.1 Preposition Error Detection",
        "model, we have found that due to the list being small, few errors are being detected.",
        "Hence from the training corpus, the appropriate proposition list is enriched.",
        "The list is prepared in regular expression format.",
        "Here is an example: ask * out + invite on a date In the above example, + means the two phrases have a similar meaning and * means one or more words can appear between the two words.",
        "Hence, when a match is found from the appropriate proposition list with the first word or the preposition, the words local to it are validated.",
        "Since the task is about correcting preposition errors, only words are matched with the list.",
        "grateful to SB for ST In the above example, ST means something or an object and SB means somebody or a subject, this information being retrieved from the dependency parser.",
        "4.2 Determiner Error Detection At the beginning of the determiner error detection task, we found that generation of list of rules to detect and correct the probable linguistic errors is a non-exhaustive set.",
        "Hence, we have decided to use a statistical model.",
        "After the statistical model, a rule based system is implemented with a few rules for the determiner devised from grammar books as for certain patterns statistical model fails to identi-fy.",
        "4.2.1 Statistical Model for Determiner Similarly to preposition error detection, here a 5-gram linear statistical model is used.",
        "As same authors are prone to repeat same types of mistakes, we have decided to list out the errors from the training corpus documents.",
        "We have listed the errors document wise.",
        "In the training corpus, age information of author is mentioned.",
        "Hence documents are grouped according to age.",
        "After a close inspection of the document wise error list, the age group is prone to make similar type of errors, which depicts the attributes of the age group.",
        "Our statistical model is trained with every set of training data grouped by age separately.",
        "Hence different statistical models are prepared for different age groups.",
        "Now statistical model are applied according to the age group.",
        "It is found that age wise training incurred better result than single statistical model over whole data.",
        "4.2.2 Rule Based Model for Determiner It is found that statistical models works best for detecting the a and an determiner whereas performance drops for the determiner.",
        "Hence, rules for the are crafted manually from grammar books.",
        "A few rules for a and an are defined based on the first letter of the following word.",
        "Among the determiners, usage of the is the most complicated one.",
        "For the rule based system different lists like nation, nationalities, unique objects, etc are produced.",
        "A few of the rules, which have been developed for the the determiner are mentioned below.",
        "1.",
        "In most cases, if a sentence starts with a proper noun or common noun the is dropped.",
        "2.",
        "Before a country name, the is dropped except if starts with kingdom or republic.",
        "3.",
        "They system checks whether a common noun is appeared in a previous line of the docu-ment, i.e. it has already been referred to, in which case the is added.",
        "4.",
        "If subject and object belong to same class i.e. they share the same hyponym class, the is added to the subject.",
        "5.",
        "In case of superlatives like best, worst etc.",
        "the is added.",
        "6.",
        "Before numerals, the is added.",
        "7.",
        "Before unique things, the is added.",
        "Unique-ness is defined if a thing has single embodiment like moon etc.",
        "8.",
        "It is found that if some geographical location is mentioned at a position other than start of sentence, the is added.",
        "For different rules word lists are prepared such as a unique things list, superlatives, common nouns, country names, citizenships etc.",
        "For a and an determiner correction, a list of different phonemes is prepared.",
        "Rule based system",
        "trims the first two characters and maps them into a phoneme to decide between a and an.",
        "4.2.3 Voting Technique The voting technique is used on the output of the rule based model and the statistical model.",
        "For a and an determiners, statistical model works best, especially in missing determiner and unnecessary determiner but for wrong determiner the rule based model performs better.",
        "For the determiner, the statistical model identified missing determiner and unnecessary determiner cases to some extent whereas list based rule-based system elevates the accuracy.",
        "5 Evaluation The system was evaluated for its performance in detecting, recognizing and correcting preposition and determiner errors in English documents.",
        "Sepa-rate scores were calculated for detection, recognition and correction for both the errors of preposition and determiner separately and then combined scores were also calculated.",
        "For all re-sults, the organizer has provided three measures: Precision, Recall and F-Score.",
        "The precise definitions of these measures as implemented in the evaluation tool, and further details on the evaluation process are provided in (Dale and Narroway, 2012) and elaborated on at the HOO website.4 Each team was allowed to submit up to 10 separate runs over the test data, thus allowing them to have different configurations of their systems eval"
      ]
    },
    {
      "heading": "4 See www.correcttext.org/hoo2012.",
      "text": [
        "uated.",
        "Teams were asked to indicate whether they had used only publicly available data to train their systems, or whether they had made use of privately held data.",
        "We have submitted only one run (JU_run1) which has demonstrated F-scores of 7.1, 6.46 and 2.58 for detection, recognition and correction respectively before revision.",
        "And after revision it has demonstrated F-scores of 8.22, 7.59 and 3.16 for detection, recognition and correction re-spectively.",
        "Table 3 shows all the results of our run.",
        "We had used only publicly available data to train our systems, which are provided by the organizer as training set; we didn't use any privately held data.",
        "6 Conclusion and Future Works Our system has achieved F-scores of 8.22, 7.59 and 3.16 in detection, recognition and correction respectively.",
        "Our system failed to detect and correct many syntactic and semantic errors like wrong a determiner.",
        "Since the data consists of mostly mail conversation, it retains huge number of spelling mistakes, which misdirected the statistical, and rule based model to detect probable errors.",
        "For the determiner, if the size of the produced lists in-creases, better accuracy can be achieved with the rule-based system.",
        "Co-reference is another issue to identify, as the determiner is used mostly subsequent references.",
        "Anaphora resolution might therefore be of some help."
      ]
    }
  ]
}
