{
  "info": {
    "authors": [
      "Marcus Stamborg",
      "Dennis Medved",
      "Peter Exner",
      "Pierre Nugues"
    ],
    "book": "Joint Conference on EMNLP and CoNLL – Shared Task",
    "id": "acl-W12-4505",
    "title": "Using Syntactic Dependencies to Solve Coreferences",
    "url": "https://aclweb.org/anthology/W12-4505",
    "year": 2012
  },
  "references": [
    "acl-J01-4004",
    "acl-P02-1014",
    "acl-P09-2056",
    "acl-W11-1901",
    "acl-W11-1905",
    "acl-W12-4501"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the structure of the LTH coreference solver used in the closed track of the CoNLL 2012 shared task (Pradhan et al., 2012).",
        "The solver core is a mention classifier that uses Soon et al. (2001)'s algorithm and features extracted from the dependency graphs of the sentences.",
        "This system builds on Bjo?rkelund and Nugues (2011)'s solver that we extended so that it can be applied to the three languages of the task: English, Chinese, and Arabic.",
        "We designed a new mention detection module that removes pleonastic pronouns, prunes constituents, and recovers mentions when they do not match exactly a noun phrase.",
        "We carefully redesigned the features so that they reflect more complex linguistic phenomena as well as discourse properties.",
        "Finally, we introduced a minimal cluster model grounded in the first mention of an entity.",
        "We optimized the feature sets for the three languages: We carried out an extensive evaluation of pairs of features and we complemented the single features with associations that improved the CoNLL score.",
        "We obtained the respective scores of 59.57, 56.62, and 48.25 on English, Chinese, and Arabic on the development set, 59.36, 56.85, and 49.43 on the test set, and the combined official score of 55.21."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper, we present the LTH coreference solver used in the closed track of the CoNLL 2012 shared task (Pradhan et al., 2012).",
        "We started from an earlier version of the system by Bjo?rkelund and Nugues (2011), to which we added substantial improvements.",
        "As base learning and decoding algorithm, our solver extracts noun phrases and possessive pronouns and uses Soon et al. (2001)'s pairwise classifier to decide if a pair corefers or not.",
        "Similarly to the earlier LTH system, we constructed a primary feature set from properties extracted from the dependency graphs of the sentences."
      ]
    },
    {
      "heading": "2 System Architecture",
      "text": [
        "The training and decoding modules consist of a mention detector, a pair generator, and a feature extractor.",
        "The training module extracts a set of positive and negative pairs of mentions and uses logistic regression and the LIBLINEAR package (Fan et al., 2008) to generate a binary classifier.",
        "The solver extracts pairs of mentions and uses the classifier and its probability output, Pcoref (Antecedent,Anaphor), to determine if a pair corefers or not.",
        "The solver has also a post processing step to recover some mentions that do not match a noun phrase constituent."
      ]
    },
    {
      "heading": "3 Converting Constituents to Dependency Trees",
      "text": [
        "Although the input to coreference solvers are pairs or sets of constituents, many systems use concepts from dependency grammars to decide if a pair is coreferent.",
        "The most frequent one is the constituent's head that solvers need then to extract using ad-hoc rules; see the CoNLL 2011 shared task (Pradhan et al., 2011), for instance.",
        "This can be tedious as we may have to write new rules for each new feature to incorporate in the classifier.",
        "That is",
        "why, instead of writing sets of rules applicable to specific types of dependencies, we converted all the constituents in the three corpora to generic dependency graphs before starting the training and solving steps.",
        "We used the LTH converter (Johansson and Nugues, 2007) for English, the Penn2Malt converter (Nivre, 2006) with the Chinese rules for Chinese1, and the CATiB converter (Habash and Roth, 2009) for Arabic.",
        "The CATiB converter (Habash and Roth, 2009) uses the Penn Arabic part-of-speech tagset, while the automatically tagged version of the CoNLL Arabic corpus uses a simplified tagset inspired by the English version of the Penn treebank.",
        "We translated these simplified POS tags to run the CATiB converter.",
        "We created a lookup table to map the simplified POS tags in the automatically annotated corpus to the Penn Arabic POS tags in the gold annotation.",
        "We took the most frequent association in the lookup table to carry out the translation.",
        "We then used the result to convert the constituents into dependencies.",
        "We translated the POS tags in the development set using a dictionary extracted from the gold training file and we translated the tags in the training file by a 5-fold cross-validation.",
        "We used this dictionary during both training and classifying since our features had a better performance with the Arabic tagset."
      ]
    },
    {
      "heading": "4 Mention Extraction",
      "text": []
    },
    {
      "heading": "4.1 Base Extraction",
      "text": [
        "As first step of the mention selection stage, we extracted all the noun phrases (NP), pronouns (PRP), and possessive pronouns (PRP$) for English and Arabic, with the addition of PN pronouns for Chinese.",
        "This stage is aimed at reaching a high recall of the mentions involved in the coreference chains and results in an overinclusive set of candidates.",
        "Table 1 shows the precision and recall figures for the respective languages when extracting mentions from the training set.",
        "The precision is significantly lower for Arabic than for English and Chinese."
      ]
    },
    {
      "heading": "4.2 Removal of the Pleonastic it",
      "text": [
        "In the English corpus, the pronoun it in the first step of the mention extraction stage creates a high number of false positive mentions.",
        "We built a classifier",
        "to discard as many of these pleonastic it as possible from the mention list.",
        "Table 2 shows the features we used to train the classifier and Table 3 shows the impact on the final system.",
        "We optimized the feature set using greedy forward and backward selections.",
        "We explored various ways of using the classifier: before, after, and during coreference resolving.",
        "We obtained the best results when we applied the pleonastic classifier during coreference solving and we multiplied the probability outputs from the two classifiers.",
        "We used the inequality: Pcoref (Antecedent, it)?",
        "(1?",
        "Ppleo(it)) > 0.4, where we found the optimal threshold of 0.4 using a 5-fold cross-validation."
      ]
    },
    {
      "heading": "4.3 Named Entities",
      "text": [
        "The simple rule to approximate entities to noun phrases and pronouns leaves out between ?8% and ?13 % of the entities in the corpora (Table 1).",
        "As the named entities sometimes do not match constituents, we tried to add them to increase the recall.",
        "We carried out extensive experiments for the three lan",
        "ment set with and without pruning for all the languages.",
        "guages.",
        "While the named entities increased the score for the English corpus, we found that it lowered the results for Chinese and Arabic.",
        "We added all single and multiword named entities of the English corpus except the CARDINAL, ORDINAL, PERCENT, and QUANTITY tags.",
        "Table 1 shows the recall and precision for English and Table 4 shows the named entity impact on the overall CoNLL score on the development set."
      ]
    },
    {
      "heading": "4.4 Pruning",
      "text": [
        "When constituents shared the same head in the list of mentions, we pruned the smaller ones.",
        "This increased the scores for English and Chinese, but lowered that of Arabic (Table 5).",
        "The results for the latter language are somewhat paradoxical; they are possibly due to errors in the dependency conversion."
      ]
    },
    {
      "heading": "5 Decoding",
      "text": [
        "Depending on the languages, we applied different decoding strategies: For Chinese and Arabic, we used a closest-first clustering method as described by Soon et al. (2001) for pronominal anaphors and a best-first clustering otherwise as in Ng and Cardie",
        "extraction stage on the English development set.",
        "(2002).",
        "For English, we applied a closest-first clustering for pronominal anaphors.",
        "For nonpronominal anaphors, we used an averaged best-first clustering: We considered all the chains before the current anaphor and we computed the geometric mean of the pair probabilities using all the mentions in a chain.",
        "We linked the anaphor to the maximal scoring chain or we created a new chain if the score was less than 0.5.",
        "We discarded all the remaining singletons.",
        "As in Bjo?rkelund and Nugues (2011), we recovered some mentions using a post processing stage, where we clustered named entities to chains having strict matching heads."
      ]
    },
    {
      "heading": "6 Features",
      "text": [
        "We started with the feature set described in Bjo?rkelund and Nugues (2011) for our baseline system for English and with the feature set in Soon et al. (2001) for Chinese and Arabic.",
        "Due to space limitations, we omit the description of these features and refer to the respective papers."
      ]
    },
    {
      "heading": "6.1 Naming Convention",
      "text": [
        "We denoted HD, the head word of a mention in a dependency tree, HDLMC and HDRMC, the leftmost child and the rightmost child of the head, HDLS and HDRS, the left and right siblings of the head word, and HDGOV, the governor of the head word.",
        "From these tokens, we can extract the surface form, FORM, the part-of-speech tag, POS, and the grammatical function of the token, FUN, i.e. the label of the dependency edge of the token to its parent.",
        "We used a naming nomenclature consisting of the role in the anaphora, where J-stands for the anaphor, I-, for the antecedent, F-, for the mention in the chain preceding the antecedent (previous antecedent), and A-for the first mention of the entity in the chain; the token we selected from the dependency graph, e.g. HD or HDLMC; and the value extracted from the token e.g. POS or FUN.",
        "For instance, the part-of-speech tag of the governor of the head word of the anaphor is denoted J-HDGOVPOS."
      ]
    },
    {
      "heading": "6.2 Combination of Features",
      "text": [
        "In addition to the single features, we combined them to create bigram, trigram, and four-gram features.",
        "Table 7 shows the features we used, either single or in combination, e.g. I-HDFORM+J-HDFORM.",
        "We emulated a simple cluster model by utilizing the first mention in the chain and/or the previous antecedent, e.g. A-EDITDISTANCE+FEDITDISTANCE+EDITDISTANCE, where the edit distance of the anaphor is calculated for the first mention in the chain, previous antecedent, and antecedent."
      ]
    },
    {
      "heading": "6.3 Notable New Features",
      "text": [
        "Edit Distance Features.",
        "We created edit distance-based features between pairs of potentially coreferring mentions: EDITDISTANCE is the character-based edit distance between two strings; EDITDISTANCEWORD is a word-level edit distance, where the symbols are the complete words; and PROPERNAMESIMILARITY is a character-based edit distance between proper nouns only.",
        "Discourse Features.",
        "We created features to reflect the speaker agreement, i.e. when the pair of mentions corresponds to the same speaker, often in combination with the fact that both mentions are pronouns.",
        "For example, references to the first person pronoun I from a same speaker refer probably to a same entity; in this case, the speaker himself.",
        "Document Type Feature.",
        "We created the I-HD FORM+J-HDFORM+DOCUMENTTYPE feature to capture the genre of different document types, as texts from e.g. the New Testament are likely to differ from internet blogs."
      ]
    },
    {
      "heading": "6.4 Feature Selection",
      "text": [
        "We carried out a greedy forward selection of the features starting from Bjo?rkelund and Nugues (2011)'s feature set for English, and Soon et al. (2001)'s for Chinese and Arabic.",
        "The feature selection used a 5 fold cross-validation over the training set, where we evaluated the features using the arithmetic mean of MUC, BCUB, and CEAFE.",
        "After reaching a maximal score using forward selection, we reversed the process using a backward elimination, leaving out each feature and removing the one that had the worst impact on performance.",
        "This backwards procedure was carried out until the score no longer increased.",
        "We repeated this forward-backward procedure until there was no increase in performance."
      ]
    },
    {
      "heading": "7 Evaluation",
      "text": [
        "Table 7 shows the final feature set for each language combined with the impact each feature has on the score on the development set when being left out.",
        "A dash (?)",
        "means that the feature is not part of the feature set used in the respective language.",
        "As we can see, some features increase the score.",
        "This is due to the fact that the feature selection was carried out in a cross-validated manner over the training set.",
        "Table 8 shows the results on the development and test sets as well as on the test set with gold mentions.",
        "For each language, the figures are overall consistent between the development and test sets across all the metrics.",
        "The scores improve very significantly with the gold mentions: up to more than 10 points for Chinese."
      ]
    },
    {
      "heading": "8 Conclusions",
      "text": [
        "The LTH coreference solver used in the CoNLL 2012 shared task uses Soon et al. (2001)'s algorithm and a set of lexical and nonlexical features.",
        "To a large extent, we extracted these features from the dependency graphs of the sentences.",
        "The results we obtained seem to hint that this approach is robust across the three languages of the task.",
        "Our system builds on an earlier system that we evaluated in the CoNLL 2011 shared task (Pradhan et al., 2011), where we optimized significantly the solver code, most notably the mention detection step and the feature design.",
        "Although not exactly comparable, we could improve the CoNLL score by 4.83 from 54.53 to 59.36 on the English corpus.",
        "The mention extraction stage plays a significant role in the overall performance.",
        "By improving the quality of the mentions extracted, we obtained a performance increase of 2.35 (Table 6).",
        "Using more complex feature structures also proved instrumental.",
        "Scores of additional feature variants could be tested in the future and possibly increase the system's performance.",
        "Due to limited computing resources and time, we had to confine the search to a handful of features that we deemed most promising.",
        "leaving out this feature from the set; the more negative, the better the feature contribution.",
        "We carried out all the evaluations on the development set.",
        "The table shows the difference with the official CoNLL score."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported by Vetenskapsra?det, the Swedish research council, under grant 621-20104800, and the European Union's seventh framework program (FP7/2007-2013) under grant agreement no.",
        "230902."
      ]
    }
  ]
}
