{
  "info": {
    "authors": [
      "Maria Liakata",
      "Paul Thompson",
      "Anita de Waard",
      "Raheel Nawaz",
      "Henk Pander Maat",
      "Sophia Ananiadou"
    ],
    "book": "Proceedings of the Workshop on Detecting Structure in Scholarly Discourse",
    "id": "acl-W12-4305",
    "title": "A three-way perspective on scientific discourse annotation for knowledge extraction",
    "url": "https://aclweb.org/anthology/W12-4305",
    "year": 2012
  },
  "references": [
    "acl-E99-1015",
    "acl-I08-1050",
    "acl-J02-4002",
    "acl-W04-3103",
    "acl-W09-1402",
    "acl-W10-1913",
    "acl-W10-3001",
    "acl-W11-1825"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics, pages 37?46, Jeju, Republic of Korea, 12 July 2012. c?2012 Association for Computational Linguistics A Three-Way Perspective on Scientific Discourse Annotation for Knowledge Extraction Maria Liakata Aberystwyth University, UK / EMBL-EBI, UK liakata@ebi.ac.uk Paul Thompson University of Manchester, UK paul.thompson@manchester.ac.uk Anita de Waard Elsevier Labs, USA / UiL-OTS, Universiteit Utrecht, NL a.dewaard@elsevier.com Raheel Nawaz University of Manchester, UK raheel.nawaz@cs.man.ac.uk Henk Pander Maat UiL-OTS, Universiteit Utrecht, NL h.l.w.pandermaat@uu.nl Sophia Ananiadou University of Manchester, UK sophia.ananiadou@manchester.ac.uk Abstract This paper presents a three-way perspective on the annotation of discourse in scientific literature.",
        "We use three different schemes, each of which focusses on different aspects of discourse in scientific articles, to annotate a corpus of three full-text papers, and compare the results.",
        "One scheme seeks to identify the core components of scientific investigations at the sentence level, a second annotates meta-knowledge pertaining to bio-events and a third considers how epistemic knowledge is conveyed at the clause level.",
        "We present our analysis of the comparison, and a discussion of the contributions of each scheme.",
        "1 Introduction The literature boom in the life sciences over the past few years has sparked increasing interest into text mining tools, which facilitate the automatic extraction of useful knowledge from text (Ananiadou et al., 2006; Ananiadou & McNaught, 2006; Zweigenbaum et al., 2007; Cohen & Hunter, 2008).",
        "Most of these tools have focussed on entity recognition and relation extraction and with few exceptions, e.g., (Hyland, 1996; Light et al., 2004; S?ndor, 2007; Vincze et al., 2008), do not take into account the discourse context of the knowledge extracted.",
        "However, failure to take this context into account results in the loss of information vital for the correct interpretation of extracted knowledge, e.g. the scope of the relations, or the level of certainty with which they are expressed.",
        "A particular piece of knowledge may represent, e.g., an accepted fact, hypothesis, results of an experiment, analysis based on experimental results, factual or speculative statements etc.",
        "Furthermore, this knowledge may represent the author's current work, or work reported elsewhere.",
        "The ability to recognise different discourse elements automatically provides crucial information for the correct interpretation of extracted knowledge, allowing scientific claims to be linked to experimental evidence, or newly reported experimental knowledge to be isolated.",
        "The importance of categorising such knowledge becomes more pronounced as analysis moves from abstracts to full papers, where the content is richer and linguistic constructions are more complex (Cohen et al., 2010).",
        "Analysis of full papers is extremely important, since less than 8% of scientific claims occur in abstracts (Blake, 2010).",
        "Various different schemes for annotating discourse elements in scientific texts have been proposed.",
        "The schemes vary along several axes, including perspective, motivation, complexity and the granularity of the units of text to which the scheme is applied.",
        "Faced with such variety, it is important to be able to select the best scheme(s) for the purpose at hand.",
        "Answers to questions such as the following can help in the selection process: 1.",
        "What are the relative merits of the different schemes?",
        "2.",
        "What are the similarities and differences between schemes?",
        "3.",
        "Can annotation according to multiple schemes provide enhanced information?",
        "?4.",
        "Is there any advantage in merging annotation schemes or is it better to allow complementary and different dimensions of scientific discourse annotation?",
        "?As a starting point to addressing such questions, we provide a comparison of three different schemes for the annotation of discourse elements within scientific papers.",
        "Each scheme has a different perspective and motivation:, one is content-driven, seeking to identify the main components of a scientific investigation, another is driven by the need to describe events of biomedical relevance and the third focusses on how epistemic knowledge is conveyed in discourse.",
        "These different viewpoints mean that the schemes vary in both the type and complexity of the discourse elements identified, as well as the types of units to which the annotation is applied, i.e. complete sentences, segments of sentences, or specific relations/events occurring within these sentences.",
        "To facilitate the comparison, we have annotated three full papers according to each of the schemes.",
        "The analysis resulting from this three-way annotation considers mappings between schemes, their relative merits, and how the information annotated by the different schemes can complement each other to provide enriched details about knowledge extracted from the texts.",
        "In the following sections, we firstly provide a description of the three schemes, and then explain how they have been used in our corpus annotation.",
        "Finally we discuss the results from the comparison, and the features of each scheme.",
        "2 Sentence annotation: CoreSC scheme The reasoning behind this scheme is that a paper is the human-readable representation of a scientific investigation.",
        "Therefore, the goal of the annotation is to retrieve the content model of scientific investigations as reflected within scientific discourse.",
        "The hypothesis is that there is a set of core scientific concepts (CoreSC), which constitute the key components of a scientific investigation.",
        "CoreSCs consist of 11 concepts originating from the CISP (Core Information about Scientific Papers) meta-data (Soldatova & Liakata, 2007), which are a subset of classes from the EXPO ontology for the description of scientific experiments (Soldatova & King, 2006).",
        "The CoreSCs are: Motivation, Goal, Object, Background, Hypothesis, Method, Model, Experiment, Observation, Result and Conclusion.",
        "The CoreSC scheme (Liakata et al., 2010; Liakata et al., 2012) implements the above-mentioned concepts as a 3-layered sentence-based annotation scheme.",
        "This means that each sentence in a document is assigned one of the 11 CoreSC concepts.",
        "The scheme also considers a layer designated to properties of the concepts (e.g. New Method vs Old Method) as well as identifiers which link instances of the same concept across sentences.",
        "A short definition of CoreSC categories and their properties can be found in Table 1.",
        "The CoreSC scheme is accompanied by 47-page annotation guidelines, and has been used by 16 domain experts to annotate a corpus of 265 full papers from physical chemistry & biochemistry (Liakata & Soldatova, 2009; Liakata et al., 2010).",
        "This corpus consists of 40,000 sentences, containing over 1 million words and was developed in three phases (for details see Liakata et al. (2012)).",
        "Inter-annotator agreement between experts was measured in terms of Cohen's kappa (Cohen, 1960) on 41 papers and ranged between 0.5 and 0.7.",
        "Machine learning classifiers have been trained on the CoreSC corpus, achieving > 51% accuracy across the eleven categories.",
        "The most accurately predicted category is Experiment, the category describing experimental methods (Liakata et al., 2012).",
        "Classifiers trained on 1000 Biology abstracts annotated with CoreSC have obtained an accuracy of over 80% (Guo et al., 2010).",
        "Models trained on the CoreSC corpus papers have been used to create automatic summaries of the papers, which have been evaluated in a question answering task (Liakata et al., 2012).",
        "Lastly, the CoreSC scheme was used to annotate 50 papers from Pubmed Central pertaining to Cancer Risk Assessment.",
        "A web tool (SAPIENTA 1 ) allows users to annotate their full papers with Core Scientific concepts, and can be combined with manual annotation.",
        "A UIMA framework 2 implementation of this code for large-scale annotation of CoreSC concepts is in progress.",
        "3 Event annotation: Meta-knowledge for bio-events The motivation for this annotation scheme is to allow the training of more sophisticated event 1 http://www.sapientaproject.com/software 2 http://uima.apache.org/ based information extraction systems.",
        "In contrast to the sentence-based scheme described in section 2, this scheme is applied at the level of events (Ananiadou et al., 2010), of which there may be several within a single sentence.",
        "3.1 Bio-Events Events are template-like, structured representations of pieces of knowledge contained within sentences.",
        "Normally, events are ?anchored?",
        "to a trigger (typically a verb or noun) around which the knowledge expressed is organised.",
        "Each event has one of more participants, which describe different aspects of the event.",
        "Participants can correspond to entities or other events, and are often labelled with semantic roles, e.g., CAUSE, THEME, LOCATION, etc.",
        "The work described here focusses specifically on bio-events, which are complex structured relations representing fine-grained relations between bio-entities and their modifiers.",
        "Figure 1 provides some examples of bio-events.",
        "Event extraction systems (Bj?rne et al., 2009; Miwa et al., 2010; Miwa et al., 2012; Quirk et al., 2011) are typically trained on text corpora, in which events and their participants have been manually annotated by domain experts.",
        "Research into bio-event extraction has been boosted by the two recent shared tasks at BioNLP 2009/2011 (Kim et al., 2011; Pyysalo et al., In Press).",
        "Several gold standard event annotated corpora exist; examples include the GENIA Event Corpus (Kim et al., 2008), GREC (Thompson et al., 2009) and BioInfer (Pyysalo et al., 2007), in addition to the corpora produced for the shared tasks."
      ]
    },
    {
      "heading": "3.2 Meta-knowledge Annotation Until recently, the only attempts to recognise information relating to the correct interpretation of events were restricted to sparse details regarding negation and speculation (Kim et al., 2011).",
      "text": [
        "In order to address this problem, a multidimensional annotation scheme especially tailored to bio-events was developed (Nawaz et al., 2010; Thompson et al., 2011).",
        "The scheme identifies and categorises several different types of contextual details regarding events (termed meta-knowledge), including discourse information.",
        "Different types of meta-knowledge are encoded through five distinct dimensions (Figure 2).",
        "The advantage of using multiple dimensions is that the interplay between the assigned values in each dimension can reveal both subtle and substantial differences in the types of meta-knowledge expressed.",
        "In the majority of cases, meta-knowledge is expressed through the presence of particular ?clue?",
        "words or phrases, although other features can also come into play, such as the tense of the event trigger, or the relative position within the text.",
        "?The segment annotation scheme identifies a taxonomy of discourse segment types that seem to be exclusive and useful (de Waard & Pander Maat, 2009).",
        "Three classes of segment types are defined: ?",
        "Basic segment types: segments referring directly to the topic of study ?",
        "see Table 2. ?",
        "?Other?-segment types: segments referring to conceptual or experimental work in other research papers than the current one ?",
        "Regulatory segment types: ?regulatory?",
        "clauses that control and introduce other segments.",
        "A list of segment types is presented in Table 2; further details, including a list of all segment types and correlations with verb tense can be found in de Waard & Pander Maat (2009).",
        "The focus of this work is to identify linguistic features that characterise these discourse segment types, according to three aspects: ?",
        "Verb tense, aspect, mood and voice ?",
        "Semantic verb class ?",
        "Epistemic modality markers So far, 6 full-text papers (comprising about 2300 segments) have been manually annotated with segment types and correlated with the above features.",
        "A first automated validation was promising (de Waard, Buitelaar and Eigener, 2009).",
        "The need for parsing at a clause level is especially prominent in biological text, since specific semantic roles are played by particular clause types.",
        "We give four examples of typical clause constructions that play a specific rhetorical role: firstly, reporting clauses are often sentence-initial ?that?",
        "matrix clauses (1a): 1. a.",
        "This suggests that 1.b.",
        "miR-372 and miR-373 caused the observed selective growth advantage.",
        "Secondly, descriptions confirming certain accepted characteristics of biological entities are often given as nonrestrictive relative clauses (2b): 2.a.",
        "We also generated BJ/ET cells expressing the RASV12-ERTAM chimera gene, 2. b. which is only active when tamoxifen is added Thirdly, a subordinate gerund clause is often used to describe a method (3a), with a main (finite) clause describing a result (3b) and fourthly, experimental goals are often given as a (mostly sentence-initial) clause with a to-infinitive (4a) often preceding a past-tense methods clause (4b).",
        "3. a.",
        "Using fluorescence microscopy and luciferase assays, b. we observed potent and specific miRNA activity expressed from each miR-Vec (Figure S2).",
        "4. a.",
        "To identify miRNAs that can interfere with this process 4. b. we transduced BJ/ET fibroblasts with miR-Lib However, the lack of simple robust clause parsers has prevented the automated identification of semantic roles at the clause level.",
        "Therefore, this scheme has so far only been manually"
      ]
    },
    {
      "heading": "Segment Description Examples Fact knowledge accepted to be true, a known fact. mature miR-373 is a homolog of miR-372, Hypothesis a proposed idea, not supported by evidence This could for instance be a result of high mdm2 levels Problem unresolved, contradictory, or unclear issue However, further investigation is required to demonstrate the exact mechanism of LATS2 action Goal research goal To identify novel functions of miRNAs, Method experimental method Using fluorescence microscopy and luciferase assays, Result a restatement of the outcome of an experiment all constructs yielded high expression levels of mature miRNAs Implication an interpretation of the results, in light of data our procedure is sensitive enough to detect mild growth differences Other-Hypothesis an idea proposed by others [It is generally believed that] transcription factors are the final common pathway driving differentiation] Regulatory-Hypothesis a matrix clause introducing a hypothesis It is generally believed that [transcription factors are the final common pathway driving differentiation]",
      "text": [
        "implemented.",
        "Despite being less widely implemented than the other two schemes, we believe that the segment scheme offers some useful pointers for linguistic features that can identify particular rhetorical classes in the text, and secondly, offers an interesting perspective on the fact that in biological text, several rhetorical moves are made within a single sentence.",
        "5 Data and methods Three papers already annotated according to the GENIA event annotation scheme (Kim et al., 2008), were further annotated according to the three annotation schemes described above.",
        "We obtained all corresponding CoreSCs, events and segments per sentence.",
        "Each sentence has a single CoreSC annotation and one or more segment annotations (depending on the number of clauses).",
        "Event annotations in a sentence may range from zero to multiple, according to whether any relevant biomedical events are described in the sentence.",
        "Events within a sentence are mapped to segments by identifying which segment contains the trigger for a particular event.",
        "The three meta-knowledge dimensions for events considered in this comparison, i.e., KT, CL and Source, result in 16 different combinations of values encountered in the three papers.",
        "The numbers for CoreSC and Segment labels encountered were 12 and 22, respectively.",
        "Confusion matrices were obtained for each paper and for each pair of annotation schemes.",
        "Note that, as bio-events are largely unconcerned with describing methodology, the Methods sections of these papers do not contain event annotation or meta-knowledge annotation.",
        "The pairwise confusion matrices from each paper were combined, resulting in three matrices (Tables 3, 4 and 5), which describe the associations between the annotation schemes in the three papers examined.",
        "We have highlighted the highest frequencies per row and where appropriate also the highest values per column.",
        "The use of two different colours aims to facilitate readability.",
        "6 Results and Discussion We present the results from analysing the pairwise confusion matrices for the three schemes and discuss the merits of each scheme."
      ]
    },
    {
      "heading": "6.1 Event Meta-knowledge v. CoreSC In Tables 3 (and 5), the meta-knowledge categories combine KT, CL and Source ((O)ther) values. Table 3 shows some straightforward and expected mappings, e.g.,Method (Met,L3) events are almost always found within CoreSC Experiment or Method sentences, whilst Investigation events (Inv,L3) occur most frequently within CoreSC Goal or Motivation sentences. For other categories, information from the two schemes can complement each other in different ways. For example, KT and Source information about events can help to distinguish different types of information within CoreSC Background sentences (top left corner of Table 3). Such information mainly corresponds to facts, observations from previous studies, or analyses of information. Conversely, information from the CoreSC scheme can help to further classify the interpretation of events. For example, events with an analytical interpretation (Ana,L1,L2,L3) may occur as background information to a study (Bac), as hypotheses (Hyp), as part of observations (Obs), when reporting the results of the current study (Res) or when making concluding remarks about the study (Con). CoreSCs can also help to further refine events relating to outcomes (Obs,L3) according to whether they pertain to (Obs)ervations, (Res)ults or (Con)clusions. CoreSC Conclusion, Result and Observation sentences contain mainly Observation events concerned with the current study. However, such sentences often also include an analytical part, with varying levels of certainty, which event information can help to isolate. The CL annotated for events is also useful in helping to determine the confidence with which information is stated in CoreSC Conclusion and Hypothesis sentences. Due to the nature of bio-event annotation, only a small number of events correspond to methods. Thus, CoreSC provides a more detailed characterisation of method-related sentences, i.e., Experiment, Method_New, Model and Object. 6.2 Discourse Segments v. CoreSC In most cases, there seems to be natural mapping between the two schemes (See Table 4). CoreSC Observation maps to Result, CoreSC Method and Experiment map to Method, CoreSC Hypothesis maps to Hypothesis, CoreSC Goal maps to Goal,",
      "text": []
    },
    {
      "heading": "7 Related Work A number of schemes for annotating scientific discourse elements at the sentence level have been proposed. Certain schemes have been aimed at abstracts, e.g., (McKnight & Srinivasan, 2003; Ruch et al., 2007; Hirohata et al., 2008; Bj?rne et al., 2009). The work of Hirohata et al. (2009) has been integrated with the MEDIE service5 (Miyao et al., 2006), allowing the user to query facts using conclusions, results, etc. For full papers, the most notable work has focussed on argumentative zoning (AZ) (Teufel et al., 1999; Teufel & Moens, 2002; Teufel et al., 2009; Teufel, 2010). An important aspect of AZ involves capturing the attribution of knowledge claims and citation function, and the scheme has been tested on information extraction and summarisation tasks with Computational Linguistics papers. AZ was modified for the annotation of biology papers by Mizuta et al. (2005) in order to facilitate information extraction, and more recently Teufel et al. (2009) extended the AZ scheme to better accommodate the life sciences and chemistry in particular, producing AZ-II. Scientific discourse annotation has also targeted the retrieval of speculative text to help improve curation. For a recent overview see de Waard and Pander Maat (2012). Modality and negation in text have also been the focus of recent workshops (Farkas et al(2010), Morante & Sporleder (2012)). Finally, Shatkay et al(2008) define a multidimensional scheme, which combines several of the above-mentioned aspects. Recent work has compared schemes to discover mappings and relative merits. Liakata et al. (2010) compared AZ-II and CoreSC on 36 papers annotated with both schemes and found that CoreSC provides finer granularity in distinguishing content categories (e.g. methods, goals and outcomes) while the strength of AZ-II lies in detecting the attribution of knowledge claims and identifying the different functions of background information. Guo et al. (2010) compared three schemes for the identification of discourse structure in scientific abstracts from cancer research assessment articles. The work showed a subsumption relation between the scheme of Hirohata et al. (2008), a cut-down version of the 5 http://www.nactem.ac.uk/medie/",
      "text": [
        "scheme proposed by Teufel et al. (2009) and CoreSC (1st layer), from general to specific.",
        "?8 Conclusion We have compared three different schemes, each taking a different perspective to the annotation of scientific discourse.",
        "The comparison shows that the three schemes are complementary, with different strengths and points of focus.",
        "CoreSC offers a fine-grained characterisation of methods, outcomes and objectives.",
        "It has been used to annotate a collection of 265 full papers, and subsequently CoreSC recognition has been fully automated, creating the online SAPIENTA tool.",
        "The discourse segment annotation scheme can help to provide a finer-grained characterisation of background work, and could also help to split multi-clause CoreSC sentences into appropriate segments.",
        "Recognition of event meta-knowledge has been fully automated in the U-Compare framework, and the KT values of the scheme can help to provide a finer-grained analysis of certain segment and sentence types.",
        "The CL dimension also allows confidence values to be ascribed to the Conclusion, Result, Implication and Hypothesis categories of the other two schemes.",
        "Future work will focus on annotating texts with several discourse perspectives to investigate the advantages of the schemes.",
        "Ideally we would like to propose a unified approach for scientific discourse annotation, but recognize that choices such as the unit of annotation are often task-oriented, and that users should be able to mix and match discourse segments as required.",
        "This said, the analysis in this paper paves the way for potential harmonisation, revealing points of union and intersection between the schemes.",
        "Acknowledgements This work has been supported through funding for Maria Liakata by JISC, the Leverhulme Trust and EBI-EMBL.",
        "It has also been supported by the BBSRC through grant number BB/G013160/1UK (Automated Biological Event Extraction from the Literature for Drug Discovery), the MetaNet4U project (ICT PSP Programme, Grant Agreement: No.",
        "270893) and the JISC-funded ISHER project.",
        "classification using rich features.",
        "J Bioinform Comput Biol, 8(1): 131-46.",
        "Miwa, M., Thompson, P. and Ananiadou, S. (2012).",
        "Boosting automatic event extraction from the literature using domain adaptation and coreference resolution.",
        "Bioinformatics.",
        "Miwa, M., Thompson, P., McNaught, J, Kell, D.B and Ananiadou, S. (In Press).",
        "Extracting semantically enriched events from biomedical literature.",
        "BMC Bioinformatics.",
        "Miyao, Y., Ohta, T., Masuda, K., Tsuruoka, Y., Yoshida, K., Ninomiya, T. and Tsujii, J.",
        "(2006).",
        "Semantic Retrieval for the Accurate Identification of Relational Concepts in Massive Textbases.",
        "In Proceedings of ACL, pp.",
        "1017-1024.",
        "Mizuta, Y., Korhonen, A., Mullen, T. and Collier, N. (2005).",
        "Zone Analysis in Biology Articles as a Basis for Information Extraction.",
        "International Journal of Medical Informatics,75(6): 468-487.",
        "Morante R., and Sporleder C, (2012).",
        "Modality and negation: An introduction to the special issue.",
        "Computational Linguistics, 38(2): 1?38.",
        "Nawaz, R., Thompson, P. and Ananiadou, S. (In Press).",
        "Identification of Manner in Bio-Events.",
        "Proceedings of the Eighth International Conference on Language Resources and Evaluation (LREC 2012).",
        "Nawaz, R., Thompson, P., McNaught, J. and Ananiadou, S. (2010).",
        "Meta-Knowledge Annotation of Bio-Events.",
        "In Proceedings of LREC 2010, pp.",
        "2498-2507.",
        "Pyysalo, S., Ginter, F., Heimonen, J., Bjorne, J., Boberg, J., Jarvinen, J. and Salakoski, T. (2007).",
        "BioInfer: a corpus for information extraction in the biomedical domain.",
        "BMC Bioinformatics, 8: 50.",
        "Pyysalo, S., Ohta, T., Rak, R., Sullivan, D., Mao, C., Wang, C., Sobral, B., Tsujii, J. and Ananiadou, S. (In Press).",
        "Overview of the ID, EPI and REL tasks of BioNLP Shared Task 2011.",
        "BMC Bioinformatics.",
        "Quirk, C., Choudhury, P., Gamon, M. and Vanderwende, L. (2011).",
        "MSR-NLP Entry in BioNLP Shared Task 2011.",
        "In Proceedings of BioNLP Shared Task 2011 Workshop, pp.",
        "155-163.",
        "Ruch, P., Boyer, C., Chichester, C., Tbahriti, I., Geissbuhler, A., Fabry, P., Gobeill, J., Pillet, V., Rebholz-Schuhmann, D., Lovis, C. and Veuthey, A.L.",
        "(2007).",
        "Using argumentation to extract key sentences from biomedical abstracts.",
        "Int J Med Inform, 76(2-3): 195-200.",
        "S?ndor, ?.",
        "(2007).",
        "Modeling metadiscourse conveying the author's rhetorical strategy in biomedical research abstracts.",
        "Revue Fran?aise de Linguistique Appliqu?e, 200(2): 97-109.",
        "Shatkay, H., Pan, F., Rzhetsky, A. and Wilbur, W.J.",
        "(2008).",
        "Multi-dimensional classification of biomedical text: toward automated, practical provision of high-utility text to diverse users.",
        "Bioinformatics, 24(18): 2086-2093.",
        "Soldatova, L.N.",
        "and King, R.D.",
        "(2006).",
        "An ontology of scientific experiments.",
        "Journal of the Royal Society Interface, 3(11): 795-803.",
        "Soldatova, L.N.",
        "and Liakata, M. (2007).",
        "An ontology methodology and cisp-the proposed core information about scientific papers., Aberystwyth University.",
        "Technical Report JISC Project Report.",
        "Teufel, S. (2010).",
        "The Structure of Scientific Articles: Applications to Citation Indexing and Summarization.",
        "Stanford, CA, CSLI Publications.",
        "Teufel, S., Carletta, J. and Moens, M. (1999).",
        "An annotation scheme for discourse-level argumentation in research articles.",
        "In Proceedings of EACL, pp.",
        "110-117.",
        "Teufel, S. and Moens, M. (2002).",
        "Summarizing scientific articles: experiments with relevance and rhetorical status.",
        "Computational Linguistics, 28(4): 409-445.",
        "Teufel, S., Siddharthan, A. and Batchelor, C. (2009).",
        "Towards discipline-independent argumentative zoning: Evidence from chemistry and computational linguistics.",
        "In Proceedings of EMNLP 2009, pp.",
        "1493-1502.",
        "Thompson, P., Iqbal, S.A., McNaught, J. and Ananiadou, S. (2009).",
        "Construction of an annotated corpus to support biomedical information extraction.",
        "BMC Bioinformatics, 10: 349.",
        "Thompson, P., Nawaz, R., McNaught, J. and Ananiadou, S. (2011).",
        "Enriching a biomedical event corpus with meta-knowledge annotation.",
        "BMC Bioinformatics, 12: 393.",
        "Vincze, V., Szarvas, G., Farkas, R., Mora, G. and Csirik, J.",
        "(2008).",
        "The BioScope corpus: biomedical texts annotated for uncertainty, negation and their scopes.",
        "BMC Bioinformatics, 9(Suppl 11): S9.",
        "Zweigenbaum, P., Demner-Fushman, D., Yu, H. and Cohen, K.B.",
        "(2007).",
        "Frontiers of biomedical text mining: current progress.",
        "Briefings in Bioinformatics, 8(5): 358-375."
      ]
    }
  ]
}
