{
  "info": {
    "authors": [
      "Li Quan",
      "Oleksandr Kolomiyets",
      "Marie-Francine Moens"
    ],
    "book": "Proceedings of the Seventh Workshop on Building Educational Applications Using NLP",
    "id": "acl-W12-2031",
    "title": "KU Leuven at HOO-2012: A Hybrid Approach to Detection and Correction of Determiner and Preposition Errors in Non-native English Text",
    "url": "https://aclweb.org/anthology/W12-2031",
    "year": 2012
  },
  "references": [
    "acl-C08-1022",
    "acl-I08-1059",
    "acl-I08-2082",
    "acl-N07-1007",
    "acl-P11-1019",
    "acl-W00-0708",
    "acl-W07-1607",
    "acl-W10-4236"
  ],
  "sections": [
    {
      "text": [
        "The 7th Workshop on the Innovative Use of NLP for Building Educational Applications, pages 263?271, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics KU Leuven at HOO-2012: A Hybrid Approach to Detection and Correction of Determiner and Preposition Errors in Non-native English Text"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In this paper we describe the technical implementation of our system that participated in the Helping Our Own 2012 Shared Task (HOO-2012).",
        "The system employs a number of preprocessing steps and machine learning classifiers for correction of determiner and preposition errors in non-native English texts.",
        "We use maximum entropy classifiers trained on the provided HOO-2012 development data and a large high-quality English text collection.",
        "The system proposes a number of highly-probable corrections, which are evaluated by a language model and compared with the original text.",
        "A number of deterministic rules are used to increase the precision and recall of the system.",
        "Our system is ranked among the three best performing HOO-2012 systems with a precision of 31.15%, recall of 22.08% and F1-score of 25.84% for correction of determiner and preposition errors combined."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The Helping Our Own Challenge (Dale and Kilgar-riff, 2010) is a shared task that was proposed to address automated error correction of non-native English texts.",
        "In particular, the Helping Our Own 2012 Shared Task (HOO-2012) (Dale et al., 2012) focuses on determiners and prepositions as they are well-known sources for errors produced by non-native English writers.",
        "For instance, Bitchener et al. (2005) reported error rates of respectively 20% and 29%.",
        "Determiners are in particular challenging because they depend on a large discourse context and world knowledge, and moreover, they simply do not exist in many languages, such as Slavic and South-East Asian languages (Ghomeshi et al., 2009).",
        "The use of prepositions in English is idiomatic and thus very difficult for learners of English.",
        "On the one hand, prepositions connect noun phrases to other words in a sentence (e.g. .",
        ".",
        ".",
        "by bus), on the other hand, they can also be part of phrasal verbs such as carry on, hold on, etc.",
        "In this paper we describe our system implementation and results in HOO-2012.",
        "The paper is structured as follows.",
        "Section 2 gives the task definition, errors addressed, data resources and evaluation criteria and metrics.",
        "Section 3 shows some background and related work.",
        "Section 4 gives the full system description, while Section 5 reports and discusses the results of the experiments.",
        "Section 6 concludes with an error analysis and possible further improvements."
      ]
    },
    {
      "heading": "2 HOO-2012 Tasks and Resources",
      "text": []
    },
    {
      "heading": "2.1 Tasks",
      "text": [
        "In the scope of HOO-2012 the following six possible error types1 are targeted: ?",
        "Replace determiner (RD): Have the nice day.",
        "?",
        "Have a nice day.",
        "?",
        "Missing determiner (MD): That is great idea.",
        "?",
        "That is a great idea.",
        "?",
        "Unnecessary determiner (UD): I like the pop music.",
        "?",
        "I like pop music.",
        "?",
        "Replace preposition (RT): In the other hand.",
        ".",
        ".",
        "?",
        "On the other hand.",
        ".",
        ".",
        "?",
        "Missing preposition (MT): She woke up 6 o?clock.",
        "?",
        "She woke up at 6 o?clock.",
        "?",
        "Unnecessary preposition (UT): He must go to home.",
        "?",
        "He must go home."
      ]
    },
    {
      "heading": "2.2 Data",
      "text": [
        "The HOO development dataset consists of 1000 exam scripts drawn from a subset of the CLC FCE Dataset (Yannakoudakis et al., 2011).",
        "This corpus contains texts written by students who attended the Cambridge ESOL First Certificate in English examination in 2000 and 2001.",
        "The entire development dataset comprises 374680 words, with an average of 375 words per file.",
        "The test data consists of a further 100 files provided by Cambridge University",
        "dataset (?Dev?)",
        "and two versions of the gold standard test data: the original version as derived from the CUP-provided dataset (?Test A?",
        "), and a revised version (?Test B?)",
        "which was compiled in response to requests for corrections from participating teams.",
        "The datasets and the revision process are further explained in (Dale et al., 2012)."
      ]
    },
    {
      "heading": "2.3 Evaluation Criteria and Metrics",
      "text": [
        "For evaluation in the HOO framework, a distinction is made between scores and measures.",
        "The complete evaluation mechanism is described in detail in (Dale and Narroway, 2012) and on the HOO-2012",
        "Scores Three different scores are used: 1.",
        "Detection: does the system determine that an edit of the specified type is required at some point in the text?",
        "2.",
        "Recognition: does the system correctly determine the extent of the source text that requires editing?",
        "3.",
        "Correction: does the system offer a correction",
        "that is identical to that provided in the gold standard?",
        "Measures For each score, three measures are calculated: precision (1), recall (2) and F score (3).",
        "(2) where tp is the number of true positives (the number of instances that are correctly found by the system), fp the number of false positives (the number of instances that are incorrectly found), and fn the number of false negatives (missing results).",
        "where ?",
        "is used as a weight factor regulating the trade-off between recall and precision.",
        "We use the balanced F -score, i.e. ?",
        "= 1, such that recall and precision are equally weighted.",
        "Combined We provide results on prepositions and determiners combined, and for each of these two subcategories separately.",
        "We also report on each of the different error types separately."
      ]
    },
    {
      "heading": "3 Related Work",
      "text": [
        "HOO-2012 follows on from the HOO-2011 Shared Task Pilot Round (Dale and Kilgarriff, 2011).",
        "That task targeted a broader range of error types, and used a much smaller dataset.",
        "Most work on models for determiner and preposition generation has been developed in the context of machine translation output (e.g. (Knight and Chan-der, 1994), (Minnen et al., 2000), (De Felice and Pulman, 2007) and (Toutanova and Suzuki, 2007)).",
        "Some of these methods depend on full parsing of text, which is not reliable in the context of noisy non-native English texts.",
        "Only more recently, models for automated error detection and correction of non-native texts have been explicitly developed and studied.",
        "Most of these methods use large corpora of well-formed native English text to train statistical models, e.g. (Han et al., 2004), (Gamon et al., 2008) and (De Felice and Pulman, 2008).",
        "Yi et al. (2008) used web counts to determine correct article usage, while Han et al. (2010) trained a classifier solely on a large error-tagged learner corpus for preposition error correction."
      ]
    },
    {
      "heading": "4 System Description",
      "text": []
    },
    {
      "heading": "4.1 Global System Workflow",
      "text": [
        "The system utilizes a hybrid approach that combines statistical machine learning classifiers and a rule-based system.",
        "The global system architecture is presented in Figure 1.",
        "This section describes the global system workflow.",
        "The subsequent sections elaborate on the machine learning classifiers and heuristics implemented in the system.",
        "The system workflow is divided in the following",
        "processing steps: 1.",
        "Text Preprocessing: The system performs a preliminary text analysis by automated spelling correction and subsequent syntactic analysis, such as tokenization and part-of-speech (POS) tagging.",
        "2.",
        "Error Detection, Recognition and Correction:",
        "The system identifies if a correction is needed, and the type and extent of that correction.",
        "Two families of error correction tasks that separately address determiners and prepositions are performed in parallel.",
        "3.",
        "Correction validation: Once a correction has been proposed, it is validated by a language model derived from a large corpus of high-quality English text.",
        "In HOO-2012, texts submitted for automated corrections are written by learners of English.",
        "Besides the error types that are addressed in HOO-2012, misspellings are another type of highly-frequent errors.",
        "For example, one student writes the following: In my point of vue, Internet is the most important discover of the 2000 centery.",
        "When using automated natural language processing tools, incorrect spelling (and grammar) can introduce an additional bias.",
        "To reduce the bias propagated from the preprocessing steps, the text is first automatically corrected by the open-source spell checker GNU Aspell.3 At the next step, the text undergoes a shallow syntactic analysis that includes sentence boundary detection, tokenization, part-of-speech tagging, chunking, lemmatization, relation finding and prepositional phrase attachment.",
        "These tasks are performed by MBSP (De Smedt et al., 2010).4",
        "Correction In general, the task of automated error correction is addressed by a number of subtasks of finding the position in text, recognizing the type of error, and the proposal for a correction.",
        "In our implementation we approach these tasks in a two-step approach as proposed in (Gamon et al., 2008).",
        "With two families of errors, the system therefore employs four classifiers in total.",
        "For determiner error corrections, a classifier (C1 in Figure 1) first predicts whether a determiner is required in the observed context.",
        "If it is required, another classifier (C2 in Figure 1) estimates which one.",
        "The same approach is employed for the preposition error correction task (classifiers C3 and C4 in Figure 1).",
        "The details on how the classifiers were implemented are highlighted in Section 4.2.",
        "Our error correction system implements a correction validation mechanism as proposed in (Gamon et al., 2008).",
        "The validation mechanism makes use of a language model that is derived from a large corpus of English.",
        "We use a trigram language model trained on the English Gigaword corpus with a 64K-word vocabulary (using interpolated Kneser-Ney smoothing with a bigram cutoff of 3 and trigram cutoff of 5).",
        "The language model serves to increase the precision at the cost of recall as false positives can be confusing for learners for English.",
        "The original sentence and the error-corrected version are passed to the language model.",
        "Only if the difference in probability of being generated by the language model exceeds a heuristic threshold (estimated using a tuning set) is the correction finally accepted."
      ]
    },
    {
      "heading": "4.2 Machine Learning Classifiers",
      "text": [
        "As already mentioned, the system employs four machine learning classifiers in total (C1?C4 ?",
        "two for each family of errors).",
        "Classifiers C1 and C3 respectively estimate the presence of determiners and prepositions in the observed context.",
        "If one is expected, the second set of classifiers estimates which one is the most likely.",
        "For the determiner choice classifier (C2), we restrict the determiner choice class values to the indefinite and definite articles: a/an and the.",
        "The preposition choice class values for the preposition choice classifier (C4) are restricted to set of the following 10 common prepositions: on, in, at, for, of, about, from, to, by, with and (other).",
        "All the classifiers are implemented by discriminative maximum entropy classification models (ME) (Ratnaparkhi, 1998).",
        "Such models have been proven effective for a number of natural language processing tasks by combining heterogeneous forms of evidence (Ratnaparkhi, 2010).",
        "Training Classifiers and Inference As training instances we consider each noun phrase (NP) in every sentence of the training data.",
        "For the binary classifiers (C1 and C3), a positive example is a noun phrase that follows a determiner/preposition, and a negative example is one that does not.",
        "The multi-class classifiers (C2 and C4) are trained respectively to distinguish specific instances of determiners (definite and indefinite for C2) and the set of prepositions mentioned above.",
        "For each classifier, a training instance is represented by the following features:",
        "?",
        "Tokens in NP.",
        "?",
        "Tokens?",
        "POS tags in NP.",
        "?",
        "Tokens?",
        "lemmas in NP.",
        "?",
        "Tokens in a contextual window of 3 tokens to the left and to the right from the potential correction position.",
        "?",
        "Tokens?",
        "POS tags in a contextual window of 3 tokens from the potential correction position.",
        "?",
        "Tokens?",
        "lemmas in a contextual window of 3 tokens from the potential correction position.",
        "?",
        "Trigrams of concatenated tokens before and after NP.",
        "?",
        "Trigrams of concatenated tokens?",
        "POS tags before and after NP.",
        "?",
        "Trigrams of concatenated tokens?",
        "lemmas before and after NP.",
        "?",
        "Head noun in NP.",
        "?",
        "POS tag of head noun in NP.",
        "?",
        "Lemma of head noun in NP.",
        "Once the classification models have been derived, the classifiers are ready to be employed in the system.",
        "For the text correction task, each sentence undergoes the same preprocessing analysis as described in Section 4.1.1.",
        "Then, for each noun phrase in the input sentence, we extract the feature context, and use the models to predict the need for the presence of a determiner or preposition, and if so, which one.",
        "Our system only accepts classifier predictions if they are obtained with a high confidence.",
        "The confidence thresholds were empirically estimated from pre-evaluation experiments with a tuning dataset (Section 5.1)."
      ]
    },
    {
      "heading": "4.3 Rule-based Modules",
      "text": [
        "Our system also has a number of rule-based modules.",
        "The first rule-based module is in charge of making the choice between a and an if the determiner type classifier (C2) predicts the presence of an indefinite determiner.",
        "The choice is determined by a lookup in the CMU pronouncing dictionary5 (a/an CMU Dictionary in Figure 1).",
        "In this dictionary each word entry is mapped to one or a number of pronunciations in the phonetic transcription code system Arpabet.",
        "If the pronunciation of the word that follows the estimated correction position starts with a consonant, a is used; if it starts with a vowel, an is selected.",
        "The second rule-based module corrects confusion errors of determiner-noun agreement, e.g. this/these and that/those (Definite Determiner in Figure 1).",
        "It is implemented by introducing rules with patterns based on whether the noun was tagged as singular or plural.",
        "The third rule-based module is used to filter out unnecessary corrections proposed by the classifiers",
        "against the input text and if it yields a different text than the original input text, such a correction is considered as a necessary correction.",
        "However, sometimes automatically proposed corrections have to be rejected because they are out of scope of the addressed errors.",
        "We do not replace possessive determiners such as my, your, his, our, their by the definite article the.",
        "Similarly, some prepositions can be grouped in opposite pairs, for example from and to, for which we do not propose any correction as it requires a deep semantic analysis of text."
      ]
    },
    {
      "heading": "5 Experiments and Results",
      "text": [
        "In this section we describe the pre-evaluation experiments and the results of the final evaluation on the HOO-2012 test set.",
        "Table 2 shows the characteristics of the datasets used in the experiments."
      ]
    },
    {
      "heading": "5.1 Pre-Evaluation Experiments",
      "text": [
        "In the course of system development, we split the files in the HOO development dataset into a training set (80%), a tuning set (10%) and a held-out test set (10%).",
        "From the beginning it was clear that the provided development dataset alne was too small to address the automated error correction tasks by employing machine learning classification techniques.",
        "Additionally to that dataset, we used a set of Reuters news data and the Wikipedia corpus for training the classifiers.",
        "Once the classification models had been derived, the system was evaluated on the tuning data and adjusted in order to increase the overall performance.",
        "After that, the system was evaluated on the held-out test set for which the results are shown in Table 3."
      ]
    },
    {
      "heading": "5.2 Final System Configuration and Evaluation Results",
      "text": [
        "For the final evaluation, we retrained the models using the complete HOO development data (again, in addition to the Reuters and Wikipedia corpus mentioned above).",
        "The number of training instances are shown in Table 4.",
        "In the HOO framework, precision and recall are weighted equally.",
        "However, in the domain of error correction for non-native writers, precision is probably more important because false positives can be very confusing and demotivating for learners of English.",
        "For this reason, we submitted two different runs which also gave us insights into the impact of the language model.",
        "?Run 0?",
        "denotes the system excluding the language model and using lower thresholds, such that neither precision nor recall is favored in particular, while ?Run 1?",
        "focuses on precision by using the language model as a filter, and having higher thresholds.",
        "Thus, we present the results for two different runs on the final HOO test set, both before and after manual revision (see Section 2.2).",
        "Table 5 presents the results for recognition and Table 6 those for correction.",
        "The difficulty of the HOO 2012 Shared Task is reflected by rather low system performance levels (Dale et al., 2012).",
        "Nonetheless, we observed some interesting patterns.",
        "In terms of the overall system performance, our system achieved better results for determiner errors than for preposition errors.",
        "With respect to determiners, missing determiners are handled best by our system, while unnecessary determiners and replacement errors are more difficult.",
        "Concerning prepositions, missing prepositions are found to be the most challenging.",
        "This confirms the difficulty of choosing the right preposition due to the large number of possible alternatives, and their sometimes subtle differences in usage and meaning.",
        "While ?Run 1?",
        "achieved a higher precision (at the cost of recall), ?Run 0?",
        "performed better in terms of overall performance (F1-score).",
        "This result can be explained by the relative small size and limited tuning of the language model.",
        "Moreover, it also shows that the use of the F1-score might not be the most informative evaluation metric in this context."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "Determiners and prepositions present real challenges for non-native English writers.",
        "For automated determiner and preposition error correction in HOO-2012, we implemented a hybrid system that combines statistical machine learning classifiers and a rule-based system.",
        "By employing a language model for correction validation, the system achieved a precision of 42.16%, recall of 9.49% and F1-score of 15.50%.",
        "Without the language model, a precision of 31.15%, recall of 22.08% and F1-score of 25.84% were reached, and our system was ranked third in terms of F1-score.",
        "Three major bottlenecks were identified in the implementation: (i) spelling errors should first be corrected due to the noisy input texts; (ii) classifier thresholds must be carefully adjusted to minimize false positives; and (iii) overall, preposition errors are handled worse than determiner errors, although there is also a large difference among the various error types.",
        "For future work, we will focus on models that explicitly utilize the writer's background.",
        "Also, a full evaluation of the system should include a thorough user-centric study with evaluation criteria and metrics beyond the traditional precision, recall and F - score."
      ]
    }
  ]
}
