{
  "info": {
    "authors": [
      "Milica Gasić",
      "Pirros Tsiakoulis",
      "Matthew Henderson",
      "Blaise Thomson",
      "Kai Yu",
      "Eli Tzirkel",
      "Steve Young"
    ],
    "book": "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue",
    "id": "acl-W12-1609",
    "title": "The Effect of Cognitive Load on a Statistical Dialogue System",
    "url": "https://aclweb.org/anthology/W12-1609",
    "year": 2012
  },
  "references": [
    "acl-E09-1081",
    "acl-W09-3902"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL), pages 74?78, Seoul, South Korea, 5-6 July 2012. c?2012 Association for Computational Linguistics The Effect of Cognitive Load on a Statistical Dialogue System M.",
        "Gas?ic?",
        "?, P.",
        "Tsiakoulis?, M.",
        "Henderson?, B.",
        "Thomson?, K.",
        "Yu?, E.",
        "Tzirkel??",
        "and S. Young?"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In recent years statistical dialogue systems have gained significant attention due to their potential to be more robust to speech recognition errors.",
        "However, these systems must also be robust to changes in user behaviour caused by cognitive loading.",
        "In this paper, a statistical dialogue system providing restaurant information is evaluated in a set-up where the subjects used a driving simulator whilst talking to the system.",
        "The influences of cognitive loading were investigated and some clear differences in behaviour were discovered.",
        "In particular, it was found that users chose to respond to different system questions and use different speaking styles, which indicate the need for an incremental dialogue approach."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A spoken dialogue system enables a user to obtain information while using their hands to perform some other task, which in many cases is the user's primary task.",
        "A typical example is an in-car spoken dialogue system where the spoken interaction is secondary to the main task of driving the car (Weng et al., 2004).",
        "This domain is particularly challenging since it involves dealing with the errors caused by the varying noise levels and changes in user behaviour caused by the cognitive load.",
        "A statistical approach to dialogue modelling has been proposed as a means of automatically optimising dialogue policies.",
        "In particular, the partially observable Markov decision process (POMDP) model for dialogue provides a representation of varying levels of uncertainty of the user input, yielding more robust dialogue policies (Williams and Young, 2007; Thomson and Young, 2010; Young et al., 2010).",
        "Another thread of research deals with speech interfaces for in-car applications, see (Baron and Green, 2006) for a review.",
        "Past research has investigated the extent to which speaking is cognitively less demanding than typing (Gartner et al., 2001; Tsimhoni et al., 2004; Kun et al., 2007).",
        "In addition, considerable research has examined how driving safety is influenced by a dialogue system (Lai et al., 2001; Lee et al., 2001; Nielsen et al., 2008).",
        "However, to the best of our knowledge, little work has been done to investigate the effect of the cognitive load when interacting with a real conversational spoken dialogue system.",
        "The work presented in (Mishra et al., 2004) suggests that the user speech is more disfluent when the user is performing another task.",
        "However, this work is based on a Wizard of Oz framework, where a human provides the system's responses.",
        "Also, a push-to-talk button was used for every utterance which will have affected the natural flow of the dialogue.",
        "It is important to know if the change of cognitive load has an effect on the speaking style and whether the system can alter its behaviour to accommodate for this.",
        "In this paper we try to answer these questions by examining dialogues where users drove a car simulator and talked to an open-microphone fully automated spoken dialogue system at the same time.",
        "The rest of the paper is organised as follows.",
        "Section 2 provides an overview of the dialogue system used and section 3 describes the evaluation set-up.",
        "The analysis of the results is given in Section 4.",
        "Section 5 concludes the paper.",
        "You are looking for a cheap restaurant and it should be in the east part of town.",
        "Make sure you get the address of the venue."
      ]
    },
    {
      "heading": "2 System overview",
      "text": [
        "The user speaks to the system, and the acoustic signal is converted by the speech recogniser into a set of sentence hypotheses, which represents a probability distribution over all possible things that the user might have said.",
        "The sentence hypotheses are converted into an N-best list of dialogue acts by a semantic decoder.",
        "Since the dialogue state cannot be directly observed it maintains a probability distribution over all states, which is called the belief state.",
        "The belief state is updated at every user turn using Bayesian inference treating the input dialogue acts as evidence.",
        "Based on belief state, the optimal system act is selected using a policy and which is trained automatically using reinforcement learning.",
        "The abstract system dialogue act is converted to an appropriate utterance by a natural language generator and then converted to speech by an HMM-based speech synthesiser.",
        "To enable in-car speech interaction via mobile phone, a VoIP interface is implemented.",
        "The domain is Cambridge restaurant information with a database of about 150 venues and 7 slots that users can query."
      ]
    },
    {
      "heading": "3 Evaluation set-up",
      "text": [
        "Our goal is to understand system performance when driving.",
        "However, due to the safety restrictions, performance was tested using a driving simulator.",
        "The following sections explain the set-up."
      ]
    },
    {
      "heading": "3.1 Car simulator",
      "text": [
        "The car simulator used in the evaluation was the same as in (Davies and Robinson, 2011).",
        "It consists of a seat, a steering wheel and pedals, which give a realistic cab-like environment for the participants.",
        "There is also a projection screen which largely fills the visual field of the driver.",
        "The simulation software is a modified version of Rockstar Games?",
        "Grand Theft Auto: San Andreas, with over 500 km of roads.",
        "For the purpose of the evaluation, the subjects were asked to drive on the main motorway, to keep the lane and not to drive over 70mph."
      ]
    },
    {
      "heading": "3.2 Subjects",
      "text": [
        "For the study 28 subjects were recruited, 22 where native speakers.",
        "Each subject had to complete three scenarios: (1) to drive the car simulator for 10 minutes, (2) to talk to the system for 7 dialogues and (3) to talk to the system for 7 dialogues while driving.",
        "The scenarios were in counterbalanced order.",
        "While they were driving, the speed and the road position were recorded.",
        "If the scenario involved talking to the system, the instructor read out the dialogue task (see an example in Table 1) and dialled the phone number.",
        "In addition, the subject had the dialogue task displayed on a small screen next to the driving wheel.",
        "The subject talked to the system using loud speaker mode on the mobile phone."
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "To examine the influence of cognitive load, the following examinations were performed.",
        "First, we investigate if the subjects felt any change in the cognitive load (Section 4.1).",
        "Then, in Section 4.2, we examine how the driving was influenced by the subjects talking to the system.",
        "Finally, we investigate how successfully the subjects were able to complete the dialogue tasks while driving (Section 4.3).",
        "This is followed with an examination of the conversational patterns that occurred when the subjects were driving whilst talking to the system (Section 4.4)."
      ]
    },
    {
      "heading": "4.1 Cognitive load",
      "text": [
        "After each scenario the subjects were asked to answer five questions based on the NASA-TLX self-reporting scheme for workload measurement.",
        "They answered by providing a rating from 1 (very easy) to 5 (very hard).",
        "The averaged results are given in Table 2.",
        "We performed a Kruskal test, followed by pairwise comparisons for every scenario for each answer and all differences are statistically significant (p < 0.03) apart from the differences in the frustration, the stress and the pace between talking and talking and driving.",
        "This means that they were clearly able to feel the change in cognitive load."
      ]
    },
    {
      "heading": "4.2 Driving performance",
      "text": [
        "For 26 subjects we recorded position on the road and the speed.",
        "Since these measurements vary significantly across the subjects, for each subject we calculated the average speed, the standard deviation and the entropy and similarly for the average position in the lane.",
        "For the speed, we computed how many subjects had a higher average speed when they were talking and driving versus when they were just talking and similarly for the standard deviation and the entropy.",
        "The results are given in Table 3.",
        "It can be seen that the user's speed is lower when they are driving and talking, however, the increase in the standard deviation and the entropy suggest that their driving is more erratic.",
        "No significant differences were observed for the road position."
      ]
    },
    {
      "heading": "4.3 Dialogue task completion",
      "text": [
        "Each participant performed 14 dialogues, 7 for each scenario.",
        "In total, there were 196 dialogues per scenario.",
        "After each dialogue they told the instructor if they thought the dialogue was successful, and this information was used to compute the subjective",
        "completion rate.",
        "In addition, all dialogues were transcribed and analysed to see if the system provided information the user asked for and hence calculate an objective completion rate.",
        "The results are given in Table 4.",
        "These differences are not statistically significant due to the small sample size.",
        "However, it can be seen that the trend is that the dialogues where the subject was not performing another task at the same time were more successful.",
        "Also, it is interesting that the subjective scores are higher than the objective ones.",
        "This can be explained by the fact that the dialogue tasks were predefined and the subjects do not always pay sufficient attention to their task descriptions."
      ]
    },
    {
      "heading": "4.4 Conversational patterns",
      "text": [
        "Given that the subjects felt the change of cognitive load when they were talking to the system and operating the car simulator at the same time, we were interested to see if there are any changes in the dialogues which might suggest this.",
        "First, we examine how well they follow the given task on a turn-to-turn basis.",
        "For example, if the task is to find a cheap restaurant and if at some point in the dialogue the user says I?d like an expensive restaurant that turn is not consistent with the task.",
        "The results are given in Table 5 and they are statistically significant (p < 0.01).",
        "We then examine the number of contradictions on a turn-to-turn basis.",
        "For example, if the user says I?d like a cheap restaurant and later on they say I?d like",
        "1. system requests or confirms and requests",
        "an expensive restaurant the latter turn is clearly a contradiction.",
        "The percentage of contradicting turns is less than 1% and the difference between the scenarios is not statistically significant.",
        "This suggests that while users tend to forget the task they are given when they are driving, they still act rationally despite the increase in the cognitive load.",
        "The next analysis concerns the user obedience, i.e. the extent to which subjects answer the system questions.",
        "We grouped the system questions in two classes.",
        "The first class represents the questions where the system requests a value for a particular slot, for instance What part of town are you looking for?",
        "and the questions where the system confirms and requests at the same time, for instance You are looking for a cheap restaurant.",
        "What part of town are you looking for?",
        "The second class correspond to system confirmations, for example Did you say you are looking for a cheap restaurant?",
        "The percentage of the obedient user turns per class is given in Table 6.",
        "Due to the small sample size these results are not statistically significant.",
        "Still, it is interesting to see that when driving the subjects appear to be more obedient to the system confirmations than when they are just talking.",
        "When the system makes a confirmation, the user can answer with simple yes or no, whereas when the system requests the value of a particular slot, the user needs to think more to provide an answer.",
        "The number of barge-ins, the number of filler words and the average speech intensity vary considerably among the subjects.",
        "Therefore, we average these statistics per user and examine the number of users for which the particular measure is greater for the scenario where they talked to the system and drove the simulator at the same time.",
        "The results",
        "(Table 7) show that the number of barge-ins and the number of fillers is significantly greater for the scenario when they are talking and driving and the intensity on average tend to be greater."
      ]
    },
    {
      "heading": "5 Conclusion and Future work",
      "text": [
        "There are several important observations arising from this study.",
        "Firstly, dialogues with cognitively loaded users tend to be less successful.",
        "This suggests that the system should alter its behaviour to match user behaviour and alleviate the cognitive load in order to maintain the level of performance.",
        "This necessitates rapid on-line adaptation of dialogue policies.",
        "The second observation is that cognitively loaded users tend to respond to some types of system questions more than others.",
        "This indicates that the user model within a POMDP dialogue system should be conditioned on a measure of cognitive load.",
        "Finally, this study has found that users barge-in and use filler words significantly more often when they are cognitively loaded.",
        "This suggests the need for a much richer turn-taking model which allows the system to use back-channels and barge-in when the user hesitates.",
        "An obvious candidate is the incremental approach (Schlangen and Skantze, 2009; DeVault et al., 2009) which allows the system to process partial user inputs, back-channels, predict short term user input and interrupt the user during hesitations.",
        "While incremental dialogue is a growing area of study, it has not so far been examined in the context of dialogue for secondary tasks.",
        "We signpost this as an important area for future work."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank to Peter Robinson and Ian Davies for their help with the experiments."
      ]
    }
  ]
}
