{
  "info": {
    "authors": [
      "Glyn Morrill",
      "Teresa Soliast"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E93-1034",
    "title": "Tuples, Discontinuity, And Gapping in Categorial Grammar",
    "url": "https://aclweb.org/anthology/E93-1034",
    "year": 1993
  },
  "references": [
    "acl-E91-1035"
  ],
  "sections": [
    {
      "heading": "Abstract 1 Introduction",
      "text": [
        "This paper solves some puzzles in the formalisation of logic for discontinuity in cat-egorial grammar.",
        "A `tuple' operation introduced in [Solias, 1992] is defined as a mode of prosodic combination which has associated projection functions, and consequently can support a property of unique prosodic decomposability.",
        "Discontinuity operators are defined model-theoretically by a resid-uation scheme which is particularly am-menable proof-theoretically.",
        "This enables a formulation which both improves on the logic for wrapping and infixing of [Moort-gat, 1988] which is only partial, and resolves some problems of determinacy of insertion point in the application of these proposals to in-situ binding phenomena.",
        "A discontinuous product is also defined by the residuation scheme, enabling formulation of rules of both use and proof for a `substring' product that would have been similarly doomed to partial logic.",
        "We show how the apparatus enables characterisation of discontinous functors such as particle verbs and phrasal idioms, and binding phenomena such as quantifier raising and pied piping.",
        "We conclude by showing how the apparatus enables a simple cat-egorial analysis of (SVO) gapping using the discontinuity product and the wrapping operator.",
        "*The work by Glyn Morrill was for the most part carried out under the support of the Ministerio de EducaciOn y Ciencia, Madrid, in the form of visting scholarship grant SB90 P413308C.",
        "In [Lambek, 1958] the suggestive recursive fractional categorial notations of [Ajdukiewicz, 1935] and [Bar-Hillel, 1953] were provided with a foundational setting in mathematical logic.",
        "This takes the form of a model theory interpreting category formulas in algebraic structures.",
        "A Gentzen style sequent proof theory for which there is a Cut-elimination result means that a decision procedure is provided on the basis of sequent calculus.",
        "The category formulas are freely generated from atomic category formulas (e.g. N for referring nominals, S for sentences, CN for common nouns, ... ) by binary operators \\ (`under'), / (`over') and • (`product').",
        "The interpretation is in semigroups, i.e. algebras (L, +) where + is a binary operation satisfying the associativity axiom si (.92 + 83) = (si + s2) + s3.",
        "(In the non-associative formulation of [Lambek, 1961], this condition is withdrawn.)",
        "We may in particular consider the algebra obtained by taking the set V* of strings over a vocabulary V; then L is V* – {t} where t is the empty string.",
        "Each category formula A is interpreted as a subset D(A) of L. Given such a mapping for atomic category formulas it is extended to the compound category formulas thus:",
        "In general we may define L in terms of a semigroup algebra (L5 ,-1-,t) where t E L is an identity element, i.e. an element such that s + t = t + s s; then L is L5 – {t}.",
        "In the sequent calculus of [Lambek, 1958] a sequent is of the form A1, , An A where n > 0,1 and is read as asserting that for any elements 'The requirement n > 0 blocks the inference from",
        "a. si, • • • , sn in A1,... , An respectively, Si + + sn is in A.",
        "Thus the relevant prosodic operations are encoded by the linear ordering of antecedents in the sequent, and structural rules of permutation, contraction, and weakening are not valid.",
        "The calculus is as follows.",
        "The notation r(A) represents an antecedent containing a subpart A.",
        "As is normal in sequent calculus, each operator has a L(eft) rule of use and a R(ight) rule of proof.",
        "Cut-free backward chaining proof search is terminating since in every proof step going from conclusion to premises, the total number of operator occurrences is reduced by one.",
        "The original development of categorial grammar grew from semantic concerns, and as is well known, the formalism embraces compositional type-logical semantics.",
        "In particular, division categories A\\B and B/A can be seen as Fregean functors: incomplete Bs the meanings of which are abstracted over A argument meanings.",
        "Complete (or: saturated) expressions bearing primary meanings belong to atomic categories.",
        "Given some basic semantic domains (e.g. truth values {0, 1}, a set of entities E, .)",
        "a hierarchy of spaces for a type-logical semantics may be generated by such operations as function formation (rig: the set of all functions from T2 into r1) and pair formation (r1 x r2: the set of all ordered pairs comprising a r1 followed by a 1-2).",
        "Each category formula A is associated with a semantic domain T(A).",
        "Such a type map T for atomic category formulas (e.g. T(N) = E , T (S) {OM, T(CN) = {0, 1}E) is extended to compound category formulas by T(A\\B) = T(B I A) = T (B)T (A) and T(A.",
        "B) = T(A) x T (B).",
        "Each category formula A is now interpreted as a set of two dimensional 'signs': a subset D(A) of L xT(A).",
        "Such an interpretation for atomic category formulas is extended to one for compound A A to A/A which as a theorem would assert that the identity element I is a member of each category of the form A/A (similarly for A\\A).",
        "Since we have defined categories to be interpreted as subsets of a set L which does not necessarily contain an identity element, such a theorem would not be valid, and it is prevented by defining sequents as having at least one antecedent formula.",
        "Proofs can be annotated to associate typed semantic lambda terms with each theorem [Moortgat, 1988].",
        "A sequent has the form xi: Ai, , xn: An 0: A where n > 0, no semantic variable is associated with more than one category formula, and 0 is a typed lambda term over (free) variables {x1, , xn}.",
        "It is to be read as stating that the result of applying the prosodic operation implicit in the ordering, and the semantic operation represented explicitly by 0, to the prosodic and semantic components of any signs in A1, , An yields a sign in A.",
        "This system is understood as observing the type map in the obvious way, and is an instance of the Curry-Howard correspondence between (intuitionistic) proofs and typed lambda terms.",
        "It was first employed in relation to categorial grammar in [van Benthem 1983]; for generalisation to other connectives see Morrill, 1990b; Morrill, 1992a]"
      ]
    },
    {
      "heading": "2 Prosodic Labelling",
      "text": [
        "As we shall see, the implicit coding of prosodic operations in the ordering of a sequent is not expressive enough to represent the logic of discontinuity connectives.",
        "In this connection, [Moortgat, 1991b] employs [Gabbay, 1991] notion of labelled deductive system (LDS).",
        "When we label for prosodics as well as semantics, a sequent has the form al – xi: AI, .",
        ".",
        ".",
        ", an – xn: An – 0: A where n > 0, no prosodic or semantic variable is associated with more than one category formula, a is a prosodic term over variables {al, , an} and 0 is a typed lambda term over (free) variables {xi, , xn}.",
        "The prosodically and seman-2A general preparation for such multidimensional characterisation is provided by [Oehrle, 1988] which effectively refines Montague's program in order to provide a more even-handed treatment of linguistic dimensions.",
        "But note that Oehrle anticipates only functions as prosodic and semantic objects.",
        "Here the prosodic algebra is not made up of functions, and nor are functions the only kind of semantic object.",
        "The symmetric treatment of prosodics and semantics concurs with the contemporary trend for 'sign-based' grammatical formalisms such as HPSG [Pollard and Sag, 1992], though this latter only goes so far as recursively defining a relation between prosodic and semantic forms, i.e. representations.",
        "By interpreting categories in the way set out in [Morrill, 1992a] as pairings of prosodic and semantic objects we make direct reference to their properties as defined in terms of mathematical models, and use forms only in the meta-theory.",
        "Cut pretation scheme is called residuation.",
        "Under the scheme we define in terms of any binary operation +n complementary (or: dual) division operators \\.",
        "and A and product operator on by the clauses given in (5).",
        "As a consequence the following laws hold (see [Lambek, 1958; Lambek, 1988; Dunn, 1991; Moortgat, 1991a; Moortgat and Morrill, 1991] :4 A C 1 nB A•nB C B A\\nC (6) The LDS logic directly reflects this interpretation.",
        "It always has the following format, together with label equations in accordance with the axioms of the algebra of interpretation.",
        "We are free to manipulate labels according to the equations they satisfy.",
        "In the case of associative Lambek calculus there is the associativity law; in the case of non-associative Lambek calculus there would be no equations on labels.",
        "Observe that with prosodic labelling, the structural rules permutation, contraction, and weakening are valid.",
        "In our labelling, we maintain the convention that antecedent formulas are labelled with prosodic and semantic variables.",
        "As a result each theorem al – xi: an – xn: A.",
        "– 0: A can be read as a Montagovian rule of formation with input categories A1, .",
        ", An and output category A and prosodic and semantic operations a and 0.",
        "Other versions of labelling allow labelling antecedent formulas with prosodic and semantic terms in general.",
        "However such labelling constrains the value of the elements to which the theorems apply by reference to the terms that represent them.",
        "In relation to grammar, this would mean conditioning rules on the semantic and/or prosodic form of the input.",
        "For instance, with respect to semantics, this would constitute essential reference to semantic form in the way which Montague grammar deliberately avoids.",
        "We advocate exactly the same transparency in relation 'In prosodic and semantic terms we allow omission of parenthesis under associativity, and under a convention that unary operators bind tighter than binary operators.",
        "✓ a: A b: B, A z 7(b): C AL r, d:B/nA, O 7(d +n a): C",
        "4 In fact the residuation scheme is even more general than that which we need here: is applies to ternary 'accessibility' relations in general, not just to binary functions, i.e. deterministic ternary relations.",
        "The semantic interpretation with respect to function and Cartesian product formation can also be applied uniformly, with systematic labelling as in the previous section."
      ]
    },
    {
      "heading": "4 Discontinuity",
      "text": [
        "Elegant as such categorial grammar is, it is more suggestive of an approach to computational linguistic grammar formalism, than actually representative of such.",
        "Amongst the various enrichments that have been proposed (see e.g. [van Benthem, 1989; Morrill et al., 1990; Barry et al., 1991; Morrill, 1990a; Morrill, 1990b; Moortgat and Morrill, 1991; Morrill, 1992a; Morrill, 1992b]), [Moortgat, 1988] advanced earlier discussion of discontinuity in e.g. [Bach, 1981; Bach, 1984] with a proposal for infixing and wrapping operators.",
        "The operators not only provide scope over these particular phenomena but also, as indicated in e.g. [Moortgat, 1990], seem to provide an underlying basis in terms of which operators for binding phenomena such as quantification and reflexivisation should be definable.",
        "The coverage of pied piping in [Morrill, 1992b] would also be definable in terms of these primitives, but all this depends on the resolution of certain technical issues which have been to date outstanding.",
        "Amongst the examples we shall be able to treat by means of our present proposals are the following.",
        "a. Mary rang John up.",
        "(8) b. Mary gave John the cold shoulder.",
        "c. John likes everything.",
        "d. for whom John works.",
        "e. John studies logic, and Charles, phonetics.",
        "In the particle-verb construction (8a) and discontinuous idiom (8b), the object 'John' infixes in discontinuous expressions with unitary meanings.",
        "In (8c) the quantifier must receive sentential semantic scope, and in (8d) the pied piping must be generated, with the semantics of 'whom John works for'.",
        "In (8e), the semantics of the verb gapped in the second conjunct must be recovered from the first conjunct.",
        "Binary operators I and j are proposed in [Moortgat, 1988] such that BT A signifies functors that wrap around their A arguments to form Bs, and B1A signifies functors that infix themselves in their A arguments to form Bs.",
        "Assuming the semigroup algebra of associative Lambek calculus, there are two possibilities in each case, depending on whether we are free to insert anywhere (universal), or whether the relevant insertion points are fixed (existential).",
        "We leave semantics aside for the moment.",
        "Inspecting the possibilities of ordered sequent presentation, of the eight possible rules of inference (use and proof for each of four operators), only T3R and jyL are expressible: a. ri, A, r2 B",
        "This is the partial logic of [Moortgat, 1988].",
        "Note that the absence of a rule of use for existential wrapping means that we could not generate from discontinuous elements such as ring up and give the cold shoulder which we should like to assign lexical category (N \\S)/3N.",
        "(Evidently Tv would permit incorrect word order such as *Wary gave the John cold shoulder'.)",
        "The problem with ordered sequents is that the implicit encoding of prosodic operations is of limited expressivity.",
        "Accordingly, [Moortgat, 1991b] seeks to improve the situation by means of explicit prosodic labelling.",
        "This does enable both rules for e.g. jy but still does not enable the useful T3L: the remaining problem is, as noted by [Versmissen, 1991], that we need to have an insertion point somehow determinate from the prosodic label for an existential wrapper in order to perform a left inference.",
        "In [Moortgat, 1991a] a discontinuity product is proposed, again implicitly assuming just a semigroup algebra:5",
        "As for the discontinuity divisions, ordered sequent presentation cannot express rules of both use and proof: only OR can be represented:",
        "Even using labelling, the problem for OL remains and is the same as that above: there is no proper management of separation points.",
        "In [Moortgat, 1991a] it is observed how the quantifying-in of infix binders such as quantifier 'The version given is actually just the existential case of two possibilities, existential and universal, as before.",
        "No rules for the universal version can be expressed in ordered sequent calculus, or labelled sequent calculus.",
        "phrases seems almost definable as S1(SIN): they infix themselves at N positions in Ss (and take semantic scope at the S level – that is why they must be quantified in).",
        "And if this definability could be maintained, it would enable these operators to simulate the account of pied piping in [Morrill, 1992b].",
        "None of the interpretations above however enable the expression of the requirement that the positions referred to by the two operator occurrences are the same.",
        "Our proposals will facilitate this definability, and also admit of a full (labelled) logic."
      ]
    },
    {
      "heading": "5 Tuple Control of Insertion Points",
      "text": [
        "The present innovation rests on extending the prosodic algebra (L*, +, t) as above to an algebra (L*,+,t,(.,.",
        "), 1, 2) where (., .)",
        "is a binary operation of tuple formation (introduced in [Solias, 1992]), with respect to which 1 and 2 behave as projection functions.",
        "Thus the algebra satisfies the conditions:",
        "We may in particular think of the algebra of elements V* obtained from disjoint sets V and ; , ]} by closing V under two binary operations: concatenation +, and pairing [.",
        "; where pairing can be defined as concatenation with delimitation and marking of insertion point.",
        "The proposal can be related to [Moortgat and Morrill, 1991] which also considers algebras with more than one adjunction operation (each either associative or non-associative), and defines divisions and products with respect to each by residuation.",
        "Note however that firstly, our tuple prosodic operation is not simply that of non-associative Lambek calculus which is characterised by the absence of any axiom (associative or otherwise), since the projection axioms entail specific conditions not imposed in the non-associative case: we might describe the tuple system as unassociative.",
        "Tupling is bijective and a prosodic object s formed by tupling records a separation point between two objects is and 2s whereas a prosodic object formed by non-associative adjunction has no such recoverable separation point.",
        "Secondly, we are not primarily interested here in divisions and products based on tupling but in the combined use of the associative and unassociative operations to define discontinuity operators.",
        "(Note however that residuation with respect to tupling, as proposed in [Solias, 1992], would define operators suitable for verbs regarded as head-wrappers such as 'persuade'.)",
        "This brings us to the essence of the present proposals with respect to wrapping and infixing.",
        "The prosodic interpretation for the discontinuity operators is to be as follows: D(Bi A) = {sib's' E D(A), is + s' + 2s E D(B)} (15) D(BIA) = {sIVs' E D(A), is' + s + 2s' E D(B)} D(A 0 B) = { lsi + 82 + 282181 E D(A),s2 E D(B)} It can be seen that the operators are the residuation divisions with respect to a binary prosodic operation I defined by 81182 = isi s2 + 281 just as the Lambek operators are the residuation divisions with respect to +.",
        "Use of the tuple operation collapses the former distinction between existential and universal in (9) and (10).",
        "Because pairing is bijective and tuples express a unique insertion point, there is a unique decomposition of tupled elements.",
        "Existential and universal wrappers collapse into a single wrapper and existential and universal infixers collapse into a single infixer.",
        "Turning to include the semantics, the type map is as is to be expected for functors and for product: T(Bi A) = T(BIA) = T(B)T(A) and T(A 0 B) = T(A) x T(B), and as usual a category formula A is interpreted as a subset of L x T(A).",
        "The full prosodically and semantically labelled logic is given in Figure 1.",
        "In IL lc and 2c pick out the first and second projections of the prosodic object c in the same way that projections pick out the components of a semantic object in the rule of (4g);",
        "likewise in IR for the projections la and 2a.",
        "The resulting prosodic forms are only simplifiable when the relevant objects are tuples.6"
      ]
    },
    {
      "heading": "6 Discontinuity Examples",
      "text": []
    },
    {
      "heading": "6.1 Phrasal Verbs",
      "text": [
        "As a first example of discontinuity consider the particle verb case 'Mary rang John up' and the discontinuous idiom case 'Mary gave John the cold shoulder'.",
        "The meaning of the particle verb and the phrasal idiom resides with its elements together, which wrap around their object.",
        "The lexical assignments required are:",
        "A derivation is given in Figure 2.",
        "The lexical prosodics and semantics of the proper names may be assumed to be atoms.",
        "For 'Mary rang John up', substitution of the lexical prosodics thus yields (18) which simplifies as shown.",
        "Similarly, substitution of the lexical semantics gives (19).",
        "((ring-up john) mary) (19) For 'Mary gave John the cold shoulder', substitution of the lexical prosodics yields:",
        "shaving the projection functions defined for all prosodic objects rather then just tuple objects allows us to consider the prosodic algebra to be untyped (or: unsorted).",
        "Consequently, there is no need to check for the data type of prosodic objects such as by pattern-matching on antecedent terms (see comment above on transparency of rules).",
        "It may be possible to develop the present proposals by adding sort structure to the prosodic algebra in a manner analogous to the typing of the semantic algebra.",
        "Such sorting could be essential to defining a model theory with respect to which the calculus can be shown to be complete.",
        "Recursive nesting of infixation points does not appear to be motivated linguistically, and the present calculus does not support it.",
        "A sorted model theory which excludes the recursion might provide an interpretation with respect to which the present calculus is both sound and complete."
      ]
    },
    {
      "heading": "6.2 Quantifier Raising",
      "text": [
        "In Montague grammar quantifying-in is motivated by the necessity to achieve sentential scope for all quantifiers and quantifier-scope ambiguities.",
        "Quantifying-in allows a quantifier phrase to apply as a semantic functor to its sentential context.",
        "Quantifying-in at different sentence levels enables a quantifier to take scope accordingly, and alternative orderings of quantifying-in enable quantifiers to take different scopings relative to one another.",
        "In [Moortgat, 1990] a binary operator 11 is defined for which the rule of use is essentially quantifying-in, so that a Montagovian treatment of quantifier-scoping is achieved by assignment of a quantifier phrase like `something' to NO, and assignment of determiners like 'every' to (NftS)/CN.",
        "In [Moortgat, 1991a] he suggests that a category such as A ft. B might be definable as B 1(Bi A), but notes that this definability does not hold for his definitions, for which, furthermore, the logic is problematic.",
        "On the present formulation however, these intuitions are realised.",
        "The category Sj(SIN) is a suitable category for a quantifier phrase such as 'everything' or 'some man', achieving sentential quantifier scope, and quantificational ambiguity.",
        "Assume the lexical entry (22).",
        "For 'John likes everything' there is the derivation in Figure 3.",
        "In this derivation, and in general, lines are included showing explicit label manipulations under equality in the prosodic algebra, in such a way that all rule instances match the rule presentations.",
        "Substitution of the lexical prosodics and semantics associates John + likes + everything with (23) which simplifies as shown."
      ]
    },
    {
      "heading": "Vy((like John)",
      "text": [
        "In this example the quantifier is peripheral in the sentence and a category (S/N)\\S could have been used in associative Lambek calculus.",
        "However, another category SAN \\S) would be needed to allow the quantifier phrase to appear in subject position, and further assignments still would be required for post-verbal position in a ditransitive verb phrase, and so on.",
        "Some generality can be achieved by assuming second-order polymorphic categories (see [Emms, 1990]), but note that the single assignment we have given allows appearance in all N positions without further ado, and allows all the relative quantifier scopings at S nodes."
      ]
    },
    {
      "heading": "6.3 Pied Piping",
      "text": [
        "In [Moortgat, 1991a] and and [Morrill, 1992b] a three-place operator is considered which is like A ft B, except that quantifying-in changes the category of the context expression.. [Morrill, 1992b] shows that this enables capture of pied piping.",
        "It follows from",
        "the nature of the present proposals that Al(BIC) presents the desired complicity between the operators.",
        "As a result, the treatment of [Morrill, 1992b] can be presented in these terms.",
        "Consider the example 'for whom John works'.",
        "The relative pronoun is lexically assigned as follows where R is the common noun modifier category CN \\ CN.",
        "There is the derivation in Figure 4.",
        "The result of prosodic substitution is for + whom + (john + works, i) The result of semantic substitution is",
        "As for the quantification, this example is potentially manageable in just Lambek calculus.",
        "But an example where the relative pronoun is not peripheral in the pied piped material, such as 'a man a brother of whom from Brazil appeared on television' would be problematic for the same reasons as quantification.",
        "The solution, in terms of infixing and wrapping, is the same in the two cases, but pied piping has been a more conspicuous problem for categorial grammar because while the scoping of quantifiers can be played down, the syntactic realisation of pied piping is only too evident.",
        "In the phrase structure tradition, pied piping has been taken as strong motivation for feature percolation (see [Pollard, 1988]).",
        "We have seen here how discontinuity operators challenge this con-strual.",
        "Categorial grammar is well-known to provide possibilities for 'non-constituent' coordination (see [Steedman, 1985; Dowty, 1988]) less accessible in the phrase structure/feature percolation approach.",
        "We turn now to another example which is glaringly problematic for all approaches, gapping.",
        "It is entirely unclear how feature percolation could engage such a construction; but as we shall see the discontinuity apparatus succeeds in doing so.",
        "The construction is characterised by the absence in the right hand conjunct of a verbal element, the understood semantics of which is provided by a corresponding verbal element in the left hand conjunct.",
        "Clearly, instanciations of a coordinator category schema (X\\X)/X will not generate such cases of gapping.",
        "The phenomenon has attracted a fair amount of attention in categorial grammar (e.g. [Steedman, 1990; Raaijmakers, 1991]).",
        "The approach of [Steedman, 1990] aims to reduce gapping to constituent coordination; furthermore it aims to do this using just the standard division operators of categorial grammar.",
        "This involves special treatment of both the right and the left conjunct.",
        "We present our discussion in the context of the present minimal example of gapping a transitive verb TV.",
        "With respect to the right hand conjunct, the initial problem is to give a categorisation at all.",
        "Steedman does this by reference to a constituent formed by the subject and object with the coordinator.",
        "This constituent is essentially TV \\S but with a feature",
        "both blocking ordinary application, and licensing coordination with a left hand conjunct of the same category.",
        "The blocking is necessary because 'and Charles, phonetics' is clearly not of category TV \\S: `Studies and Charles, phonetics' is not a sentence.",
        "Now, with respect to the left hand conjunct, Steedman invokes a special decomposition of 'John studies logic' analysed as S, into TV and TV \\S.",
        "There is then constituent coordination between TV \\S and TV \\S.",
        "Finally the coordinate structure of category TV \\S combines with TV on the left to give S. Although this treatment addresses the two problems that any account of gapping must solve, categorisation of the right hand conjunct and access of the verbal semantics in the left hand conjunct, it attempts to do so within a narrow conception of categorial grammar (only division operators) that necessiates invocation of distinctly contrived mechanisms.",
        "We believe that the radical reconstruals of grammar implicated by this analysis are not necessary given the general framework including discontinuity operators we have set out.",
        "We address for the moment just our minimal example.",
        "Within the context of categorial grammar we have established, the right hand conjunct is characterisable as SITV.",
        "It remains to access the understood verbal semantics from the sentence that is the left hand conjunct.",
        "In order to recover from the left hand side the information we miss on the right hand side, we would like to say that this information, the category and semantics of the verb, is made available to the coordinator when it combines with the left conjunct.",
        "In accordance with the spirit of Steedman, we can observe that the left hand conjunct contains a part with the category SITV of the right hand constituent, but it is discontinuous, being interpolated by TV.",
        "But this is precisely what is expressed by the discontinuous product category (SITV)®TV.",
        "Furthermore, an element of such a category has as its semantics a pair the second projection of which is the semantics of the TV.",
        "Consequently gapping is generated by assignment of 'and' to the category (((SITV)0TV)\\S)/(SITV) with semantics AxAyKirly ir2y) A (x ir2y)].",
        "The complete derivation for (27) is as in Figure 5, where TV abbreviates (N\\ S)/N.",
        "When we substitute the lexical prosodics (here each just a prosodic constant) for the prosodic variables in the conclusion, we obtain the prosodic form (28)."
      ]
    },
    {
      "heading": "Similarly substituting the lexical semantics (all se",
      "text": [
        "mantic constants except for the coordinator semantics as above), we obtain the associated semantics (29) which evaluates as shown.",
        "((studies phonetics) charles)] Some generalisation to cover different categories of gapped element and different categories of coordination is given by straightforward schematisation.",
        "In general, gapping coordinator categories have the form ((Z 0 Y)\\X)IZ where Z is XIY.",
        "In this scheme, X is the category of the resulting coordinate structure and Y is the category of the gapped material.",
        "This allows interaction with other coordination phenomena such as node raising.",
        "For example, a referee pointed out that gapping can occur within incomplete sentences thus: 'John gave a book and Peter, a paper, to Mary'.",
        "Such a case would be covered by the instanciation where Y is the ditransitive verb category and X is S/PP.",
        "For generalisation including multiple gapping (several discontinuous segments elided) see [Solias, 1992], which employs in addition operators formed by residuation with respect to tupling.",
        "That approach has certain affinities with [Oehrle, 1987], and makes it possible to begin to address examples of Oehrle's relating to scope and Boolean particles.",
        "The purpose of the present paper has been to lay the groundwork for empirical inquiry into gapping and other notorious nonconcatenative phenomena, made possible in",
        "categorial grammar by a proper treatment of discontinuity."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "When [Moortgat, 1988] introduced discontinuity operators for categorial grammar, he noted that ordered sequent calculus was an inadequate medium for the representation of a full logic.",
        "In [Moortgat, 1991b] the LDS formalism was invoked, but as we have seen, the LDS format alone is not enough.",
        "The present paper has argued that a different view is required on the model theory of discontinuity than that suggested by interpretation in just a semigroup algebra.",
        "This view is provided by adding to the algebra of interpretation the tuple operation of [Solias, 1992].",
        "Not only does this clear up some vagueness with respect to existential and universal formulations, it also admits of a full labelled logic.",
        "This has brought us to a stage where it is appropriate to address such issues as completeness and Cut-elimination."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We thank the following for comment on an earlier abstract: Juan Barba, Alain Lecomte, Michael Moortgat, Koen Versmissen, and three anonymous EACL reviewers.",
        "Particular thanks go to Mark Hepple who happens to have been thinking along similar lines."
      ]
    }
  ]
}
