{
  "info": {
    "authors": [
      "Peter F. Brown",
      "Stephen A. Della Pietra",
      "Vincent J. Della Pietra",
      "Meredith J. Goldsmith",
      "Jan Hajič",
      "Robert L. Mercer",
      "Surya Mohanty"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H93-1039",
    "title": "But Dictionaries Are Data Too",
    "url": "https://aclweb.org/anthology/H93-1039",
    "year": 1993
  },
  "references": [
    "acl-J93-2003"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Although empiricist approaches to machine translation depend vitally on data in the form of large bilingual corpora, bilingual dictionaries are also a source of information.",
        "We show how to model at least a part of the information contained in a bilingual dictionary so that we can treat a bilingual dictionary and a bilingual corpus as two facets of a unified collection of data from which to extract values for the parameters of a probabilistic machine translation system.",
        "We give an algorithm for obtaining maximum likelihood estimates of the parameters of a probabilistic model from this combined data and we show how these parameters are affected by inclusion of the dictionary for some sample words.",
        "There is a sharp dichotomy today between rationalist and empiricist approaches to machine translation: rationalist systems are based on information cajoled fact by reluctant fact from the minds of human experts; empiricist systems are based on information gathered wholesale from data.",
        "The data most.",
        "readily digested by our translation system is from bilingual corpora, but bilingual dictionaries are data too, and in this paper we show how to weave information from them into the fabric of our statistical model of the translation process.",
        "When a lexicographer creates an entry in a bilingual dictionary, he describes in one language the meaning and use of a word from another language.",
        "Often, he includes a list.",
        "of simple translations.",
        "For example, the entry for disingenuousness in the Harper-Collins Robert French Dictionary [1] lists the translations dOoyoute, inanque de sincerite, and fourberie.",
        "In constructing such a list, the lexicographer gathers, either through introspection or extrospection, in 202 stances in which disingenuousness has been used in various ways and records those of the different translations that he deems of sufficient importance.",
        "Although a dictionary is more than just a collection of lists, we will concentrate here on that portion of it that is made up of lists.",
        "We formalize an intuitive account of lexicographic behavior as follows.",
        "We imagine that a lexicographer, when constructing an entry for the English word or phrase e, first chooses a random size s, and then selects at random a sample of s instances of the use of e, each with its French translation.",
        "We imagine, further, that he includes in his entry for e a list consisting of all of the translations that occur at least once in his random sample.",
        "The probability that he will, in this way, obtain the list f1, fm, is",
        "where Pr(fi le) is the probability from our statistical model that the phrase f, occurs as a translation of e, and Pr(sle) is the probability that the lexicographer chooses to sample s instances of e. The multinomial coefficient is defined by",
        "and satisfies the recursion",
        "In general, the sum in Equation (1) cannot be evaluated in closed form, but we can organize an efficient calculation of it as follows.",
        "Let",
        "and therefore, we can compute p(fi, ,fmle) in time proportional to s2m... By judicious use of thresholds, even this can be substantially reduced.",
        "In the special case that Pr(sle) is a Poisson distribution with mean A(e), i.e., that",
        "This is the form that we will assume throughout the remainder of the paper because of its simplicity.",
        "Notice that in this case, the probability of an entry is a product of factors, one for each of the translations that it contains.",
        "The series f1, frn represents the translations of e that are included in the dictionary.",
        "We call this set of translations De.",
        "Because we ignore everything about the dictionary except for these lists, a complete dictionary is just a collection of De's, one for each of the English phrases that has an entry.",
        "We treat each of these entries as independent and write the probability of the entire dictionary as",
        "the product here running over all entries.",
        "make it up.",
        "The probabilities of these entries in turn are given by Equation (8) in terms of the probabilities, p(fle), of individual French phrases given individual English phrases.",
        "Combining these two equations, we can write",
        "We take p(fle) to be given by the statistical model described in detail by Brown et al.",
        "[2].",
        "Their model has a set of translation probabilities, t(f le), giving for each French word f and each English word e the probability that f will appear as (part of) a translation of e; a set of fertility probabilities, n(/le), giving for each integer 0 and each English word e the probability that e will be translated as a phrase containing 0, French words; and a set of distortion probabilities governing the placement of French words in the translation of an English phrase.",
        "They show how to estimate these parameters so as to maximize the probability,",
        "Let 0 represent the complete set of parameters of the model of Brown et al.",
        "[2], and let 0 represent any one of the parameters.",
        "We extend the method of Brown et al.",
        "to develop a scheme for estimating 0 so as to maximize the joint probability of the corpus and the dictionary, Pre(H, D).",
        "We assume that Pre(H, D) = Pre(H)Pre(D).",
        "In general, it is possible only to find local maxima of Pre(H, D) as a function of 0, which we can do by applying the EM algorithm [3, 4].",
        "The EM algorithm adjusts an initial estimate of 0 in a. series of iterations.",
        "Each iteration consists of an estimation step in which a count is determined for each parameter, followed by a maximization step in which each parameter is replaced by a value proportional to its count.",
        "The count co for a. parameter 0 is defined by",
        "Because we assume that H and D are independent, we can write ce as the sum of a count for H and a count for D: Equation (9) gives the probability of the dictionary in terms of the probabilities of the entries that cB = co(H) + ce(D).",
        "(13)",
        "The corpus count is a sum of counts, one for each translation in the corpus.",
        "The dictionary count is also a sum of counts, but with each count weighted by a factor p(e,f) which we call the effective multiplicity of the translation.",
        "Thus,",
        "The effective multiplicity is just the expected number of times that our lexicographer observed the translation (e, f) given the dictionary and the corpus.",
        "In terms of the a priori multiplicity, po(e,f) = A(e)p(f le), it is given by",
        "Figure 1 shows the effective multiplicity as a function of the a priori multiplicity.",
        "For small values of po(e,f), p(e,f) is approximately equal to 1 + lio(e,f)/2.",
        "For very large values, po(e,f) and p(e,f) are approximately equal.",
        "Thus, if we expect a priori That the lexicographer will see the translation (e,f) very many times, then the effective multiplicity will be nearly equal to this number, but even if we expect a priori that.",
        "he will scarcely ever see a translation, the effective multiplicity for it cannot fall below 1.",
        "This is reasonable because in our model for the dictionary construction process, we assume that nothing can get into the dictionary unless it.",
        "is seen at least once by the lexicographer."
      ]
    },
    {
      "heading": "RESULTS",
      "text": [
        "We have used the algorithm described above to estimate tra.nslation probabilities and fertilities for our statistical model in two different ways.",
        "First, we estimated them from the corpus alone, then we estimated them from the corpus and the dictionary together.",
        "The corpus that we used is the proceedings of the Canadian Parliament described elsewhere [2].",
        "The dictionary is a machine readable version of the HarperCollins Robert French Dictionary [1].",
        "We do not expect that including information from the dictionary will have much effect.",
        "on words that",
        "occur frequently in the corpus, and this is borne out by the data.",
        "But.",
        "for words that are rare, we expect that there will be an effect.",
        "Tables I and 2 show the two results for the English word tundra.",
        "The entry for tundra in the HarperCollins Robert French Dictionary [1] is simply the word toundra.",
        "We interpret this as a list with only one entry.",
        "We don't know how many times the lexicography ran across tundra translated as toundra, but we know that it was at least once, and we know that he never ran across it translated as anything else.",
        "Even without the dictionary, toundra appears as the most probable translation, but with the dictionary, its probability is greatly improved.",
        "A more significant fact is the change in the fertility probabilities.",
        "Rare words have a tendency to act as garbage collectors in our system.",
        "This is why tundra, in the absence of guidance from the dictionary has, 3 as its most probable fertility and has a significant probability of fertility 9.",
        "With the dictionary, fertility 1 becomes the overwhelming favorite, and fertility 9 dwindles to insignificance.",
        "Tables 3 and 4 show the trained parameters for jungle.",
        "The entry for jungle in the HarperCollins Robert French Dictionary is simply the word jungle.",
        "As with tundra using the dictionary enhances the probability of the dictionary translation of jungle and also improves the fertility substantially,"
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
