{
  "info": {
    "authors": [
      "Shinichi Doi",
      "Kazunori Muraki",
      "Shin-ichiro Kamei",
      "Kiyoshi Yamabana"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Poster Session",
    "id": "acl-E93-1060",
    "title": "Long Sentence Analysis by Domain-Specific Pattern Grammar",
    "url": "https://aclweb.org/anthology/E93-1060",
    "year": 1993
  },
  "references": [],
  "sections": [
    {
      "text": [
        "We propose a method for analyzing long complex and compound sentences that utilizes global structure analysis with domain-specific pattern grammar.",
        "Previously, long sentence analysis with global information used the following methods: two-level analysis – global structure analysis of long sentences with domain-independent function words and parsing of their constituents[Doi et al., 1991], and pattern matching – adaptation of domain-specific fixed pattern to input sentences.",
        "By utilizing domain-dependent information the latter method could analyze long sentences of that domain.",
        "But since the matching is made only on the surface the sentence isn't analyzed well when patterns appear recursively."
      ]
    },
    {
      "heading": "2 Domain-Specific Pattern Grammar",
      "text": [
        "Our method analyzes the global structure of long sentences by using three knowledge-bases: domain-specific patterns that can be described as a phrase structure grammar, a list of keywords that denote constituents of the patterns, and a pure basic grammar.",
        "An input sentence is initially parsed and divided into its constituents with these knowledge-bases, and then each constituent is parsed with a general grammar.",
        "Each constituent must be guaranteed uniformity by parsing with pure basic grammar.",
        "To obtain a pattern grammar of Japanese long sentences we analyzed the structures of about 750 long sentences from the leads of news articles in a Japanese newspaper, Asahi Shinbun, and identified several fixed global patterns.",
        "An example of pattern grammar is shown in Fig. 1.",
        "Using the pattern grammar and keyword list(a–c), the global structure of the sentence(d) was analyzed as f)."
      ]
    },
    {
      "heading": "3 Conclusion",
      "text": [
        "Our method takes advantage of both two-level analysis and pattern matching, and can deal with the irregular appearance of patterns including recursive patterns, ellipsis of constituents and patterns that appear in only part of the sentence.",
        "We have developed a Japanese lead analyzing system using a pattern grammar.",
        "We used this system with several 80-200 word Japanese leads such as the example sentence in Fig. 1., and obtained correct global structures and syntactic trees for them."
      ]
    }
  ]
}
