{
  "info": {
    "authors": [
      "Claire Gardent"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E93-1018",
    "title": "A Unification-Based Approach to Multiple VP Ellipsis Resolution",
    "url": "https://aclweb.org/anthology/E93-1018",
    "year": 1993
  },
  "references": [
    "acl-C90-3018",
    "acl-J86-3001",
    "acl-J88-2004",
    "acl-J90-4001",
    "acl-P84-1085",
    "acl-P91-1008"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "An assumption shared by many theories of discourse is that discourse structure constrains anaphora resolution (cf. [Grosz and Sidner 1986] for definite NPs, [Lascarides and Asher 1991], [Nakhimovsky 1988] for temporal anaphora, [Webber 1990] for deictic pronouns and [Gardent 1991], [Priist and Scha 1990] for VP ellipsis).",
        "The aim of this paper is (i) to show that this assumption also applies to multiple VP ellipsis (VPE), (ii) to argue that other levels of linguistic information (such as syntax and semantics) interact with discourse structure in determining multiple VPE acceptability and (iii) to make these intuitions precise by providing a unification-based account of multiple VPE resolution."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "[Klein and Stainton-Ellis 1989] convincingly argue that VPE need not resolve to the nearest possible antecedent.",
        "The most intricate examples they give to support this claim involve what they dubbed multiple VPE and can be illustrated by the following discourses (square brackets surround antecedent VPs, Oi indicates VP ellipses and indices represent anaphoric dependencies)1: *The work reported here was partially carried out in the LRE Project 61-062, Towards a declarative theory of discourse.",
        "(1) I promised myself I wouldn't go to Manchester] unless I first [2 opened a big stack of mail].",
        "I didn't 02, so I didn't 01.",
        "(Nesting) (2) If you [I work hard, make the right choices and keep your nose clean], you [2 get ahead].",
        "If you don't 01, you don't 02.",
        "(Crossing) (3) I was [1 really thin] then, and I tried some ski-pants that [2 looked really good on me], and I [3 should have bought them].",
        "But I didn't 03, and now I 'm not 01 and they wouldn't 02.",
        "(Mired)",
        "As these examples show, there is not one pattern relating multiple VPEs to their antecedents, but at least three: nesting, crossing and mixed.",
        "Nesting and crossing can be represented as follows (where VP, and 0i represent antecedent and elliptical VPs respectively): Nesting: VP1 VP„ On • • • 0: Crossing: VP1 .",
        "• • 0,, while a mixed pattern simply is a configuration in which both crossing and nesting occur.",
        "According to this terminology, (1) illustrates a nesting pattern, (2) shows a crossing pattern and (3) a mixed pattern.",
        "Thus, it is clear that no unique dependency configuration constrains the resolution of multiple VPEs.",
        "On the contrary, it appears that all patterns are possible and thus that any configurational restriction on VPE resolution is doomed to failure.",
        "Interestingly however, despite the multiple ways in which each of the VPEs could be resolved, there is in actual fact no ambiguity as to how the global discourse should be understood.",
        "This suggests that some strong constraints come into play to help the hearer resolve the question: What is it that constrains multiple VPE resolution in such a way that these \"exotic\" discourses are in fact intelligible?",
        "adequately.",
        "In what follows, I argue that discourse structure (rather than surface ordering) is one of the main constraint regulating multiple VPE resolution.",
        "2 Discourse grammar and VPE resolution The discourse grammar used builds on [Polanyi and Scha 1984].",
        "More specifically, I assume that discourse is a tree structured entity whose well formedness can be described by a unification based discourse grammar.",
        "Under such a grammar, a discourse constituent is either a discourse relation, a clause or a discourse relation together with one or more discourse constituent(s).",
        "The grammar associates with each constituent a complex category which for the purpose of this paper, I will assume to consist of the six main attributes PHO, CAT, SEM, IN, OUT and RESTR.",
        "PHO, CAT, SEM unsurprisingly denote the phonology, the category and the semantic representation of the constituent described by the complex category.",
        "IN and OUT are attributes which represent the flow of anaphoric information, that is, IN represents the ingoing context (where a context is a sequence of potential antecedents i.e. a sequence of VP categories) and OUT, the outgoing context.",
        "Finally RESTR is short for restriction and takes as value a constraint which must evaluate to true for the category to be well-formed.",
        "Conventions: In what follows I will omit any information that is not relevant to the purpose of the discussion.",
        "In particular, I shall omit irrelevant attributes in categories and any anaphoric information not pertaining to VPE (i.e. anaphoric pronominal information is ignored).",
        "Furthermore, the values of IN and OUT attributes (which should be VP categories) will be abbreviated to the SEM values of these categories.",
        "Finally, I will use the term a-clause as an abbreviation for antecedent clause and e-clause, for elliptical clause.",
        "A simple example will illustrate the workings of the discourse grammar with respect to VPE resolution.",
        "Consider the discourse in (4).",
        "(4) (a) Jon [1 likes Mary] (b) and (c) Peter does 01 too.",
        "As indicated by the bracketed letters, this discourse includes three basic discourse constituents: the two clauses (a) and (c) and the discourse connective and.",
        "Consider first the category associated with (a).",
        "Ignoring irrelevant attributes, this category can be represented as follows2:",
        "[SEM like:[j,m] 1 IN _ OUT[like:[m]] With regard to VPE resolution, two points are relevant.",
        "First the IN value is a don't-care-value (symbolized here by the anonymous variable), thus signaling the fact that incoming anaphoric information is irrelevant in the case of non-elliptical clauses.",
        "Second, the OUT value contains the information associated with the sentence main VP thus signalling the fact that non elliptical clauses update the current outgoing context with new information.",
        "Note that anaphoric information concerning VPs is here assumed not to be cumulative, that is the OUT value of D is not \"added\" to the IN value - rather it constitutes the sole output of (a) independent of the preceding context.",
        "The intuition formalised here is that the discourse entity providing the interpretation of an elided VP is not as persistent as an individual discourse entity and thus should remain local to the discourse constituent that introduced it (although in some particular cases such as e.g. parallelism, anaphoric information pertaining to VPs can be percolated by the discourse grammar rules).",
        "For more details on this point, the reader is referred to [Gardent 1991], pages 141-142.",
        "Now consider the category assigned by the discourse grammar to the elliptical clause (c).",
        "Again ignoring irrelevant attributes, this category can be represented as: [SEM R:[p I As] IN [R:As] OUT [R:As] where B. and As are unification variables over relations and arguments respectively.",
        "The important point to note here is that the variables B. and As are shared by the IN value on the one hand, and by the SEM value on the other.",
        "This in effect implements VPE resolution.",
        "To see this, suppose that we have a discourse rule of the following form (AND abbreviates the category for and):"
      ]
    },
    {
      "heading": "Semi SEM Sem2 [SEM In , AND , [ IN Outi IN OUT Outi OUT Out2",
      "text": [
        "and:[Semi,Sem2] In"
      ]
    },
    {
      "heading": "[Outi, Out2]",
      "text": [
        "Application of this rule to the categories of (a), (b) and (c) above will trigger the unification of Out' with [like:[m]] on the one hand, and [R:As] on the other.",
        "Thus [R:As] is unified with [like:[m]] and the semantic representation R:[p I As] of (c) will become like:[p,m], just as required."
      ]
    },
    {
      "heading": "3 Discourse structure and Multiple VPE resolution",
      "text": []
    },
    {
      "heading": "3.1 Some data",
      "text": [
        "The claim this paper makes about multiple VPE resolution is that the same discourse relation must hold between the multiple VP ellipses on the one hand and the multiple antecedents on the other.",
        "The present section has for object to substantiate this claim.",
        "As a first case in point, consider the following example.",
        "I never go swimming because I don't look good in a swimming suit.",
        "(causal)",
        "a. I might if I did.. (causal) b.",
        "If I did, I probably would.",
        "(causal) c. Sarah does and so she does.",
        "(causal) d. ?",
        "I might after I did.",
        "(temporal) e. ?",
        "I might but I did.",
        "(contrast)",
        "Example (5) gives a case of a-clauses which are related by a causal relation.",
        "Several possible continuations are then given, some of them are acceptable, some of them are not.",
        "The relevant observation is that in those cases where the relation holding between e-clauses also is a causal one, the continuation is acceptable; however, in those cases where the relation holding between e-clauses is of a different nature, the continuation is inacceptable.",
        "As a second case in point, consider example (6):",
        "(6) I was thin then and the trousers looked good on me and I should have bought them, (THIN LG) A BT a. but I didn't and now I am not and they wouldn't.",
        "-..BT A (-THIN -,LG) b. but now I am not and they wouldn't and anyway I didn't.",
        "Here the antecedent discourse unit consists of three clauses, the first two can be said to be related by a causal relation (because I was thin, the trousers looked good on me) whereas the third clause is conjoined to the first two.",
        "Again, several possible continuations are given, some of them are acceptable, some of them are not.",
        "This time, the observation is that in the case where no causal relation can be established between the appropriate e-clauses (i.e. when those clauses corresponding to the cause and to the result of the cause are not adjacent), the continuation is unacceptable3.",
        "That is, in the case where an identical relational pattern cannot be established",
        "for e and a-clauses, multiple VPE becomes hard to understand, if not unacceptable.",
        "In what follows, I take these examples to suggest that the same discourse relation must hold between a and e-clauses resepctively.",
        "I characterise this observation in terms of parallelism, make this notion precise and show how it interacts with other grammar components (e.g. syntax and semantic) to determine multiple VPE resolution.",
        "It should be stressed however that the approach can only be as precise as the definition of discourse relations and unfortunately, this notion is notoriously elusive.",
        "Nonetheless the hope is that this paper captures an important intuition about multiple VPE resolution namely, the intuition that parallelism constitutes one of the (many) factors affecting multiple VPE acceptability and interpretation."
      ]
    },
    {
      "heading": "3.2 Formal analysis",
      "text": [
        "Assuming a discourse grammar of the type described in section (2), the claims this paper makes about multiple VPE resolution are (i) that whenever a discourse contains multiple VPEs, the clauses containing the VPEs and those containing the antecedent VPs form two complex discourse constituents which are related together by the relation of parallelism and (ii) that parallelism constrains VPE resolution in that each VPE will resolve to the \"parallel VP\" in the complex discourse constituents formed by the a-clauses.",
        "We now make these claims precise.",
        "First, we define the semantic representation language ,C used by the grammar described in section (2).",
        ",C consists of the wffs described by the following syntax: wff { term, formula, polarity:rel:[wffi yarn] term { variable, constant } formula -+ polarity:predicate:[argi arg„] arg { term, formula } rel -+ constant predicate constant polarity { 1, 0 } The intuition is that G is a quantifier free guage where variables are unification variables and polarity (i.e. absence or presence of negation) is always explicit (that is, non-negated wffs are described as positive i.e. marked with 1).",
        "Thus for instance, the expression 0:and:[0:p, 1:q] is a wff of which one can think of as the more traditional propositional logic formula -,(-pAg).",
        "We call PROP the set of wffs of the form polarity:predicate:[argi argn]4.",
        "Given this language the discourse relation of parallelism is said to hold between two propositions represented by the ,C wffs 40 and 'F (written, parallelism(4), II►)) iff 4> is structurally identical with T. Structural identity is defined as follows: 4 Note that contrary to tradition negated propositions are assumed to be atomic wffs.",
        "Then definition 3 adequately predicts that R1 =OM and R2 = GtM.",
        "That is, the constraint embodied in definition 3 implements the fact that multiple VPE resolution is sensitive to the semantic rather than to the surface-ordering of the antecedents."
      ]
    },
    {
      "heading": "3.3 Implementation",
      "text": [
        "The above analysis can be implemented in the discourse grammar described in section (2) as follows.",
        "The parallelism rule will be: That is, structural identity is identity up to propo- SEM SEMI SEM SEM2 sitional level (where negation is taken to be part of IN IN IN OUTi propositional information).",
        "To give two simple ex OUT OUTi OUT OUT2 amples: RESTR _ RESTR -",
        "To state the constraint regulating multiple VPE resolution, we first define the notion of a yield.",
        "Thus the yield of an .0 wff (I) consists of the sequence of atomic propositions contained in (D. Finally, we state the constraint as follows: Definition 3 (Constraint on multiple VPE resolution) Let 4) be the semantic representation associated with the discourse segment formed by the a-clauses and 4, be that associated with the e-clauses.",
        "Then, if",
        "then for 1 < i < n, Oi ri and ssi = tti.",
        "That is, each elided predicate Oi and argument list tti5 in y(*) resolves to the parallel predicate Pi and argument list ssi in y(4.).",
        "To see how this constraint works, consider example (1).",
        "Suppose that the discourse grammar assigns to the a and the e part of this discourse the following (simplified) semantic representations:",
        "This rule has two effects.",
        "First, it requires that the semantic representations of the constituting discourse constituents be s-identical - this implements the restriction stated in defining parallelism.",
        "Second, it unifies the OUT value of the first discourse constituent with the IN value of the second - this ensures that the antecedents provided by the first (possibly complex) discourse constituent are accessible to any VPEs occuring in the second constituent.",
        "Now consider the rule for the connective unless (where UNLESS abbreviates the category associated with unless):",
        "OUT 0:and:[0:SEM2,0:SEMI] [IN1, IN2] [OUT2, OUT1] Note that the order of the resulting OUT value is",
        "[Out2, Out]] (and not [Outs, Out2] as suggested by the surface ordering).",
        "This reflects the fact that multiple VPE resolution is sensitive to the logical rather than the surface-ordering of its antecedents.",
        "Application of the UNLESS rule to the a-clauses6 (I wouldn't go to Manchester unless I open my mail) in example (1) will yield the category (recall that irrelevant attributes and attribute values are omitted):",
        "Similarly, the e-clauses (I didn't so I didn't) will be assigned the category: ] 1:and:[0:Pi:EilAsd, 0:P2:[ii Asi]i [[Pi: Asi], [P2:As2]] Finally, application of the parallelism rule to these two categories will yield: SEM 1:parallelism:E,Ei] IN 2 OUT 3 where Eand thus,",
        "That is, the uninstantiated variables Pi, P2, As!.",
        "and As2 in 3 have been assigned a value by means of unification in such a way as to implement the restriction on multiple VPE resolution stated in definition 3, and with the result that the semantic representation of the overall discourse is the expected one."
      ]
    },
    {
      "heading": "4 Structural identity and semantic equivalence",
      "text": [
        "The approach proposed above relies on the syntactic notion of structural identity.",
        "However it is a well-known fact that syntactically distinct logical formulae may be semantically equivalent.",
        "For instance, (7) p q --,(p A --,q) V q Now given these logical equivalences, it is unclear how the semantics of natural language discourse should be represented.",
        "Suppose for instance, that we have a discourse of the form If P, Q.",
        "Then there is a choice as to how this discourse should be represented, namely should it be represented as p – + q, -'(p A – ,q) or – .73\\/ q (where p and q represent the semantic content of the discourses P and Q related by i f) ?",
        "Traditionally, it is assumed that such a discourse will translate to what could be called the canonical form i.e p q.",
        "However, the data on multiple ellipses (and the analysis proposed here) suggests that this should not always be the only possibility.",
        "As a case in point, consider example (8).",
        "(8) If he is [i lucky], he has [2 ordered his software from a house that can help].",
        "If he hasn't 02, he isn't 01 and may the gods be with him because he will need it.",
        "Suppose that both a and e-clauses translate to the canonical form, we then have the following semantic representations7: A-clauses: Ax.lucky(x)(i) --+ Ax.buy(x, sw, fhtch)(i) E-clauses: (0 --+ -'22(i) And definition 3 will yield the (wrong) prediction:",
        "So it seems that a given natural language connective should be allowed to be ambiguous between several semantically equivalent but syntactically distinct discourse relations (for instance, if could be assigned all translations given in (7) above).",
        "But if this is so, the question then arises as to how this ambiguity can be resolved.",
        "The claim I want to make is that both the resolution of this ambiguity and the resolution of multiple VP ellipses result from a complex interaction between syntax, semantics and pragmatics.",
        "The following section provides some evidence in support of this claim."
      ]
    },
    {
      "heading": "5 The interaction of parallelism with other levels of linguistic information",
      "text": [
        "So far I have argued that multiple VPE resolution is subject to the discourse constraint that the propositions expressed by e and a-clauses must be related by the discourse relation of parallelism.",
        "I have then shown that due to semantic equivalence, there might be several parallel configurations potentially holding between a and e-clauses.",
        "However the actual data shows little ambiguity: in most cases, the hearer can single out the (unique) intended reading.",
        "In this section, I argue that the discourse constraint of parallelism interacts with other sources of linguistic information to determine this unique reading.",
        "In particular, I argue that syntax, semantics and pragmatics all contribute to solve the ambiguity raised by semantic equivalences between discourse relations.",
        "7To improve readibility, I use here (and in the rest of this section) an informal notation to describe the semantics of discourse.",
        "P, represent the semantics of VPEs where i indicates surface ordering."
      ]
    },
    {
      "heading": "5.1 Syntax",
      "text": [
        "Consider again example (8) where the discourse formed by the e-clauses is of the form If P, Q and the associated semantic representation may be either p q or –I Now look at the syntax of antecedent and elliptical VPs.",
        "The first elliptical VP is the perfective auxiliary has and thus subcategorises for a past participle whereas the second ellipsis consists of copula be and thus selects a predicative phrase.",
        "Correspondingly, the antecedent VPs are (1) a predicative phrase (lucky) and (2) a past participle (ordered his software from a house that can help).",
        "If we assume that VPE acceptability is sensitive to the syntactic information associated with the antecedent, then the above observations explain why the discourse relation holding between a-and e-clauses must be rather than p q.",
        "For in the first case hasn't indeed resolves to a past participle (namely ordered his software from a house that can help) and isn't to a predicative phrase (i.e. lucky); whereas in the second case, the subcategori-sation requirements of the auxiliaries are systematically violated.",
        "Thus if we assume that the (or at least some) syntactic properties of the antecedent VPs are relevant in determining VPE acceptability, then we can account for the fact that despite of the ambiguity introduced by semantic equivalences between discourse relations, there is only one reading for (8) i.e. the reading which is compatible both with the discourse requirement of parallelism between a and e-clauses and with the syntactic constraints betweeen antecedent and elliptical VP.",
        "As already mentioned (cf. section 2), the present discourse grammar makes precisely this assumption since it takes anaphoric information to be sequences of VP categories i.e feature structures containing inter alia syntactic information about admissible antecedent VPs."
      ]
    },
    {
      "heading": "5.2 Semantics",
      "text": [
        "[Sag 1980] argues that VPE is subject to a constraint on semantic representations, which is dubbed the alphabetical variant constraint.",
        "The analysis is convincing in that it accounts for a wide range of facts about VPE and its interaction with other linguistic phenomena such as quantification, extraction, pseudo-clefts, ready constructions and equisentences.",
        "For instance, the alphabetic variant constraint will account for the inacceptability of (9)8: If every boy thinks that Mary is in love with him, the party will be a success.",
        "* If they don't, it won't.",
        "Note that in this case, discourse parallelism does hold between a and e-clauses.",
        "So if discourse parallelism (as defined in this paper) was taken to be the only constraint regulating VPE acceptability, this 'To be compared with the well formed: If every boy brings a bottle, the party will be a success.",
        "If they don't, it won't.",
        "(ill formed) discourse could not be rejected by the grammar.",
        "However, if Sag's constraint is assumed then the ill-formedness of (9) can be accounted for as follows.",
        "Sag's constraint states that VPE is acceptable iff the semantic representation of the antecedent VP (which he assumes to be a lambda abstraction over individuals) is identical up to renaming of bound variables with the semantic representation of the ellipsis and furthermore, all occurences of a free variable occuring both in the representation of the antecedent and of the ellipsis are bound by the same operator.",
        "Given this, the ill-formedness of (9) is explained by the fact that the pronoun him is represented by a variable (say, y) which is free in the semantic representation associated with the antecedent VP (i.e. Az.think(x, love(m, y))) and cannot be bound by the same operator (i.e. the universal quantifier introduced by the subject NP every boy) when occuring in the semantic representation of the elliptical VP (because it occurs outside the scope of every).",
        "Here again, the assumption that the antecedent of a VPE is represented by a monostratal category means that Sag's alphabetic variant constraint can easily be integrated in the present account.",
        "This can be done in two ways.",
        "The first possibility consists in adopting Sag's view and adding a constraint in the category associated with VP ellipsis auxiliaries to the effect that the semantic representation of the antecedent VP and that of the ellided VP must be alphabetic variants of each other.",
        "This has the inconvenience of requiring a global check over the semantic representation of the whole discourse segment containing a and e-clauses, a check which is essentially non compositional in nature.",
        "A second possibility is to adopt a dynamic semantics (i.e. a semantics where meaning is taken to be a relation between contexts and where a context contains information about pronoun denotations).",
        "Under such an assumption, it can be shown that the inacceptability of any discourse violating the alphabetic variant constraint comes out as a failure to interpret this discourse (model theoretic interpretation simply fails) so that the semantic representation of a and e-clauses need not be checked upon.",
        "Such an approach is described in [Gardent 1990] and could easily be integrated in the present framework: it suffices to replace the static semantics whose syntax is described in 3, by the dynamic semantics given in [Gardent 1990]."
      ]
    },
    {
      "heading": "5.3 Pragmatics",
      "text": [
        "Just as syntax and semantics, pragmatics can interact with discourse constraints to determine multiple VPE acceptability.",
        "A particularly clear illustration of this interaction comes from the pragmatics of discourse connectives i.e. words such as but, unless, etc.",
        "Consider for instance the discourse in (10).",
        "9 For more details concerning this point, see [Gardent 1990].",
        "(9)",
        "(10) I gave her some questions to ask you if you rang her.",
        "a. I did but she didn't.",
        "b.",
        "* I did but she did.",
        "Although both continuations can be viewed as parallel to the a-clauses (cf. section 6), only continuation (a) is acceptable.",
        "Continuation (b) is inacceptable because the pragmatics of but (which requires some contrastive relation to hold between the propositions it relates) is violated.",
        "The discourse grammar sketched here does not integrate pragmatic information and thus cannot account for the difference in acceptability between (a) and (b).",
        "Whether it can be extended to do so remains an open question although recent work in pragmatics (such as [Elhadad and McKeown 1990]) suggests that the monostratal, unification based approach to discourse grammar is fully compatible with a comprehensive treatment of the semantics and pragmatics of discourse connectives."
      ]
    },
    {
      "heading": "6 Taking stock",
      "text": [
        "While section (3) argues that multiple VPE resolution is subject to the discourse constraint of parallelism, section (5) shows that it is also sensitive to other linguistic components such as syntax and semantics.",
        "The present section (i) discusses how the resulting overall analysis accounts for the examples given so far, (ii) introduces some additional data and (iii) summarises how the various linguistic modules interact in determining VPE acceptability for the set of cases presented throughout the paper.",
        "We start by examining the examples given so far.",
        "Examples (2) and (5a) are simple cases of discourse parallelism where a and e-clauses translate to the same canonical LF and no extraneous factor blocks resolution so that each VPE resolves to the parallel element in the antecedent discourse constituent.",
        "Example (3) is more intricate and can actually be explained in two different ways.",
        "A first possibility is to assume that I should have bought them and but I didn't form a discourse constituent and, I was really thin and ... the ski-pants looked really good on me and now I'm not and they wouldn't another (the intuition here would be that discourse constituents reflect the temporal structure of discourse, that is, temporally related events must be part of the same discourse constituent).",
        "Under this first hypothesis, we have on the one hand a case of (single) VP ellipsis where but I didn't resolves to I didn't buy them and on the other hand a simple case of parallelism between complex discourse constituents10.",
        "The second possibility is to consider that the three a-clauses form a discourse constituent which is parallel with the discourse constituent formed by the three e-clauses.",
        "In 'Thanks to an anonymous referree for pointing out this possible interpretation.",
        "this case, the semantic representations of a and e-clauses can be symbolised as:",
        "This clearly does not obey parallelism.",
        "In this case, syntax imposes the choice of an equivalent LF (i.e. (02 – + 03) A 01 ).",
        "As in (8), this syntactic constraint stems from the subcategorisation requirement of a VPE auxiliary, namely 'm not which requires a predicative phrase as antecedent.",
        "For completeness, consider now the following additional examples.",
        "(11) I gave her some questions to [i ask you] if you [2 rang her].",
        "I did 02 but she didn't 01.",
        "(12) It was preposterous.",
        "It [1 couldn't possibly work].",
        "There [2 must have been some other precautions].",
        "But there weren't 02 and it did 01.",
        "(13) Xenophobia pestis, like the hard native perennial it is, bourgeons as lordly young Mediterranean male cyclists sail into oncoming traffic with such signorial arrogance that even as we swear and skid, we look round wildly for street signs to see if he [1 's right], and we [2 are wrong] and the one-way system [3 's undergone one of its periodic reversals].",
        "(He isn't 01.",
        "We aren't 02.",
        "It hasn't 03.)",
        "(11) illustrates a case where parallelism constrains the choice of an alternative semantic representation with the result that the a-clauses semantics is represented by a wff of the form -'(p A – .q) rather than the canonical semantic translation for discourses of the form If P, Q i.e. p q.",
        "Example (12) provides one more illustration of the interaction of syntax with discourse in determining multiple VPE resolution whereas example (13) illustrates a simple case of discourse parallelism.",
        "The following table summarises these observations.",
        "The first column (Ex.)",
        "indicates the number of the example being referred to together with a mention of the linguistic module, if any, which forced the choice of an equivalent semantic representation: D stands for Discourse and S for syntax.",
        "The second column (Canonical LF) indicates the \"canonical\" semantic representations (or Logical Forms) of a and e-clauses: a-clauses are represented by capital letter abbreviations which are mnemonic for their propositional content, whereas the semantics of elliptical clauses is represented by 0i where i reflects surface ordering.",
        "Finally, the third column indicates an equivalent semantic representation for both e or a-clauses (or none when this is superfluous).",
        "The intuition is that this column also indicates anaphoric dependencies whereby it indicates for each ellipsis which is the parallel element in the final semantic representation of the a-clauses.",
        "To take an example, consider the discourse in (1).",
        "For this discourse",
        "the table indicates that discourse forces the choice of a non-canonical semantic representation for the a-clauses.",
        "That is, the choice of the non-canonical semantic representation is determined in this case by the discourse requirement that a and e-clauses stand in a parallelism relation.",
        "As a result, each ellipsis will resolve to its parallel element in the equivalent LF (rather than the canonical one) i.e. 01 resolves to OM (i.e. open a big stack of mail) and 02 to GtM (i.e. go to Manchester)."
      ]
    },
    {
      "heading": "7 Problems and further research",
      "text": [
        "A first problem concerns the propagation of anaphoric information throughout the discourse tree.",
        "To see what the problem is, consider the discourse in (14).",
        "(14) Jon won't dance unless Mary does.",
        "In the absence of any additional context, the antecedent of the VPE in the second clause is the VP of the first clause i.e dance.",
        "Now let us examine again the discourse rule for unless sketched in section 3.",
        "For this rule, the distribution of anaphoric information can be pictured as follows: 121 [01, 02] [I,] [01] [12] [02] Note that anaphoric information is only shared between mother and daughters, not between sisters.",
        "This means that the rule sketched in section 3.3 will fail to resolve the VPE in example (14) because in this case, resolution can only obtain if 01 = 12 i.e. if anaphoric information is shared between sisters.",
        "An obvious fix would be to modify the unless rule so that 12 unifies not only with the IN value of the rightmost daughter but also with the OUT value of the leftmost daughter.",
        "The modified rule would then be:",
        "However, although this would solve the problem raised by example (14), it would still fail to account for cases such as (15).",
        "(15) (a) Jon won't [i dance] unless (b) Mary does 01 and (c) Bob won't [2 come] unless (d) Sarah does 02.",
        "Here the problem is that the new unless rule requires the IN value of (d) to unify both with the OUT value of (b) i.e. dance and with the OUT value of (c) i.e. come.",
        "Clearly unification fails and thus example (15), although perfectly well-formed, is rejected by the grammar.",
        "In more general terms, the problem is that anaphoric information can come to be instantiated both in a top-down and in a bottom-up fashion (i.e. through sharing of information between mother and daughter or through sharing of information between sisters)11.",
        "When the two types of information conflict, unification fails and a perfectly well formed discourse may be rejected by the grammar.",
        "In other words, the grammar will undergenerate.",
        "There are several possible solutions to this problem.",
        "A first one would be to privilege one source of information over the other, say by means of priority union.",
        "In this way, one anaphoric flow would overwrite the other.",
        "But apart form the computational problems involved in using such rewrite operations at run time, it is also unclear which information should be privileged.",
        "Thus although in (15), bottom-up (or local) information seems to prevail, example",
        "(16) shows that in some cases, top-down information may be strongest: (16) (a) Jon won't go to Manchester unless (b) he opens his mail and (c) Bob won't go to Paris unless (d) he does.",
        "\"The first type of anaphoric flow is top-down in that anaphoric information on the mother may be required to unify with the anaphoric information of some other node higher up in the discourse tree, whereas the second type is bottom-up because the anaphoric information specified on the sisters may in turn be required to unify with the anaphoric information carried by some other node lower down in the discourse tree.",
        "Here, there is at least one reading where the ellipsis in (d) resolves to the parallel element (b) (i.e. opens his mail) rather than to the immediately preceding VP (i.e. go to Paris).",
        "Furthermore it is easy to find cases where the overall discourse is ambiguous between a \"top-down reading\" and a \"bottomup\" one.",
        "Thus perhaps a better solution would be to always allow both possibilities and to let the various modules of the grammar decide which reading is actually available.",
        "The details and the adequacy of such an approach, I leave here as an open research question.",
        "A second problem concerning the present paper concerns the definition of discourse relations and of equivalence classes over discourse relations.",
        "Here it is perhaps worth stressing that although logical connectives have been used throughout the paper to represent discourse relations, these are definitely not a sufficient means of characterization.",
        "As a simple case in point, consider a natural language discourse of the form P so Q.",
        "In section 3.2, such a discourse is translated as p A q (where p and q represent the propositional content of the natural language discourses P and Q respectively).",
        "Clearly this translation does not exhaust the meaning of the discourse connective so: for instance, the causal link between p and q is not accounted for.",
        "More generally, it is clear that much work remains to be done on the semantics of discourse relations before the present analysis of multiple VPE resolution can be adequately tested.",
        "Finally, a third question involves the interaction of discourse grammar with anaphora resolution in general.",
        "As already mentioned, the resolution of most types of anaphora can be argued to be influenced by discourse structure.",
        "It would be interesting to investigate in how far the various mechanisms developed to express this constraint are compatible.",
        "More specifically, it would be interesting to see whether the discourse grammar sketched in section 2 could be made to account for the complex interaction of VPE with other anaphoric phenomena such as strict/sloppy identity, pronominal and temporal anaphora."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "A model has been proposed of how discourse structure influences multiple VPE resolution.",
        "However, the suggestion is that the analysis generalises to all cases of VPE, that is, that discourse structure is one of the main factors determining VPE resolution in general.",
        "In this sense, the analysis proposed here fits well with one of the mainstream idea in discourse theory, which is that discourse structure constrains anaphora resolution.",
        "It should also be pointed out that this analysis includes a treatment of parallelism similar to that developed in [Asher forthcoming] and is as such likely to be compatible with the treatment of sloppy/strict ambiguity proposed there.",
        "The.model proposed is characterised by two main properties: reversibility and monostratality.",
        "It is reversible because it is characterised in a purely declarative manner.",
        "Note in particular that the definition of structural identity is entirely independent of any notion of processing and is as such strictly declarative.",
        "In practical terms, this means that this model can be used both for analysis and for generation.",
        "Monostratality (i.e the fact that different levels of linguistic information can be stated within a category) is another important aspect of the model in that it allows for different knowledge sources to interact in determining VPE acceptability and resolution.",
        "A typical example of this interaction is involved in the treatment of cases of multiple VPE involving semantically equivalent wffs: in such cases, syntax often interacts with discourse information to determine the correct resolution.",
        "More generally, it can be argued that VPE is a phenomenon which simultaneously involves phonology, syntax, semantics and discourse (cf. [Lappin and McCord 1990], [Gardent 1991]).",
        "The present model allows for such a simultaneous interaction and thus improves on serial models of VPE resolution (i.e. models where the various levels of linguistic information interact in a serial rather than a simultaneous fashion) such as [Webber 1978].",
        "The model described in this paper has been implemented in SICSTUS PROLOG and runs on a SUN 4 computer.",
        "It has been tested in analysis as well as in generation mode.",
        "Acknolwedgements: I would like to thank Martin van den Berg, Patrick Blackburn, Remko Scha and Henk Zeevat for many helpful comments and suggestions."
      ]
    }
  ]
}
