{
  "info": {
    "authors": [
      "Daniele Godard",
      "Jacques Jayez"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E93-1021",
    "title": "Towards a Proper Treatment of Coercion Phenomena",
    "url": "https://aclweb.org/anthology/E93-1021",
    "year": 1993
  },
  "references": [
    "acl-C88-2110",
    "acl-C90-2008",
    "acl-J91-4003",
    "acl-J93-2005",
    "acl-W91-0209"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The interpretation of coercion constructions (to begin a book) has been recently considered as resulting from the operation of type changing.",
        "For instance, a phrase of type o (object) is coerced to a phrase of type e (event) under the influence of the predicate.",
        "We show that this procedure encounters empirical difficulties.",
        "Focussing on the begin/commencer case, we show that the coercion interpretation results both from general semantic processes and properties of the predicate, and we argue that it is best represented at the lexical level.",
        "The solution is formulated in the HPSG formalism, where the lexical description of heads includes a specification of the argument and articulates syntax and semantics.",
        "We propose that the properties attached to the complement remain the same as they are oustside the construction, but that the semantics of the predicate is enriched to include an abstract predicate of which the complement is an argument."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Predicates require that their arguments be of a given type.",
        "However, as is well-known, certain acceptable constructions exhibit a mismatch between the type of the argument, as constructed from a possible paraphrase, and the type that the argument has outside *We are indebted to Anne Abeille, Nicolas Asher, Michel Aurnague, Andree Borillo, Annie Delaveau, Jean Marie Marandin, Jean-Pierre Maurel, Alex Lascarides, Patrick Saint-Dizier, Annie Zaenen and our referees for helpful comments, criticisms and suggestions.",
        "the construction.",
        "This traditional problem has been recently rephrased within type theory, where types (like e for events, p for material objects, ,c for kinds, etc.)",
        "classify the domain of entities (cf. [Bach, 1986; Carlson, 1977; Chierchia, 1984]).",
        "Pustejovsky proposes in particular that the mismatch is solved by the operation of \"type coercion\" (cf.[Pustejovsky, 1991; Pustejovsky and Anick, 1988; Boguraev and Pustejovsky, 1991]).",
        "In essence, it confers to the predicate the ability to change the argument type.",
        "For example, the sequence in (1) is accounted for in the following way:",
        "(1) John began the book.",
        "The predicate associated with begin requires that the argument corresponding to the complement be an event (type e).",
        "Since the type associated with book is different (we will suppose it is \"material object\", p) it is coerced to e. Accordingly, (1) is given an event reading, which, in this case, is associated with two possible interpretations: \"John began to read the book\", and \"John began to write the book\".",
        "This is an interesting way of looking at the phenomenon, and typing certainly plays a crucial role in building a coercion interpretation.",
        "However, the hypothesis of type coercion itself is not supported by linguistic evidence, and is not sufficiently constrained to account for the impossibility of some combinations.",
        "Instead of type change on the argument, we propose an enrichment of the semantics of the predicates which give rise to coercion interpretation.",
        "Predicates may be finitely polymorphic; for instance, begin combines with arguments of type p as well as of type e. The correct interpretation is obtained at the interpretive level, where it results both from general processes and specific semantic properties of the predicate.",
        "When begin has a complement of type",
        "p, the interpretation makes use of a morphism between events and objects ([Krifka, 1992]); this morphism itself is not noted in the grammar, but the result of its being resorted to can be noted, as well as the semantic properties of the item commencer.",
        "Thus, the phenomenon will be correctly expressed at the lexical level.",
        "More precisely, we will use lexical rules in the HPSG format ([Pollard and Sag, 1987; Pollard and Sag, 1993]).",
        "We illustrate the phenomenon in French and focus on the commencer (begin) example, which is a very clear case of a predicate allowing coercion interpretations.",
        "We provide glosses, NOT English translations."
      ]
    },
    {
      "heading": "2 Linguistic evidence",
      "text": []
    },
    {
      "heading": "2.1 Preservation of the original type",
      "text": [
        "Anaphora, relativization, and coordination are three phenomena which involve identity of type.",
        "If the coerced complement had acquired a new type, we would expect it to behave like a phrase with this new type.",
        "But it does not: le livre (the book) in commencer le livre (to begin the book) has properties of phrases of type p, not of type e (the type of entities with temporal constitution).",
        "That the antecedent and the anaphoric NP must belong to the same type ([Milner, 1982]) is exemplified below: an NP of type \"individual\" may not have a type is (the type of kinds) as its antecedent.",
        "(2) Le cheval est herbivore.",
        "II a quatre pattes The horse is herbivorous.",
        "It has four legs (3) Je ne connais pas ce cheval.",
        "11 a du s'echapper d'un haras.",
        "I do not know this horse.",
        "It must have escaped from a stud farm.",
        "(4) * Le cheval est herbivore.",
        "11 a di s'echapper d'un haras.",
        "The horse is herbivorous.",
        "It must have escaped from a stud farm.",
        "Quitter (to leave) takes a complement of type p, not e: quitter la table vs *quitter sa lecture (to leave the table, one's reading).",
        "Yet, the clitic complement of quitter in (5) can have le livre, the coerced complement of commencer, as its antecedent.",
        "(5) Jean a commence son livre a 10 heures et ne l'a pas quitte de la nuit.",
        "John began his book at ten and did not leave it all night.",
        "Conversely, the complement of arreter is of type e, not p: arreter de lire, arreter sa lecture vs *arreter un livre (to stop reading, one's reading, a book).",
        "It usually takes a null complement anaphora, which can refer to an event complement; it cannot refer to le livre as complement of commencer.",
        "(6) Jean a commence sa lecture a 10 heures et n'a pas arrite de la nuit.",
        "John started his reading at ten and did not stop all night.",
        "pas arrete de la nuit.",
        "Similarly, the antecedent of a relative clause and the relativized NP may not belong to different types ([Godard, 1992]).",
        "(8) * Le cheval, qui a du s'echapper d'un haras, est herbivore The horse, which must have escaped from a stud farm, is herbivorous In this structure also, le livre, complement of commencer retains its type and does not acquire type e",
        "(9) Jean a commence la lecture de cc livre, qui dur-era deur heures",
        "John has begun the reading of this book, which will take two hours",
        "(10) Jean a commence un livre qui est enorme John has begun a book which is huge (11) * Jean a commence un livre qui durera deur heures",
        "John has begun a book which will last two hours Finally, it is well-known that conjoined categories are of the same type: the violation of this requirement can give rise to the rhetorical zeugma (dit-il en liii-meme et en anglais, he said, speaking to himself and in English).",
        "Conjunction of a coerced complement with an NP which has the type expected from the predicate is certainly very strange, if the speaker does not want to produce some stylistic effect.",
        "(12) ??",
        "L yie dernier j'ai commence mon dernier roman et la renovation de la maison.",
        "Last summer I began my last novel and the refurbishing of the house Conversely, the complement of manger (to eat) is of type p; yet, manger can share its complement with commencer.",
        "(13) Jean a commence et finalement mange le saumon",
        "John has begun, and finally eaten the salmon"
      ]
    },
    {
      "heading": "2.2 Asymmetry between subjects and objects",
      "text": [
        "If coercion means type change operated by a predicate on its arguments, it is difficult to see why it does not apply to subjects in the same way as it does to complements, with identical or closely related predicates.",
        "Commencer, as an intransitive verb related to transitive commencer, combines with subjects of type e; thus, we would expect it to combine with coerced subjects having a different original type, but this is not the case.",
        "(14) La conference a commence a 10 heures.",
        "The lecture began at ten (15) * Le livre a commence la semaine derniere.",
        "The book began last week As examples of predicates which coerce their subject arguments, [Pustejovsky, 1991] offers psychological",
        "predicates such as frighten, upset, please, etc.",
        "But in fact there is little evidence of coercion sentences such as (16).",
        "(16) Mary bores me This class of verbs seems rather not to constrain the types of the subject: even if paraphrases are taken to be correct indications as to type, they cannot be used to show that the subject of bores in (16) is coerced to an event, since we have a series of acceptable paraphrases for the subject like \"her face, her chatter\", as well as \"listening to her, that she stays here\", etc.",
        "Confirmation that psychological predicates are polymorphic as regards their cause argument is given by the following coordination (cf. [Copestake and Bri-scoe, 1991]):",
        "(17) John ate and enjoyed the salmon",
        "If eat selects a p complement and enjoy coerces a p complement to an e, then it is difficult to see how they can share the same complement.",
        "The problem disappears if enjoy is dimorphic, and the type of salmon is p."
      ]
    },
    {
      "heading": "2.3 Interpretation is not type changing",
      "text": [
        "The interpretive process which fills in information in such cases as commencer le livre does not ENTAIL a type change.",
        "This is shown by well–known examples invoked by proponents of coercion, such as a long book.",
        "While we agree that one reading for this NP is \"a book which it takes a long time to read\" (see [Briscoe et al., 1990]), it is clear that it is not associated with a phrase coerced to an event.",
        "Acheter does not allow a complement of type e, while combining easily with the above NP.",
        "(18) * Jean a achete une séance de cinema.",
        "John bought a movie performance (19) Jean a achete un long roman"
      ]
    },
    {
      "heading": "John bought a long novel",
      "text": [
        "In the same way, the fact that the salmon in (17) is of type p does not prevent the construction of the interpretation \"John ate the salmon and enjoyed eating it\".",
        "Thus, one must find an account of the interpretive phenomenon illustrated in (1) which does not appeal to type change."
      ]
    },
    {
      "heading": "3 Properties of the phenomenon",
      "text": [
        "There are three main properties which point towards the desirability of a lexical treatment.",
        "(i) The phenomenon is lexically driven rather than a general process; (ii) for each lexical item, it is possible to express general constraints on interpretation; (iii) the properties of the coerced complement which play a crucial role in the acceptability of the construction or on its range of interpretation are selected by the predicate.",
        "The complement of commencer must be (i) \"bounded\" and (ii) intentionally controlled."
      ]
    },
    {
      "heading": "3.1 Coercion is lexically driven",
      "text": [
        "The notion of coercion owes much of its attractiveness to its potential generality: having a separate general set of rules able to generate a set of acceptable interpretations would significantly alleviate the task of storing and handling semantic information.",
        "This program, at least in this strong form, encounters empirical difficulties.",
        "For instance, it is not the case that the class of aspectual verbs which subcate-gorize for an NP of type e behaves uniformly.",
        "Commencer, finir, se mettre a allow for coercion, but not cesser or arreter.",
        "(20) Jean a arret6 sa lecture/* son livre John stopped his reading/ his book Similarly, the temporal prepositions avant, apres, depuis may coerce their complement, but not pendant.",
        "(21) Apres trois martinis, Jean se sentait Bien After three martinis John was feeling well (22) * Pendant son martini, Jean a apergu Marie"
      ]
    },
    {
      "heading": "During his martini John saw Mary",
      "text": [
        "As we have seen, the adjective long in a long novel may be interpreted as modifying a reading event, but the adjective intermittent does not apply to novel.",
        "(23) Jean a commence un livre long/* un livre intermittent."
      ]
    },
    {
      "heading": "John has begun a long/intermittent book 3.2 Lexical information and paraphrase",
      "text": [
        "A VP like commencer la salle de bains (to begin the bathroom) can be understood as meaning, for example, \"to begin to build/to paint/to refurbish/to clean the bathroom\".",
        "However, this does not imply that such paraphrases should be present in the description of the V or the VP.",
        "It is clear that the events denoted by these paraphrases share a feature: they are all events of modification of the p complement, of which they constitute a specification; it is this common interpretation which is part of the semantic content of the lexical item commencer.",
        "Thus, the relevant distinction here is between abstract constraints, which are part of the semantic content, and paraphrases which exploit these constraints by checking their consistency with additional information.",
        "An abstract constraint for commencer, when it combines with an argument of type p, is that the reconstructed event should be some kind of modification.",
        "The question whether the additional information, from which the more specific paraphrase is constructed in a given linguistic and situational environment, is purely lexical, depends on world knowledge, or has some intermediate status, is philosophically and computationally important, but is not relevant to the coercion problem.",
        "One could perfectly use the gualia structure proposed by Pustejovsky ([1991]) and consider accordingly that bathroom is equipped with a set of roles such as constitutive or formal roles,",
        "which help to retrieve such verbs as paint, for instance, as far as they are consistent with the general constraint.",
        "3.3 Constraints on the NP complement of commencer"
      ]
    },
    {
      "heading": "3.3.1 Boundedness",
      "text": [
        "The very possibility of a coercion construction depends on the compatibility between semantic properties of the predicate and of the complement.",
        "Looking more precisely at the case of commencer, we observe the following requirements on the complement: the complement must refer to a \"bounded\" entity as opposed to an \"amorphous\" one.",
        "The data are the following.",
        "The complement of commencer is either an infinitival VP or an NP denoting an event or an object.",
        "In the latter case, partitives (with mass nouns) or indefinite plurals (with count nouns) are not allowed 1.",
        "Although it appears that NPs which denote an event function in the same way as NPs which denote objects, we will leave the event case aside because of its complexity.",
        "(24) Jean a commence le fromage/*du fromage John has begun the cheese/(of the) cheese (25) Jean a commence an livre/?",
        "?des livres cet iti John has begun a book/(of the) books this summer",
        "To account for (24)–(25), we propose that the partitive complement has the property of being amorphous, while the complement of commencer must be bounded.",
        "We define this predicate using Krifka's approach ([Krifka, 1992]) to the aspectual predicate telic/atelic, whose relevance to linguistic phenomena has been stressed by Vendler ([Vendler, 1967]).",
        "Intuitively, the idea is the following.",
        "All events have a terminal point, but telic events (as well as objects denoted by count constructions) have a set terminal point, while atelic events (and objects denoted by mass constructions) lack a set terminal point.",
        "To this distinction, we add a new distinction between bounded entities, which have a terminal point, and amorphous entities, which do not.",
        "Krifka defines telic/atelic as a predicate of predicates; the latter have objects as well as events in their domains, and, linguistically, they are nominal as well as verbal predicates.",
        "In the same way we define amorphous/bounded as a predicate of predicates whose domain comprises events as well as objects.",
        "But we will not assume that nominal and verbal predicates behave in a totally parallel fashion.",
        "Let us first summarize Krifka's model and his definition of atelicity or strict cumulativity (str.",
        "cum. )",
        "and telicity or quantization (qua).",
        "Let P be a predicate defined on X, a complete join semi–lattice without a bottom element, where X can be the domain of events (E), or objects 0.",
        "The po C of the lattice is viewed as a \"part–of\" relation.",
        "P is cumulative (wrt X) if P holds for x U y whenever P holds for x and y in X.",
        "A predicate is singular on X iff it holds for exactly one element of X.",
        "A predicate is str.",
        "cum.",
        "when it is cumulative and not singular.",
        "A predicate is qua.",
        "iff, when it applies to x E X, it does not apply to any proper part of x.",
        "Let T be the domain of times, and r an homomorphism E T preserving U.",
        "The notion of terminal point of an event ( TP) is defined by: Ve, t(TP(e) = t (t E TA t C r(e) A W(t' C r(e) t' < t))).",
        "A predicate has a set terminal point iff, for any event e to which it applies, any subevent of e to which it applies has the same terminal point as e. Note that all events have a terminal point (given by r), but only a subclass of predicates, telic or qua.",
        "predicates, impose a set terminal point to the events they denote.",
        "Str.",
        "cum.",
        "predicates which apply to at least two different events with different terminal points have no set terminal point.",
        "On the other hand, qua.",
        "predicates have a set terminal point.",
        "Assuming that verbal predicates like eat and nominal predicates like bread are (strictly) cumulative, Krifka shows that constructions like to eat bread are (strictly) cumulative.",
        "On the other hand, constructions such as to eat the bread, which use the qua.",
        "nominal predicate the .bread, are demonstrably quantized.",
        "Such an approach accounts for well–known contrasts like to eat bread for ten minutes/* in ten minutes vs to eat the bread * for ten minutes/in ten minutes.",
        "Although str.",
        "cum.",
        "characterizes French partitives and indefinite plurals, it appears that another distinction is needed when one takes the full range of the complements of commencer into account.",
        "Such NPs correspond to str.",
        "cum.",
        "predicates, since when they apply to two objects or groups of objects they apply to their join.",
        "Thus predicates such as manger du pain, ecrire des livres are str.",
        "cum.",
        ", while manger le pain and ecrire un livre are qua.",
        ".",
        "The contrast observed in English translates directly into French (cf. [Borillo, 1989]): manger du pain pendant dix minutes/* en dix minutes, ecrire des livres pendant plusieurs annees/* en plusieurs annees vs manger le pain * pendant dix minutes/en dix minutes, ecrire un livre ??",
        "pendant une semaine2 /en une semaine.",
        "Nevertheless, it would be wrong to use Krifka's distinction to account for (24)–(25): commencer takes VP complements which can be either str.",
        "cum.",
        "or qua.",
        "(26) Jean a commence a manger du pain/le pain",
        "Thus, there is nothing in the meaning of commencer which prevents its combining with str.",
        "cum.",
        "complements.",
        "We introduce an aspectual predicate labelled \"amorphous\" (vs bounded).",
        "Amorphous entails str.",
        "cum.",
        "; bounded predicates may be either str.",
        "cum.",
        "or qua.",
        "'Further investigation is necessary for generic NPs 2We exclude here the partitive interpretation \"to write which exhibit restrictions some part of a book\"."
      ]
    },
    {
      "heading": "AMORPHOUS I BOUNDED",
      "text": [
        "STRICT.",
        "CUM.",
        "I QUANTIZED Intuitively, an event or an object are amorphous when they have no temporal or spatial bounds, and in particular no initial or terminal point.",
        "Although amorphousness applies to both events and objects, we need two different definitions.",
        "The intrinsic ordering relation (C or \"part–of\") on the event domain E is one–dimensional, so that the mapping to the temporal linear order is straightforward.",
        "For objects (most notably spatial objects) we must allow for an indefinite number of dimensions.",
        "Bounded events do not satisfy AMORPHOUS and belong to the domain of the function TP.",
        "The constraint for events is as follows: AMORPHOUS(P) Ve(P(e) –,3t(t C r(e) A ((Vt1(t` C r(e) t < t')) V ((kie(t' C r(e) t' < t))))) For a single object x, there are usually several ways of \"moving through\" x, along different paths.",
        "For a given path p the proper parts of x can be mutually localized wrt a linear order <p. This gives us a new constraint for AMORPHOUS when P is applied to objects:",
        "Linguistically, the predicate AMORPHOUS is associated with partitive and indefinite plural determiners.",
        "It is interesting to note that such NPs have a characteristic property: they may not occur as the subjects of predication 3.",
        "(27) * Du pain est toujours bona manger (Of the) bread is always good to eat (28) ??",
        "Des livres sont toujours utiles (Of the) books are always useful (29) ??",
        "Du pain m'a recotzforte (Of the) bread cheered me up (30) ??",
        "Des livres m'ont beaucoup aide (Of the) books were of great help to me",
        "If there is no equivalent operator on verbal predicates, it follows that they cannot be amorphous.",
        "If additional evidence confirms this line of reasoning, it suggests that, in spite of strong aspectual similarities between verbal and nominal predicates (e.g. [Bach, 1986; Krifka, 1992]), some important distinction(s) must be made.",
        "It is easy to see now why the meaning of commencer requires that the complement be bounded.",
        "As a function on events, commencer returns the initial part of its argument (or is undefined): we will associate to commencer the function f irst_part_o f = Ae(I P(e)), IP being the initial point of the event e. As a function on objects4, first_part_of returns the initial",
        "use of commencer as \"be the first part of\", to which we return in the last section.",
        "part of any event which is associated with the object by the interpretive procedure described in section 4.",
        "This procedure exploits the fact that there is a morphism between parts of objects and parts of time, as noted in [Krifka, 1992].",
        "It requires that the beginning of the event correspond to the \"initial\" part with respect to some order, usually spatial.",
        "Since amorphous objects have no initial part the procedure fails, even if a plausible event has been found (e.g. manger for commencer du fromage).",
        "For each object x, we must have an event e and a path p in x such that the models (0x, <p) and (Te, <), where Ox and T. are the restrictions of 0 and T to x and e, are isomorphic.",
        "Then (by basic model theory) they are elementarily equivalent, and e satisfies AMORPHOUS, which means that e has not initial point and that first_part_of is undefined for e. It follows that commencer cannot apply to amorphous predicates, which lack any initial part."
      ]
    },
    {
      "heading": "3.3.2 Intentional control",
      "text": [
        "The second constraint on the complement of commencer in its coercion use is interpretive: the reconstructed event is an event in which the object denoted by the NP is controlled by the entity denoted by the subject of commencer.",
        "This results from two factors: (i) the subject of commencer retains the interpretation which it has when the complement is an NP of type e, and (ii) there is nothing to construct the event from, except the NP of type o itself.",
        "The controller of an event is the entity which triggers and causally maintains it (for a general analysis of control, causality and related notions see [Brennen-stuhl, 1982; Croft, 1991]).",
        "When the complement NP denotes an event, the subject is an intentional controller of the event, as the following observations indicate.",
        "First, this NP must denote an event, that is, an entity which allows for a controller: nominals denoting psychological states and properties are excluded'",
        "(31) * Ace moment Jean a commence un grand mepris pour les politicien",
        "At that moment John began a great contempt for politicians (32) * Jean a commence une honnéteti remarquable John has begun a remarkable honesty Second, it is not enough that the subject denote the initiator of the event, who simply triggers it, or the inanimate cause.",
        "It must be a full–fledged intentional controller.",
        "Thus (33) is not acceptable, since the referee signals the beginning of a match, even has the power to stop it, but does not control its development 5 There is a restricted class of complements, denoting common diseases as in commencer une grippe, un rhume, with which the subject is not interpreted as a controller.",
        "This seems to be a marginal use which we leave aside here.",
        "(33) ??",
        "L 'arbitre a commence le match a 14 heures The referee began the match at 14 h (34) Les eguipes ont commence le match a 14 heures.",
        "The teams began the match at 14 h Similarly, (35) is odd, although the acid is considered as the cause of the event.",
        "(35) * L'acide a commence la destruction du marbre The acid has begun the destruction of the marble Furthermore, it is not enough that the subject be the controller of some process related with the main event.",
        "For instance, commencer la conference (to begin the lecture) may not be understood as \"to begin to listen to the lecture\", it means \"to begin to deliver the lecture\": listening to a lecture is an activity, of which the agent may be said to be the controller, but it does not causally impinge on the process of lecturing itself.",
        "It should be noted that these restrictions do NOT characterize commencer when it takes a verbal complement.",
        "The subject does not have to be an intentional controller, and may even be non–referential as in l'acide a commence a atta-quer (corrode) le marbre or it a commence ci pleuvoir (it began to rain).",
        "Turning now to the coercion interpretation, we see that it is necessary, but not sufficient, to say that the subject is interpreted as the controller of some event in which the object is involved.",
        "For instance, the two following interpretations are excluded: (i) the interpretation in which the object undergoes a change of position under the action of the controller: commencer la pierre, la voiture (the stone, car) may not mean \"to begin to move the stone, to drive the car\".",
        "Yet, moving an object and driving a car are causal processes, causally controlled by human beings.",
        "(ii) The interpretation in which the subject changes its position along a path denoted by the complement; in Dowty's terms ([Dowty, 1991]), the complement cannot be an \"incremental path\": commencer le tunnel, le desert de Gobi (the tunnel, the desert of Gobi) do not mean \"to begin to go through the tunnel, the desert of Gobi\".",
        "Thus, it would be a mistake to simply state that the reconstructed event is any event associated with the object (as in the qualia structure for instance), even adding the condition that the subject of commencer must be a controller.",
        "The complement does not get a default interpretation either.",
        "In this case one would expect the patient interpretation, given that the subject is a controller, which is a strong form of agentivity.",
        "But the interpretations in (i) and (ii) are instances of what Dowty calls the \"protopatient\" interpretation.",
        "The requirement is stronger: not only must the subject be a controller of the event, it must control the object itself.",
        "Driving a car, rolling a stone, going through a tunnel, or crossing a desert do not affect the object in any significant way.",
        "In fact this requirement follows directly from the semantics of commencer and the only information which is available, that is, the type of the object.",
        "The subject may be a controller in an event thoroughly constructed from an NP of type o only if it controls the object.",
        "When this obtains, the event is in most cases a modification of the object.",
        "The object comes into being (commencer une maison = \"to begin to build a house\"), is consumed (commencer le vin = \"to begin to drink the wine\"), or undergoes a definite change of state (commencer la salle de bains = \"to begin to paint/clean the bathroom\").",
        "In other words, we accept that the information associated with the lexical items in the qualia structure helps to specify the interpretation in a given context, as mentionned above, but it does not contribute to the semantics of the construction itself.",
        "The only information which contributes to the semantics is borne by the lexical iten commencer: (i) commencer is a \"function\" which applies to an event and returns its initial part, (ii) the subject of commencer with an NP complement is the controller of the event, (iii) the event is denoted by the complement e or constructed by isomorphism from the complement o.",
        "However, there is a class of objects which seem to raise difficulties.",
        "We have considered material objects; there are also objects which me may call informational, and which occur as complements of commencer.",
        "At first sight, their interpretation does not involve a modification.",
        "Such are a book, a list, a story, a student's paper, a magazine, a listing, etc.",
        "Consider (1) again.",
        "As noted in [Pustejovsky, 1991] commencer le livre/to begin the book does not only mean \"to begin to write the book\" but also \"to begin to read the book\", an activity which is not immediately seen as an event of modification of the book.",
        "This example contrasts with commencer une symphonie/to begin a symphony which may mean \"to begin to compose/perform a sym-phony\" , not to \"to begin to listen to a symphony\".",
        "The problem is the following: why does the book allow the interpretation \"to read\" while the symphony does not allow the interpretation \"to listen\"?",
        "We propose that in fact \"to read a book\" is a modification of the book while \"to listen to a symphony\" is not a modification of the symphony: there is no parallelism between reading and listening.",
        "Reading is a process by which the reader interprets an organized sequence of signs, thus adding to the material object a new informational layer.",
        "This layer does not exist independently of the reading operation, which is totally controlled by the reader.",
        "On the other hand, listening does not modify the music: musical sounds are not signs, they are stimuli, i.e. they provoke reactions but are not systematically associated with information according to some definite set of rules (at least in our culture).",
        "The difference between material modification and informational modification is that in the first case the result is objectivized, while it is internal in the latter."
      ]
    },
    {
      "heading": "4 Lexical descriptions",
      "text": [
        "Our treatment is twofold.",
        "On one hand, we propose lexical descriptions in accordance with the preceding analysis, which do not use type change and contain an abstract pattern, allowing for coercion interpretation.",
        "On the other hand, we must make sure that our approach meets basic requirements of computational tasks.",
        "Coercion phenomena can raise problems for understanding or generation systems, since they need to interpolate predicates to issue correct interpretations or syntactic forms ([Gerstl, 1992]).",
        "An understanding system should be able to interpret a sentence like Jean prit ses pinceaux et comment: la porte (John took his paint – brushes and began the door) as \"John took his brushes and began to paint the door\".",
        "Similarly, a generation system should be able to contract commencer a lire le livre into commencer le livre.",
        "We will briefly address here the problem of matching potential paraphrases with a phrase of form commencer + NP.",
        "For instance, a sound system should accept to match commencer la porte and commencer a peindre la porte (to paint the door), while it should forbid the pairing of commencer le telephone with commencer a utiliser le telephone (to begin to use the telephone).",
        "Our pairing system will use the type constraints present in the descriptions of the lexical items which allow for coercion interpretation, and supposes that the candidate verbs are already there.",
        "A more ambitious system would start from a phrase commencer+ NP and retrieve all the candidate verbs (e.g. the candidate phrase peindre from the phrase commencer la porte)."
      ]
    },
    {
      "heading": "4.1 The lexical description of commencer",
      "text": [
        "Using HPSG – style feature structures, we propose the two following descriptions of commencer with a nominal complement: commencerl",
        "The type of IPise – ■eAo--.o.",
        "The function d) is Asay : y = I P(x) A y = [3) In this structure the atomic arguments of relations are typed (sorted).",
        "Let EAT be an alphabet of atomic types and E be the set of boolean or functional (--0) combinations of elements of EAT; we use x j a, where a E E to say that any value of x must be of type a (other notations would use x°).",
        "We will suppose that we have at our disposal a boolean lattice (E, <) on E. As shown in section 3.3, commencer with a coerced interpretation is the same lexical item as commencer with a complement NP of type e. There are four possible patterns for a form [NP commencer NP], the first three of which realize the same lexical item commencerl.",
        "pattern 1: Jean commence la conference (lecture) pattern2: Jean commence la chambre (room) pattern3: Jean commence le livre (book) pattern4: Ce mot (word) commence la phrase ( sentence) or son numb.° (performance) commence le spectacle (show)",
        "Each pattern exhibits dependencies between the types of its elements.",
        "The type hierarchy is as follows (T denotes the top of the lattice):",
        "The hierarchy obeys the constraint – ,(e A o) = – (material A human) = A human) = T. bounded is short for -amorphous.",
        "Here modify is intended to mean any sort of internal and durable change affecting the object (thus redecorating and refurbishing a house are modifications, but not hanging up a picture or moving a heavy piece of furniture).",
        "Sequential accounts for the contrast between commencer un livre (book) vs *commencer un plan (map) in pattern 3 (it may mean \"to begin to draw a map\" not \"to read a map\").",
        "It should be noted that we do not equate the meaning of commencer with the function first_part_of (AxIP(x)), which is in fact only an element of it.",
        "The notion of type change relies partly on a more direct association between a lexical item and a typed function.",
        "Instead of changing the argument type,",
        "we enrich the semantic structure associated with the predicate itself.",
        "This solution is in the same spirit as that proposed by [Pollard and Sag, 1993] to treat a similar problem concerning the control interpretation in infinitival complement sentences.",
        "Pattern 4 is an instance of commencer2.",
        "As in the preceding case, the meaning of commencer is a complex structure, but the value of ARG2 is not itself complex, and the type of ARG1 subsumes the type of ARG2.",
        "This is necessary since the value of the function first_part_of is identified with the value of ARG 1."
      ]
    },
    {
      "heading": "4.2 The matching procedure",
      "text": [
        "The input to the procedure is a pair (H1, H2) where H1 is the value of ARG2 in commencerl and H2 is a",
        "corresponding to the semantic part of a full lexical description for a a verb.The procedure succeeds only if the values of RELN, ARG1', ARG2' for H1 and those of RELN, ARG1, ARG2 for H2 unify respectively for some given pattern.",
        "Consider the H2 for peindre.",
        "[RELN peindre I (modify A intentional) ARG 1 x 1 human ARG2 y I (material A bounded) In this case, since human < animate, the unification succeeds for pattern 2.",
        "It would fail in the case of diplacer ( move) which has a RELN slot deplacer I (control A intentional A -,modi f y).",
        "One cannot reasonably suppose that we have lexicons containing the right information at our disposal.",
        "The importance of enriching the semantic structure for exploiting on-line information has been rightly emphasized in [Anick and Bergler, 1991] and [Pustejovsky et al., 1992].",
        "Unfortunately, it seems difficult to exactly parallel the techniques decribed there, because they have been devised mainly for nouns and adjectives.",
        "Consider the entry chambre (room) in a medium size French dictionary ([RM, 1987]): for the current meaning corresponding to bedroom, the definition is piece oil l'on couche (a room where one sleeps).",
        "The entry for ranger (to tidy) mentions ranger sa chambre as an illustration of the meaning mettre/remettre de l'ordre dans un lieu (to put a place in order).",
        "So the verb ranger, which is a good candidate for matching, is available from the dictionary itself.",
        "However, this is only one facet of the information which is necessary to control the matching efficiently: we need to know that ranger has the correct feature modify, to put it in the matchers set, and that chambre is not an info (to avoid to put coucher dans in the matchers set).",
        "Let us suppose that the second problem is resolved simply \"by failure\", i.e. by failing to find any relevant connection with terms which exhibit the info feature.",
        "The first problem would get a satisfying solution if we could put mettre de l'ordre dans un lieu into correspondence with a structure as the following:",
        "This in turn would require that we link mettre de l'ordre (\"put ... in order\") with an action of control over a transition from a state (of disorder) to a new one (order).",
        "The carrier of these states would be the relevant place (a bedroom in our example).",
        "It is not clear how this information could be extracted from standard dictionaries in this case.",
        "Other cases, where classifiers are present in the definition, seem more amenable to general procedures of extraction.",
        "Such difficulties are lucidly acknowledged and commented upon in [Pustejovsky et al., 1992].",
        "Since accessing the needed feature is unrealistic in some cases, a natural question is whether we can resort to other strategies.",
        "We note that the features combinations are few, which allows to list some of the verbs and nouns which exhibit them, and to check whether a given verb is an hyperonym of some member in the list.",
        "A temptative list for commencer is: Verbs = (consommer, ranger, construire, detruire, reparer, lire, interpreter, executer, creer) Nouns = (nourriture, boisson, lute, lieu, appareil, batiment, oeuvre, matiere) Starting from a pair (commencer + NP, V) we may obtain a first rough diagnosis by searching the Verbs and Nouns lists for NP and V, or hyperonyms of them, as indicated in dictionaries like [du Chaz-aud, 1989; Delas and Demon, 1989].",
        "This simple test would capture normal matchings, such as (commencer le charbon (coal), braler (to burn)).",
        "This is because briller is is an hyperonym of consommer (to consume) in [du Chazaud, 1989].",
        "If the procedure is sensitive to simple preferences, it should dismiss deviant pairs as (commencer le charbon (coal), manger (to eat)).",
        "Yet, it would not filter out abnormal candidates as (commencer le charbon (coal), ranger (to tidy)).",
        "There is no preference violation, since it is perfectly possible to put some heap of coal in the right place.",
        "The problems stems from the violation of the semantics for modification mentionned in our previous analysis: moving an object does not count as an internal change.",
        "Thus, it is necessary to capture the relevant features at the level of pairs of elements of Verbs and Nouns.",
        "In this case ranger should be paired with lieu (place).",
        "This agrees with the fact that batiments (buildings), which are hyponyms of",
        "lieu can be tidied up.",
        "We propose the following pairing for the sake of illustration (we do not take it to be the one and true pairing): consommer nourriture, boisson, matiere ranger lieu construire, detruire appareil, lieu repairer, nettoyer lire, interpreter texte executer, crier oeuvre Odd examples like commencer une symphonic, with the \"begin to listen to\" interpretation, will be excluded if symphonic is classified as an hyponym of oeuvre (work).",
        "On the other hand the interpretation \"begin to play\" will be accepted if jouer (to play) is related to executer (to perform).",
        "Thesauri are usually better tools than synonyms dictionaries for checking the existence of such connections.",
        "E.g. [Delos and Demon, 1989] allows the following path: symphonic musique jouer.",
        "Such examples point to the desirability of exploiting existing thesauri.",
        "However, a good deal of restructuring will be necessary to exploit them in a principled way.",
        "This is a general problem which is far beyond the limits of this paper."
      ]
    },
    {
      "heading": "4.3 Apres",
      "text": [
        "Let us briefly consider the interpretation of the nominal complement of apres (after), ignoring cases where this complement is simply an event (this is the standard temporal case), and cases of parallelism, where the NP complement is understood as sharing with an NP in the S the same predicate and the same argument slot wrt this predicates.",
        "(36) Apres le fauteuil, je voudrais acheter des rideaux After the armchair, I would like to buy curtains Coercion is illustrated in (37) and (21), repeated below: (37) Apres ce livre, je me seas fatigue After this book I feel tired (21) Apres trois martinis, Jean se sentait Bien As with commencer, the interpretation of the complement is an event, whose predicate is not to be found in the context.",
        "The predicates which are excluded with commencer are equally impossible or clumsy here.",
        "The NP is not simply understood as a proto-patient:",
        "(38) ??",
        "apres Keith Jarrett, nous irons diner After Keith Jarrett we will go dinner (39) * Apres cafe robe, nous irons a une exposition",
        "After (buying) this dress, we will visit an exhibition But the interpretation is more restricted: modification",
        "(40) * Apres la chambre, to travailleras After (cleaning) the room you will work In fact, the only possible predicates point to bringing an object into existence or to making it disappear.",
        "Furthermore, the connection between the two events is not strictly temporal: succession is not enough to make coercion acceptable: eventl (reconstructed from the NP) must be understood as the cause of event2 (denoted by the S): ??",
        "Apres trois martinis, Jean a apercu Marie After three martinis John saw Mary Note that \"cause\" in some cases is really a form of enablement, a fact hidden by the use of a generic label cause in the next rule.",
        "E.g. in (42), terminating an action (drinking a coffee) makes possible to go out, while there is a pure temporal connection in (43)."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "While it is generally held that natural langage processing can only benefit from taking into account \"non literal\" meaning, i.e. phenomena pertaining to metaphor, metonymy, and coercion, there is no agreement on the best way to attack them.",
        "We have addressed here the problem of coercion, which seems to entail a \"strong\" type shift (from o to e), while metonymy is more properly analyzed as a codified facet shift inside complex structures, and metaphor is generally conceived as based over analogy.",
        "The very nature of coercion phenomena suggests that tasks such as studying types hierarchies and methods for positioning lexical items in these hierarchies are prerequisites for an acceptable treatment.",
        "It is likely that the use of thesauri, and more generally of lexical descriptive tools, will prove helpful.",
        "Our future research is oriented in this direction.",
        "We do not ex",
        "pect to find \"rules\" in a strong sense, that is, fixed procedures that would lend themselves to a simple algorithmic adaptation, but rather complex systems of constraints, whose study should allow to organize the descriptive tools in a more rigorous and principled way."
      ]
    }
  ]
}
