{
  "info": {
    "authors": [
      "Kazunori Muraki",
      "Shinichi Doi",
      "Shinichi Ando"
    ],
    "book": "Message Understanding Conference",
    "id": "acl-M93-1014",
    "title": "NEC: Description of the VENIEX System as Used for MUC-5",
    "url": "https://aclweb.org/anthology/M93-1014",
    "year": 1993
  },
  "references": [
    "acl-E93-1060"
  ],
  "sections": [
    {
      "heading": "INTRODUCTION",
      "text": [
        "NEC Corporation has had years of experience in natural language processing and machine translation[1, 2, 3, 4, 5], and currently markets commercial natural language processing systems.",
        "Utilizing dictionaries and parsing engines we have already had, we have developed the VENIEX System (VENus for Information EXtraztion) as used for MUC-5 in only three months.",
        "Our method is to apply both domain-specific keyword-based analysis and full sentential parsing with general grammar[6, 7].",
        "The keyword dictionary of VENIEX contains about thirty thousand entries, whose semantic structures are sub_ME_Capability frame, and the parsing and discourse processing are controlled with the information given in this semantic structure of keywords.",
        "The resulting scores of VENIEX for formal run • texts were from 0.7181 (minimum) to 0.7548(maximum) in Richness-Normalized Error and 48.33 in F-MEASURES(P&R)."
      ]
    },
    {
      "heading": "SYSTEM ARCHITECTURE",
      "text": [
        "The overall system architecture is shown in Fig. 1.",
        "An input text is divided into sentences and each sentence is processed separately.",
        "ME_Capability frames are extracted from each sentence.",
        "An example of the procedure of information extraction from one sentence by VENIEX is shown in Fig. 2-4.",
        "The characteristic modules of VENIEX are as follows:",
        "• Keyword Dictionary which contains about thirty thousand entries, whose semantic structures are sub_ME_Capability frame, • Parser which generates ME_Capability frames by correlating keywords during full sentential parsing, whose process is controlled with the information in this semantic structure of keywords, • Discourse Processor which combines ME_Capability frames of each sentence.",
        "We call this lexical-information-driven method for parsing and discourse processing \"Lexical-DiscourseParsing\".",
        "This method utilizes the merits of both domain-specific keyword-based analysis and full sentential parsing and discourse processing with general grammar.",
        "It also reduces expenses of general parsing and discourse processing."
      ]
    },
    {
      "heading": "Preprocessor",
      "text": [
        "This module divides an input text into a header and a body of the text, and stores the document number, date and source information from the header for entry into the template.",
        "It also divides the body of the text into sentences, which will be processed separately during morphological analysis and parsing."
      ]
    },
    {
      "heading": "Dictionaries",
      "text": [
        "Our system utilizes two dictionaries, a syntactic dictionary and a keyword dictionary.",
        "Both dictionaries are converted from the machine translation dictionaries we had developed.",
        "The syntactic dictionary contains about ninety thousand entries and the keyword dictionary contains about thirty thousand entries, including the names of corporations, pieces of equipment, devices, place names, etc.",
        "Also, we extracted the names we didn't have in our original dictionaries from the Tipster corpus, and enlarged the keyword dictionary.",
        "We added semantic structures which are sub-ME_Capability frame partial structure of ME_Capability frame to the entries of the keyword dictionary.",
        "Examples of the subframes are shown in Fig. 2.",
        "Fig.2-a) is an example of an Entity sub-frame, which provides slots for a name and a type of an entity.",
        "This subframe can provide other-name-slot whose value is a list of other names of the entity including nicknames and abbreviations, such as \"NEC\" and \" \" of\" B \".",
        "Fig.2-b) is an example of a ME_Capability sub-frame, which provides slots for the process type and detailed information of the process including its type and the equipment used.",
        "The words to which a ME_Capability subframe is added are extracted from technical term dictionaries of microelectronics and the Tipster corpus.",
        "Fig.2-c) is an example of a Relation sub-frame, which is added to words representing the relation between words with an Entity subframe and words with a ME_Capability subframe.",
        "These sorts of words are generally Japanese verbs.",
        "The Relation subframe provides case slots with a case marker Japanese postpositional particles representing grammatical relations.",
        "Each case slot contains a sub-slot representing whether the filler of this case slot is a word with an Entity subframe or a word with a ME_Capability subframe.",
        "If it",
        "• The Japanese verb \" (manufacture)\" has two case slots.",
        "• The filler of the first slot with a subject marker \"e\" is a word with an Entity sub-frame, whose role to a ME_Capability subframe is \"CIZ.",
        "(manufacturer)\".",
        "• The filler of the second slot with an object marker \" \" is a word with a ME_Capability subframe."
      ]
    },
    {
      "heading": "Morphological Analyzer",
      "text": [
        "This module divides input sentences into morphemes and gives every morpheme lexical attributes with a syntactic dictionary and a keyword dictionary.",
        "For example, an input sentence \" CVD Z.",
        "(Nihon – shinkuu – gijutsu manufactures a piece of CVD-equipment.",
        ")\" is divided as shown in Fig. 3, and the semantic structures shown in Fig. 2 are given to morphemes \" EI*X•211459N\", \"CVD RR\" and \" tg \"• If a morpheme is encountered that doesn't exist in the dictionaries, it is marked as an unknown word and its part of speech is estimated from neighboring morphemes.",
        "For example, in a text that contains many nouns, the recognition of unknown words becomes an important function because these words may be important proper nouns.",
        "Numerical values are also tagged with the same kinds of information as words because they often perform as content words, and are often useful for determining sentence structures."
      ]
    },
    {
      "heading": "Local Parser",
      "text": [
        "This module recollects morphemes given by the Morphological Analyzer and produces phrases.",
        "It also combines the ME_Capability subframes given to the words in a phrase, and assigns a new combined ME_Capability subframe to the output phrase.",
        "This module also deduces keywords from particular suffixes and patterns.",
        "For example, the nouns preceding the suffix \" 4± \" or \"4±\" is considered as business entities.",
        "Unknown noun preceding parentheses inserted a place name can be business entities, too."
      ]
    },
    {
      "heading": "Parser",
      "text": [
        "This module recollects phrases produced by Local Parser and outputs parse trees and semantic structures, which are ME_Capability frames.",
        "Its function involves not only parsing but also semantic interpretation, lexical disambiguation and information extraction.",
        "The main body of the analyzer is a unification-based chart parser, and the parsing strategy is bottom-up breadth-first.",
        "The solution with the highest preference score is selected.",
        "Our Local Parser and Discourse Processor are based on the same parsing engine and differ only in parsing rules.",
        "Sharing engines and functions by modules, we can efficiently develop the VENLEX system.",
        "The Parser can handle a wide variety of complex sentences.",
        "It analyzes and generates modifying connections between phrases and the relation between keywords.",
        "It constructs semantic structures which are ME_Capability frames from subframes described in a keyword dictionary by correlating keywords during full sentential parsing, whose process is controlled with the information in the subframes.",
        "For example, as illustrated in Fig. 4, the Parser recognizes the structure of the sentence\" El 21zA'..M4Ptc CVDWRI.kt Z.",
        "\" and constructs a ME_Capability frame from subframes shown in Fig. 2.",
        "This module can also deduce keywords.",
        "If an unknown noun fills a Relation subframe's case slot whose filler must be a word with an Entity sub-frame, this noun can be considered as an entity.",
        "In addition, the Parser recognizes special expressions whose sub_ME_Capability frames are used for discourse processing.",
        "It selects the most important Entity subframe and the ME_Capability sub-frame, and also analyzes the Entity subframe and the ME_Capability subframe represented by anaphoric expressions.",
        "Parser keep these subframes respectively in \"currentEnt\" slot, \"currentME\" slot, \"anaphorEnt\" slot and \"anphorME\" slot.",
        "We will later show examples of these slots with a walkthrough example.",
        "Though it is not illustrated in Fig. 1, VENIEX has another module as a fail-safe system between the Parser and the Discourse Processor.",
        "If the Parser cannot analyze an input sentence and outputs only fragments of ME_Capability frame, this Postparser module recollects and combines the fragments without considering the sentence structure."
      ]
    },
    {
      "heading": "Discourse Processor",
      "text": [
        "This module combines ME_Capability frames generated by the Parser into frames representing content of the whole article.",
        "It recognizes relation among the ME_Capability frames by resolving co-reference for entities and microelectronics.",
        "The co-reference resolution is achieved by unifying \"currentEnt\" with \"anaphorEnt\" and unifying \"currentME\" with \"anphorME\".",
        "VENIEX can resolve co-reference represented by a wide variety of expressions: anaphoric expression (identical and unidentical), cleft sentence, ellipsis, name of Entities, etc[7].",
        "We will later show an example of this process with a walkthrough example as well."
      ]
    },
    {
      "heading": "Template Generator",
      "text": [
        "In VENIEX, the outputs of the Discourse Processor are ME_Capability frames.",
        "In other words, essential information has already been extracted during morphological, syntactic and discourse analysis.",
        "All that remains is to transform the frames and the information of the input article stored by the Preprocessor to the output templates in the official form."
      ]
    },
    {
      "heading": "PROCESSING WALKTHROUGH TEXT Overview",
      "text": [
        "VENIEX has two steps for ME information extraction; 1) extracting ME_Capability frames separately from each sentence, 2) combining the frames above into frames representing content of the whole text.",
        "This method has two tasks in constructing a body of knowledge with small pieces of information contained in more than one sentence.",
        "First, it must construct new information with pieces of partial information scattered in different sentences.",
        "Second, it must identify identical information represented by different expressions.",
        "VENIEX attains these tasks by discourse processing on surface expressions focused on ellipsis, anaphora and so on.",
        "The walkthrough text, however, has discourse problems that can't be solved with that particular surface process.",
        "Therefore VENIEX can't merge the information sufficiently and outputs two ME objects for only one ME object in the text.",
        "Also, VENIEX fails in complement of ellipsis and extracts only one entity for two entities.",
        "As a result, the evaluation of walkthrough text is 66.67 P&R."
      ]
    },
    {
      "heading": "Morphological Analyzer",
      "text": [
        "The Morphological Analyzer divides a sentence into morphemes and assigns corresponding syntactic information to each morpheme using the syntactic dictionary.",
        "At the same time, it assigns some information from the keyword dictionary to morphemes.",
        "Fig.",
        "5 below shows the result of morphological analysis of the 1st sentence of the walkthrough.",
        "The notation \"/\" in Fig. 5 is a delimiter of two morphemes.",
        "A morpheme recognized as a keyword is followed by a corresponding sub_ME_Capability frame, which is a partial structure of ME_Capability frame, loaded from the keyword dictionary.",
        "For example the word \" which means \"manufacturing\", has information that the entity which appears as the subject plays a manufacturer part of the object, the ME_Capability frame.",
        "The word \" *Am* \", which is a company name, has information that the type is company.",
        "The word \" IMMAl C V D YL*(14301411*tt) Rff \", which means \"CVD equipment\", conveys information that the type is layering and that the film is metal, and implies the existence of equipment.",
        "VENIEX gathers the sub_ME_Capability frames and combines them into the ME_Capability frames."
      ]
    },
    {
      "heading": "Local Parser",
      "text": [
        "The Local Parser recognizes a Japanese phrase by utilizing local patterns and the syntactic information given by the Morphological Analyzer.",
        "The Local Parser combines sub_ME_Capability frames in one phrase.",
        "The way of combination differs according to the sort of keywords; \" 4t4 – \" (entity), \" 4 13 a.",
        "P' 11::- AARg \" (microelectronics), \" al*\" (relationship) and so on.",
        "The output of the Morphological Analyzer is shown in Fig. 6."
      ]
    },
    {
      "heading": "/ INIMO",
      "text": [
        "{key -7-f s 1:12: AVM top{ RR RR }11 / / TA, / IMAM C VD (IMMIVIRA-KiA) Rat",
        "In Fig. 6, the entity\" B*A IA* \" acquires the new information by extracting the keyword which shows its location in the identical phrase."
      ]
    },
    {
      "heading": "Parser",
      "text": [
        "The Parser recognizes the syntactic structure of each sentence in the input text.",
        "An ME_Capability frame in a phrase is combined with corresponding ME_Capability frames in other phrases if they have syntactic",
        "relations.",
        "The way to combine the frames depends on the sort of each of the keywords.",
        "The output of the Parser to walkthrough text is shown in Fig. 7.",
        "In Fig. 7, the number following a notation of \"2 is an index.",
        "If two objects have a same index, these objects are the identical.",
        "In the 1st sentence (No.",
        "00), fOr example, manufacture and distribution on the CVD equipment is extracted.",
        "The sentence consists of two simple sentences and the extracted information lies in the 2nd simple sentence.",
        "VENIEX recognizes that these two simple sentences share the nominative case, and combines the ME_Capability frames according to the path of information; {\" H41\" - \" irILtzo \" - {\"tZ Jan\" - \" C V DRE \"}} ({Entity - \"agree\" - {\"manufacture and distribute\" - Equipment}}).",
        "This results in VENIEX extracting the ME_Capability frame, as shown in Fig. 7.",
        "The Parser in VENIEX extracts 5 ME_Capability frames from 4 sentences; the 1st sentence, the 2nd sentence (No.",
        "01), the 6th sentence (No.",
        "05) and the 7th sentence (No.",
        "06).",
        "As for the 6th sentence, VENIEX succeed in extracting 2 ME_Capability frames from the noun phrase, \" B*1M3V9Willlititg • Jan T vl 6 11Cil CVD \", and an entire of sentence.",
        "Meanwhile, the Parser keeps a sub_ME_Capability frame, which appears as an entity or microelectronics in the sentence, respectively in \"entities\" slot and \"currentME\" slot.",
        "Additionally, for an entity (sub_ME_Capability frame), which is the subjective case in the given sentence, the Parser keeps it in \"currentEnt\" slot.",
        "For a sub_ME_Capability frame represented by anaphoric expressions, the Parser also instantiates \"anaphorEnt\" slot or \"anaphorME\"slot.",
        "After anaphora resolution, it puts referred \"currentEnt\" slot or \"currentME\" slot in corresponding \"anaphorEnt\" slot or \"anaphorME\"slot."
      ]
    },
    {
      "heading": "Discourse Processor",
      "text": [
        "The Discourse Processor merges ME_Capability frames the Parser output by utilizing \"entities\" slot, \"currentEnt\" slot, \"currentME\" slot, \"anaphorEnt\" slot and \"anaphorME\" slot.",
        "For example, the 2nd sentence in the walkthrough carries information that the entity \" El *AMON \" distributes some equipment and the equipment which appears in anaphoric expression \" \" refers to the CVD equipment in the 1st sentence.",
        "In processing the 2nd sentence, the Discourse Processor recognizes the expression \" HAN \" as an anaphoric expression and instantiates the \"anaphorME\" while extracting sublVIE_Capa,bility frame (see Fig. 7).",
        "It checks consistency between the \"anaphorME\" slot and the \"currentME\" slot instantiated in processing the previous sentence and identifies these as the same object.",
        "VENIEX makes two mistakes in discourse processing for wa1kthrough text.",
        "One appears in ellipsis processing.",
        "Ellipsis of nominative in the 6th sentence must be resolved for extracting the entity which is the distributor.",
        "The distributor entity must be \"BTU 7 11, /17 \" in the 3rd sentence because it is clear, according to context, that the 2nd paragraph is written about its activities.",
        "But VENIEX selects \"currentEnt\" slot which is the nominative of the 2nd sentence, because it lacks knowledge to process a paragraph or joint venture.",
        "The other mistake is caused by failure in merging ME_Capability frame in the 1st paragraph with one in the 2nd paragraph.",
        "These frames must be identical objects because the topic of the article is a joint venture, and a joint venture distributes often products of parent company.",
        "(We think, however, that the equivalence of the CVD equipment cannot be decided based only on these clues, and it is possible to interpret that this equipment are different.)",
        "VENEEX processes all ME objects separately when there is no specified referential"
      ]
    },
    {
      "heading": "RESULTS AND FUTURE WORK",
      "text": [
        "The resulting scores of VENIEX at formal run were from 0.7476(minimum) to 0.7858(maximum) in Richness-Normalized Error and 47.41 in F-MEASURES(P&R), which are shown in Table 1.",
        "We have improved the system a little after the formal run only by debugging parsing rules, not by adding new rules and/or dictionaries-, and the current scores of VENIEX for formal run texts are from 0.7181(minimum) to 0.7548(maximum) in Richness-Normalized Error and 48.33 in F-MEASURES(P&R), which are shown in Table 2.",
        "The current scores for dry run texts are also shown in Table 3.",
        "Though we have developed the VENIEX System in only three months, there wasn't so much difference in scores with other systems in MUC-5.",
        "But the scores were lower than we had expected.",
        "The main reason is the lowness of recall rate.",
        "We didn't have enough time to collect keywords, especially verbs representing the relations between entities and microelectronics.",
        "We have developed many new functions for the MUG5 system, such as co-reference resolution and keyword deduction.",
        "We have been evaluating these functions separately to judge weather they worked as we designed.",
        "For example, to evaluate the performance of keyword deduction function in the Local Parser and the Parser, we made an information extraction experiment without dictionaries of entities.",
        "The resulting",
        "scores for formal run text are shown in Table 4.",
        "The result says that this function works well.",
        "Through the development of VENIEX system for MUG-5, we have learned that we can realize information extraction system with our natural language processing techniques.",
        "But to improve the system, we must make more detailed evaluation of performance of each function.",
        "One of the biggest theme of future work is automated or semi-automated training of the system.",
        "We plan to develop a bootstrapping method to improve the system with iterating cycles of \"refining system\"\"evaluating the performance\"."
      ]
    }
  ]
}
