{
  "info": {
    "authors": [
      "Rens Bod"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E93-1006",
    "title": "Using an Annotated Corpus as a Stochastic Grammar",
    "url": "https://aclweb.org/anthology/E93-1006",
    "year": 1993
  },
  "references": [
    "acl-C92-2065",
    "acl-C92-2066",
    "acl-C92-3126",
    "acl-H90-1021",
    "acl-H91-1104",
    "acl-P92-1017"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Let us illustrate DOP with an extremely simple example.",
        "Suppose that a corpus consists of only two trees:",
        "This example illustrates that a statistical language model which defines probabilities over parses by taking into account only one 'derivation, does not accommodate all statistical properties of a language corpus.",
        "Instead, we will define the probability of a parse as the sum of the probabilities of all its derivations.",
        "Finally, the probability of a string is equal to the sum of the probabilities of all its parses.",
        "We will show that conventional parsing techniques can be applied to DOP, but that this becomes very inefficient, since the number of derivations of a parse grows exponentially with the length of the input string.",
        "However, we will show that DOP can be parsed in polynomial time by using Monte Carlo techniques.",
        "An important advantage of using a corpus for probability calculation, is that no training of parameters is needed, as is the case for other stochastic grammars (Jelinek et al., 1990; Pereira and Schabes, 1992; Schabes, 1992).",
        "Secondly, since we take into account all derivations of a parse, no relationship that might possibly be of statistical interest is ignored.",
        "The definition correctly includes the trivial case of a subtree from the corpus whose yield is equal to the complete input string.",
        "2.4Derivation A derivation of a parse T with respect to a corpus C, is a tuple of subtrees (4,...,tn) such that 4,...,47 e C and 4 0... cfn = 7'.",
        "The set of derivations of T with respect to C, is thus given by:",
        "The general definition above also includes subtrees consisting of one node.",
        "Since such subtrees do not contribute to the parsing process, we exclude these pathological cases and consider as the set of subtrees the non-trivial ones consisting of more than one node.",
        "We shall use the following notation to indicate that a tree t is a non-trivial subtree of a tree in a corpus C: t e C =def 3 T C: t is a non-trivial subtree of T 2.2Operations In this article we will limit ourselves to the basic operation of substitution.",
        "Other possible operations",
        "Given a subtree tj e C, a function root that yields the root of a tree, and a node labeled X, the conditional probability P(t=ti I root(t)=X) denotes the probability that ti is substituted on X.",
        "If root(ti) X, this probability is 0.",
        "If root(ti) = X, this probability can be estimated as the ratio between the number of occurrences of ti in C and the total number of occurrences of subtrees t' in C for which holds that root(t) = X. Evidently, L P(t=ti I root(t)=X) = 1 holds.",
        "The probability of a derivation (4,...,tn) is equal to the probability that the subtrees ti,...,tn are combined.",
        "This probability can be computed as the product of the",
        "conditional probabilities of the subtreestn.",
        "Let 1n1(x) be the leftmost non-terminal leaf of tree x, then:",
        "The probability of a parse is equal to the probability that any of its derivations occurs.",
        "Since the derivations are mutually exclusive, the probability of a parse T is the sum of the probabilities of all its derivations.",
        "Let Derivations(T,C) =then: P()A P(c1;).",
        "The conditional probability of a parse T given input string s, can be computed as the ratio between the probability of T and the sum of the probabilities of all parses of S.",
        "The probability of a string is equal to the probability that any of its parses occurs.",
        "Since the parses are mutually exclusive, the probability of a string s can be computed as the sum of the probabilities of all its parses.",
        "Let Parses(s,C) = (11,...,;), then: P(s) = Ei PaP.",
        "It can be shown that A P(s;) =1 holds."
      ]
    },
    {
      "heading": "3Superstrong Equivalence",
      "text": [
        "There is an important question as to whether it is possible to create for every DOP-model a strongly equivalent stochastic CFG which also assigns the same probabilities to the parses.",
        "In order to discuss this question, we introduce the notion of superstrong equivalence.",
        "Two stochastic grammars are called supeistrongly equivalent, if they are strongly equivalent (i.e. they generate the same strings with the same trees) and they generate the same probability distribution over the trees.",
        "The question as to whether for every DOP-model there exists a strongly equivalent stochastic CFG, is rather trivial, since every subtree can be decomposed into rewrite rules describing exactly every level of constituent structure of that subtree.",
        "The question as to whether for every DOP-model there exists a supeistrongly equivalent stochastic CFG, can also be answered without too much difficulty.",
        "We shall give a counter-example, showing that there exists a DOPmodel for which there is no superstrongly equivalent stochastic CFG.",
        "The conditional probabilities of the subbees are: P(t=ti / mot(t)=S) = 1/3, P(t=t2 I root(t)=S) = 113, P(&t3 I root(t)=S) = 1/3.",
        "Thus, I P(t=t; troot(t)=S) = 1 holds.",
        "The language generated by this model is {abl .",
        "Let us consider the probabilities of the parses of the strings a and ab.",
        "The parse of string a can be generated by exactly one derivation: by applying subtree t3.",
        "The probability of this parse is hence equal to 1/3.",
        "The parse of ab can be generated by two derivations: by applying subtree t1, or by combining subtrees t2 and t3.",
        "The probability of this parse is equal to the sum of the probabilities of its two derivations, which is equal to P(t=tilroot(tS) P(&t2Zroot(tS) * P(t=t3lroot(t)=S) = 113 + 1/3*1/3 = 4/9.",
        "If we now want to construct a superstrongly equivalent stochastic CFG, it should assign the same probabilities to these parses.",
        "We will show that this is impossible.",
        "A CFG which is strongly equivalent with the DOP-model above, should contain the following rewrite rules.",
        "There may be other rules as well, but they should not modify the language or structures generated by the CFG above.",
        "Thus, the rewrite rule S * A may be",
        "added to the rules, as well as A --> B, whereas the rewrite rule S ab may not be added.",
        "Our problem is now whether we can assign probabilities to these rules such that the probability of the parse of a equals 1/3, and the probability of the parse of ab equals 4/9.",
        "The parse of a can exhaustively be generated by applying rule (2), while the parse of ab can exhaustively be generated by applying rules (1) and (2).",
        "Thus the following should hold:",
        "This implies that P(1)*1/3 = 4/9, thus P(1) = 4/9 * 3 = 4/3.",
        "This means that the probability of rule (1) should be larger than 1, which is not allowed.",
        "Thus, we have proved that not for every DOP-model there exists a superstrongly equivalent stochastic CFG.",
        "In (Bod, 1992b) superstrong equivalence relations between other stochastic grammars are studied."
      ]
    },
    {
      "heading": "4Monte Carlo Parsing",
      "text": [
        "It is easy to show that an input string can be parsed with conventional parsing techniques, by applying subtrees instead of rules to the input string (Bed, 1992a).",
        "Every subtree t can be seen as a production rule root(t) 4 where the non-terminals of the yield of the right hand side constitute the symbols to which new rules/subtrees are applied.",
        "Given a polynomial time parsing algorithm, a derivation of the input string, and hence a parse, can be calculated in polynomial time.",
        "But if we calculate the probability of a parse by exhaustively calculating all its derivations, the time complexity becomes exponential, since the number of derivations of a parse of an input string grows exponentially with the length of the input string.",
        "Nevertheless, by applying Monte Carlo techniques (Hammersley and Handscomb, 1964), we can estimate the probability of a parse and make its error arbitrarily small in polynomial time.",
        "The essence of Monte Carlo is very simple: it estimates a probability distribution of events by taking random samples.",
        "The larger the samples we take, the higher the reliability.",
        "For DOP this means that, instead of exhaustively calculating all parses with all their derivations, we randomly calculate N parses of an input string (by taking random samples from the subtrees that can be substituted on a specific node in the parsing process).",
        "The estimated probability of a certain parse given the input string, is then equal to the number of times that parse occurred normalized with respect to N We can estimate a probability as accurately as we want by choosing Nas large as we want, since according to the Strong Law of Large Numbers the estimated probability converges to the actual probability.",
        "From a classical result of probability theory (Chebyshev's inequality) it follows that the time complexity of achieving a maximum error e is given by 0(e4).",
        "Thus the error of probability estimation can be made arbitrarily small in polynomial time - provided that the parsing algorithm is not worse than polynomial.",
        "Obviously, probable parses of an input string are more likely to be generated than improbable ones.",
        "Thus, in order to estimate the maximum probability parse, it suffices to sample until stability in the top of the parse distribution occurs.",
        "The parse which is generated most often is then the maximum probability parse.",
        "We now show that the probability that a certain parse is generated by Monte Carlo, is exactly the probability of that parse according to the DOP-model.",
        "First, the probability that a subtree t e C is sampled at a certain point in the parsing process (where a non-terminal X is to be substituted) is equal to P( t I root(t) = X).",
        "Secondly, the probability that a certain sequence of subtrees that constitutes a derivation of a parse T, is sampled, is equal to the product of the conditional probabilities of these subtrees.",
        "Finally, the probability that any sequence of subtrees that constitutes a derivation of a certain parse T, is sampled, is equal to the sum of the probabilities that these derivations are sampled.",
        "This is the probability that a certain parse T is sampled, which is equivalent to the probability of T according to the DOP-model.",
        "We shall call a parser which applies this Monte Carlo technique, a Monte Carlo parser.",
        "With respect to the theory of computation, a Monte Carlo parser is a probabilistic algorithm which belongs to the class of Bounded error Probabilistic Polynomial time (BPF) algorithms.",
        "BPP-problems are characterized by the following: it may take exponential time to solve them exactly, but there exists an estimation algorithm with a probability of error that becomes arbitrarily small in polynomial time.",
        "5 Experiments on the ATIS corpus For our experiments we used part-of-speech sequences of spoken-language transcriptions from the Air Travel Information System (ATIS) corpus (Hemphill et al., 1990), with the labeled-bracketings of those sequences in the Penn Treebank (Marcus, 1991).",
        "The 750",
        "The table shows that there is a relatively rapid increase in parsing accuracy when enlarging the maximum depth of the subtrees to 3.",
        "The accuracy keeps increasing, at a slower rate, when the depth is enlarged further.",
        "The highest accuracy is obtained by using all subtrees from the corpus: 72 out of the 75 sentences from the test set are parsed correctly.",
        "In the following figure, parsing accuracy is plotted against the sample size N for three of our experiments: the experiments where the depth of the subtrees is constrained to 2 and 3, and the experiment where the depth is unconstrained.",
        "(The maximum depth in the ATIS corpus is 13.)",
        "Parsing accuracy for the ATIS corpus, with depth 5 2, with depth 5 3 and with unbounded depth.",
        "In (Pereira and Schabes, 1992), 90.36% bracketing accuracy was reported using a stochastic CFG trained on bracketings from the ATIS corpus.",
        "Though we cannot make a direct comparison, our pilot experiment suggests that our model may have better performance than a stochastic CFG.",
        "However, there is still an error rate of 4%.",
        "Although there is no reason to expect 100% accuracy in the absence of any semantic or pragmatic analysis, it seems that the accuracy might be further improved.",
        "Three limitations of the current experiments are worth mentioning, First, the Treebank annotations are not rich enough.",
        "Although the Treebank uses a relatively rich part-ofspeech system (48 terminal symbols), there are only 15 non-terminal symbols.",
        "Especially the internal structure of noun phrases is very poor.",
        "Semantic annotations are completely absent.",
        "Secondly, it could be that subtrees which occur only once in the corpus, give bad estimations of their actual probabilities.",
        "The question as to whether reestimation techniques would further improve the accuracy, must be considered in future research.",
        "Thirdly, it could be that our corpus is not large enough.",
        "This brings us to the question as to how much parsing accuracy depends on the size of the corpus.",
        "For studying this question, we performed additional experiments with different corpus sizes.",
        "Starting with a corpus of only 50 parse trees (randomly chosen from the initial DOP-corpus of 675 trees), we increased its size with intervals of 50.",
        "As our test set, we took the same 75 p-o-s sequences as used in the previous experiments.",
        "In the next figure the parsing accuracy, for sample size N = 100, is plotted against the corpus size, using all corpus subtrees.",
        "25.",
        "Parsing accuracy for the MIS corpus, with unbounded depth.",
        "The figure shows the increase in parsing accuracy.",
        "For a corpus size of 450 trees, the accuracy reaches already 88%.",
        "After this, the growth decreases, but the accuracy is still growing at corpus size 675.",
        "Thus, we would expect a higher accuracy if the corpus is further enlarged."
      ]
    },
    {
      "heading": "6Conclusions and Future Research",
      "text": [
        "We have presented a language model that uses an annotated corpus as a stochastic grammar.",
        "We restricted ourselves to substitution as the only combination operation between corpus subtrees.",
        "A statistical parsing theory was developed, where one parse can be generated by different derivations, and where the probability of a parse is computed as the sum of the probabilities of all its derivations.",
        "It was shown that our model cannot always be described by a stochastic CFG.",
        "It turned out that the maximum probability parse can be estimated as accurately as desired in polynomial time by using Monte Carlo techniques.",
        "The method has been succesfully tested on a set of part-of-speech sequences derived from the ATIS corpus.",
        "It turned out that parsing accuracy improved if larger subtrees were used.",
        "We would like to extend our experiments to larger corpora, like the Wall Street Journal corpus.",
        "This might raise computational problems, since the number of subtrees becomes extremely large.",
        "Furthermore, in order to tackle the problem of data sparseness, the possibility of abstracting from corpus data should be included, but statistical models of abstractions of features and categories are not yet available."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author is very much indebted to Remko Scha for many valuable comments on earlier versions of this paper.",
        "The author is also grateful to Mitch Marcus for supplying the ATIS corpus."
      ]
    }
  ]
}
