{
  "info": {
    "authors": [
      "Chung Hee Hwang",
      "Lenhart K. Schubert"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H93-1027",
    "title": "Interpreting Temporal Adverbials",
    "url": "https://aclweb.org/anthology/H93-1027",
    "year": 1993
  },
  "references": [
    "acl-H90-1008",
    "acl-J88-2002",
    "acl-J88-2003",
    "acl-J88-2005",
    "acl-P85-1008",
    "acl-P92-1030"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We take for granted that sentences describe situations [2, 121.",
        "One of the most important properties of situations are then their temporal locations, which are indicated by tense and aspect and temporal adverbials in the surface form.",
        "In [10, 22], we offered a formal theory for English tense and aspect and an algorithm that computes the temporal relationships between the situations implicitly introduced by a text.",
        "In the present paper, we propose a systematic approach to temporal adverbials, fully integrated with our tense-aspect theory and the interpretive algorithms, using the Episodic Logic (EL) formalism [9, 11, 12, 21]."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Previous theoretical work on temporal adverbials has mostly concentrated on adverbials specifying temporal locations (e.g., \"yesterday\"), durations (e.g., \"for a month\") and time spans (e.g., \"in three hours\").",
        "It appears that interest in the first kind of adverbial originated from the desire to correct the erroneous analyses provided by Priorean tense logics, in particular, their treatment of the interaction between time adverbials and tense.",
        "The second and third kinds of adverbials were often considered in connection with the aspectual classes of the VPs or sentences those adverbials modify (e.g., durative adverbials may modify only stative sentences, whereas adverbials of time span may modify only accomplishment sentences).",
        "However, other kinds of temporal adverbials have received little attention, including ones specifying repetition: The engineer shut down the motor twice yesterday.",
        "The engine frequensly broke down.",
        "The operator checked the level of oil every half hour.",
        "The inspector visits the lab every Monday.",
        "On our analysis, these sentences describe complex events, consisting of a sequence of subevents of specified types, and the given adverbials modify the structure of these complex events: the cardinality of component events (\"twice\"), the frequency or distribution pattern of component events (\"frequently,\" \"regularly,\" \"every half hour,\" etc.",
        "), and the temporal location of cyclic events that occur synchronously with other recurrent time frames or events (\"every Monday\" or \"every time the alarm went off\").",
        "Other issues that deserve further investigation are the interactions between multiple temporal adverbials, and various kinds of aspectual class shift due to aspectual class constraints on the use of adverbials (occurring singly or jointly with others).",
        "The following sentences illustrate these issues.",
        "John ran for half an hour every morning for a month.",
        "John stepped out of his office for fifteen minutes.",
        "Mary is going to Boston for three days.",
        "Mary won the competition for four years."
      ]
    },
    {
      "heading": "John saw Mary twice in two years.",
      "text": [
        "Our aim is to provide a uniform analysis for all kinds of temporal adverbials.",
        "Our approach is compositional in that the lexicon supplies meanings at the word level (or possibly at the morpheme level, e.g., for -ly' adverbs), and the meanings of adverbials are computed from the lexical entries by our GPSG-like grammar rules.",
        "The grammar rules take care of aspectual compatibility of adverbials with the VPs they modify.",
        "The resulting indexical logical form is then \"deindexed\" (converted to an explicit, context-independent form) by a set of recursive rules.",
        "The resultant episodic logical form (ELF) is formally interpretable and lends itself to effective inference.",
        "We now consider the syntax and the semantics of temporal adverbials.",
        "We first show logical form representations of temporal adverbials, in both indexical and deindexed form, and how to obtain them from the surface structure, together with a brief discussion of semantics.",
        "Then, we discuss an extension of our system that accommodates aspectual class shifts to properly handle the interaction between temporal adverbials and aspectual classes."
      ]
    },
    {
      "heading": "2. SYNTAX AND SEMANTICS OF TEMPORAL ADVERBIALS",
      "text": [
        "We first discuss the basic interpretive mechanism, using yesterday as an example, and then generalize to other types of temporal adverbials."
      ]
    },
    {
      "heading": "2.1. The Basic Mechanism",
      "text": [
        "As indicated in the following fragment of a GPSG-like sentence grammar, we treat all adverbial adjuncts as VP-adjuncts at the level of syntax.1 (Aspectual feature agreement is assumed, but not discussed till section 3.)",
        "However, despite this surface syntax, the semantic rule (ADVL' VP'), specifying functional application of the ADVL-translation to the VP-translation, may lead to either predicate modification or sentence modification at the level of immediate logical form.",
        "In particular, manner adverbials (e.g., with",
        "a brush, hastily, etc.)",
        "are uniformly interpreted as predicate modifiers at the level of immediate LF, while temporal (and locative) adverbials are all interpreted as sentence modifiers.",
        "How such sentence-modifier interpretations are formed from VP adjuncts is easily seen from rules such as the following:",
        "(adv-e stands for 'episode-modifying adverbial'.2 More on this later.)",
        "From these rules it is clear that the logical translation of yesterday, as an adverbial adjunct, is XPXx((adv-e (during Yesterday)) [x PD.",
        "In the interpretation of a sentence such as \"Mary left yester-day,\" this A.-abstract would be applied to predicate leave (initially paired with unscoped tense operator past), yielding Xx((adv-e (during Yesterday)) [x <past leave>]), and this in turn would be applied to term Mary (translating the NP Mary), yielding the formula ((adv-e (during Yesterday)) [Mary <past leave>]).",
        "Here, (during Yesterday) is a 1-place predicate (the result of applying the 2-place predicate during to the indexical constant Yesterday, allowable in the \"curried function\" semantics of EL).",
        "adv-e maps this 1-place predicate into a sentence modifier; i.e., (adv-e (during Yesterday)) denotes a function from sentence meanings to sentence meanings.",
        "In the present case, the operand is the sentence [Mary <past leave>], written in the square-bracketed, infixed form that is the preferred sentence syntax in EL.3 The above indexical (context-dependent) logical form is obtained quite directly as a byproduct of parsing, and is subsequently further processed – first, by scoping of ambiguously scoped quantifiers, logical connectives, and tense operators, and then by applying a set of formal deindexing rules, which introduce explicit episodic variables into the LF, and temporally relate these based on tense operators, temporal adverbials, and context structures called tense trees.",
        "These tense trees, described in [10, 22], supply \"orienting relations\" between episodes introduced by different clauses, such as the relation that exists between successively reported events in a narrative.",
        "We should emphasize that our treatment of time adverbials is fully compatible and integrated with the treatment of tense, but we will neglect tense operators and tense trees herein as far as possible.",
        "We do need to mention, though, that tense operators are generally assumed to take wide scope over adverbials in the same clause.",
        "Thus, after scoping, we get",
        "(past ((adv-e (during Yesterday)) [Mary leave])).",
        "Since the deindexing rules \"work their way inward\" on a given indexical LF, starting with the outermost operator, the past tense operator in the sentence under consideration will already have been deindexed when the adv-e construct is encountered.",
        "In fact we will have (3ei: [ei before u1] [((adv-e (during Yesterday)) [Mary leave])T ** el]), where ui denotes the utterance event for the sentence concerned, and T denotes the current tense tree.",
        "Note that we use restricted quantifiers of form (Q a: (13`11), where Q is a quantifier, a is a variable, and restrictioncI3 and matrix are formulas.",
        "At this point the following deindexing rule for adv-e is brought to bear (we omit the second half of the rule, specifying the transformation of the tense tree T; see [9, 11]): For iv a monadic predicate, and (13 a formula, adv-e : ((adv-e iv) (13)T (--) ['mi.",
        "0:13„.T1 This rule essentially splits the formula into a conjunction of two subformulas: one for the adverbial itself, the other for the sentence modified by the adverbial, much as in Dowty's system [4, 5].",
        "To provide an intuitive explanation of how this works, we need to mention the operators '*' and '**', which are central to EL.",
        "Roughly, [0:10 * To means that Cl) is true in episode /I (or, dl) describes ro, and [0:1) ** /I] means that (13, and only cD, is true in episode n (or, Cl) characterizes ii).",
        "(For details, see [9, 11, 12].)",
        "Now the expression ynT on the RHS of the deindexing rule for adv-e is a sentential formula (formed from predicate irT) which can be read as \"inr is true of the current episode (i.e., the one at which yirrr is evaluated).\"",
        "In view of this, the combination"
      ]
    },
    {
      "heading": "WirT A (132C'T] **",
      "text": [
        "is equivalent to Mil Inr] A(13g.T] ** ri].",
        "Note that IrT is now predicated directly of episode 77.",
        "In the example above, we obtain (3e1: [ei before 14] LE[ei during Yesterday] A [Mary leave]] ** and this leaves only YesterdayT to be deindexed to a spe:cific day (that is, (yesterday-rel-to ui)).",
        "To make the semantics of\", '*' and '**' a little more precise, we mention two clauses from the truth-conditional semantics:",
        "1.",
        "For (13 a formula, and a term, [[(1) * rir = 1 only if Actual(I[ij]J, s) and [[(1)][['l]l * 1;",
        "= 0 only if Nonactual apvi,․) or [[0]][h] * 1, where these conditionals become biconditionals (ifs) for s an exhaustive (informationally maximal) situation.",
        "2.",
        "For s E S, and 7r a predicate over situations,",
        "ffyirly = pa\" , i.e., ffir]](s)(s), where $ is the set of possible situations.",
        "Also, a few relevant axioms are (for iv, iv' 1-place predicates, n a term, and it a formula):"
      ]
    },
    {
      "heading": "2.2. Adverbials of Duration, Time-span, and Repetition",
      "text": [
        "Like adverbials of temporal location, durative adverbials are also translated as (adv-e it).",
        "For instance, \"John slept for two hours\" becomes (with tense neglected) ((adv-e (lasts-for (K ((num 2) (plur hour))))) [John sleep]).",
        "Like during, lasts-for is a 2-place predicate.",
        "Here it has been applied to a term (K...), leaving a 1-place predicate.",
        "Just as in the case of (during Yesterday), the deindexed LF will contain a predication stating that the episode characterized by John sleeping lasts for two hours.",
        "(The details of the term (K...), denoting the abstract kind of quantity, two hours, need not concern us here.",
        "K as used here corresponds to K1 in [9, 11].)",
        "Timespan adverbials (as in \"John ran the race in two hours\") are treated in much the same way, using predicate in-span-of.",
        "The translation of cardinal and frequency adverbials involves the sentence-modifying construct (adv-f It is a predicate which applies to a collection of temporally separated episodes.",
        "It may describe the cardinality of the episodes or their frequency (i.e., their relative density), periodicity or distribution pattern.",
        "So, for instance, we have ((adv-f ((num 2) (plur episode))) [John see Movie3]) for \"John saw the movie twice,\" and ((adv-f ((attr frequent) (plur episode))) [John call Mary]) for \"John called Mary frequently.\"",
        "(num is an operator that maps numbers into predicate modifiers, and plur (' plural') is a function that maps predicates applicable to individuals into predicates applicable to collections; cf., Link [13].",
        "attr (' at-tributive') is an operator that maps predicates into predicate modifiers.)",
        "Table 1 shows lexical rules and PP and ADVL rules handling large classes of frequency adverbials, including periodic ones such as every two hours and synchronized cyclic ones such as every spring.",
        "The deindexing rule for adv-f is as follows: For it a monadic predicate, and c13 a formula, adv-f : ((adv-f ct)T 4-> [viA (MIllt Cox.0] As illustrated in Table 1, iv could take various forms.",
        "mult on the RHS side of the rule is a function that transforms sentence intensions, and is defined as follows.",
        "For n an episode, and (1) a formula,",
        "e.g., twice' = A.P2..x((adv-f ((num 2) (plur episode))) [x P]) e.g., frequently' = APAx((adv-f ((attr frequent) (plur episode))) [x P]) e.g., every two hours' = APAx((adv-f Asffs ((attr periodic) (plur episode))]",
        "Sentences (1)-(5) below illustrate the rules stated in Table 1.",
        "The (a)-parts are the English sentences, the (b)-parts their immediate indexical LFS, and the (c)-parts the deindexed ELFs.",
        "(1) should be fairly transparent at this point.",
        "(2c) says that \"some time before the utterance event, there was a 2 month-long (multi-component) episode, that consists three episodes of type `John date Mary'.\"",
        "(3c) reads similarly.",
        "(4c) reads as \"there was a 10 day-long episode that consists of periodically occurring subepisodes of type 'John take medicine', where the period was 4 hours.\"",
        "(Sc) is understood as \"at the generic",
        "present there is a collection of episodes of type 'Mary bake cake', such that during each Saturday within the time spanned by the collection,4 there is such an episode.\"",
        "(We take verbs of creation such as bake as predicate modifiers.)",
        "We emphasize again that ELFs are completely deindexed, and so allow effective inference.",
        "EPILOG [20], the computer implementation of EL, makes inferences very efficiently, based on such ELFs and world knowledge, aided by a \"time special-ist.\"",
        "For instance, given \"There is a train to Boston every two hours,\" \"A train left for Boston at 2:30,\" and appropriate axioms, EPILOG can infer that the next train would be at 4:30.5",
        "We also have a tentative account of adverbials such as consecutively and alternately, and some non-PP adverbials, but cannot elaborate within the present space limitations."
      ]
    },
    {
      "heading": "3. AN EXTENSION: TEMPORAL ADVERBIALS AND ASPECTUAL CLASS SHIFTS",
      "text": [
        "So far, we have assumed aspectual category agreement between temporal adverbials and VPs they modify.",
        "We now discuss our aspectual class system and our approach to apparent aspectual class mismatch between VPs and adverbials, based on certain aspectual class transformations.",
        "We make use of two aspectual class feature hierarchies, stativeness and boundedness as below:6",
        "By a co-occurrence restriction, factual formulas are unbounded, and telics are bounded.",
        "Statives are by default unbounded.",
        "Intuitively, a formula is bounded if the episode it characterizes terminates in a distinctive result state (result states are formally defined in [11].)",
        "This is a property we ascribe to all telic episodes as well as to some stative episodes (such as an episode of John's being ill, at the end of which he",
        "An episode lasting for a certain length of time means there is a time of that length such that the temporal projections of the time and the episode are identical.",
        "is not ill).",
        "Conversely, a formula is unbounded if the episode it characterizes does not terminate in a distinctive result state.",
        "For instance, was ill in \"John was ill when I saw him last week\" is unbounded as the sentence does not entail that John was not ill right after the described episode.",
        "However, when we say \"John was ill twice last year,\" we are talking about bounded \"ill\" episodes.7 As has been discussed by many authors (e.g., in [3, 6, 15, 17, 26, 27]), VPs and temporal adverbials may not arbitrarily combine.",
        "Normally, durative adverbials combine with unbounded VPs; cardinal and frequency adverbials with bounded VPs; and adverbials of timespan with telic VPs.",
        "Thus, for instance, Mary studied for an hour!",
        "*Mary finished the homework for a second.",
        "Mary wrote the paper in two weeks.",
        "Note, however, that we also say Mary sneezed for five rninutes.",
        "Mary stepped out of her office for five minutes.",
        "Mary was ill twice I repeatedly I every two months.",
        "The latter group of sentences show that VPs often acquire an interpretation derived from their original, primitive meaning.",
        "More specifically, when \"stative\" adverbials are applied to telic VPs, usually iteration is implied, as in the first sentence.",
        "However, in the case of the second sentence, the preferred reading is one in which the adverbial specifies the duration of the resultant episode, i.e., \"the result state of Mary's stepping out of her office\" (i.e., her being outside of her office), rather than a reading involving iteration.",
        "Next, when cardinal or frequency adverbials (i.e., \"bounded\" adverbials) are applied to unbounded-stative VPs, those VPs are interpreted as bounded-statives.",
        "Thus, the third sentence above means that the kind of episode in which Mary becomes ill and then ceases to be ill occurred twice, repeatedly, etc.",
        "To be able to accommodate such phenomena, the syntactic parts of our grammar use stat and bounded as agreement features.",
        "The semantic parts introduce, as needed, operators for aspectual class transformation such as result-state, iter (iteration), bounded, etc.",
        "(In place of iter, we may sometimes use a habitual operator, H.) Adverbials of temporal location like yesterday or last week may combine with either bounded or unbounded formulas (with unbounded ones, these imply a throughout reading; with bounded ones, a sometime during reading).",
        "For instance, in \"John left last month,\" the \"leaving\" episode took place sometime during last month, but in case of \"Mary was ill last month,\" Mary's \"ill\" episode may be either sometime during 7Semantically, stativeness and boundedness play an important role with respect to the persistence of a formula.",
        "In general, stative formulas are inward persistent (modulo granularity), and bounded formulas are outward persistent.",
        "(Polarized ones are exceptional, however.)",
        "See 1] for further discussion.",
        "8However, *Mary resembled her mother for five years, even though \"resembling\" is a typical stative VP.",
        "This indicates that compatibility between predicates and adverbials involves more than just the aspectual class compatibility; that is, pragmatics and world knowledge need to be considered.",
        "or throughout last month (corresponding to bounded and unbounded readings of the VP).",
        "Synchronized cyclic adverbials like every spring or every time!",
        "saw Mary may combine with bounded or unbounded formulas.",
        "Secondly, an application of certain temporal adverbials often induces shifts in the aspectual classes of the resultant VPs.",
        "Frequency adverbials transform bounded sentences into unbounded-stative ones, while durative adverbials normally yield bounded VPs and synchronized cyclic ones yield unbounded-statives.",
        "Thus,",
        "We now rewrite the VP adjunct rules introduced earlier to accommodate the interaction between VPs and adverbials and possible shifts in aspectual classes.9 We also show VP rules that perform aspectual class shifts.",
        "Note that aspectual class features (stat, bounded, etc.)",
        "are head features.",
        "These rules allow transitions in aspectual class and VP-adverbial combinations somewhat too liberally.",
        "We assume, however, that undesirable transitions and combinations may be ruled out on semantic grounds.",
        "We now show some additional sentences and their initial translations (with tense neglected) to illustrate the above rules.",
        "(6) a. Mary was ill twice in December b.",
        "((adv-e (during (in-time December))) ((adv-f ((num 2) (plur episode))) [Mary (bounded ill)])) (7) a. Mary received an award for three years b.",
        "((adv-e (lasts-for (K ((num 3) (plur year))))) [Mary (iter A.x(3y: [y award] [x receive y]))]) (8) a. Mary became unconscious for five minutes b.",
        "((adv-e (lasts-for (K ((num 5) (plur minute))))) [Mary (result-state (become unconscious))]) (9) a.",
        "Nobody slept for eight hours for a week b.",
        "((adv-e (lasts-for (K week))) (No x: [x person] ((adv-e (lasts-for (K ((num 8) (plur hour))))) [x sleep])))) c. ((adv-e (lasts-for (K week))) (No x: [x person] [x (iter )y((adv-e (lasts-for (K ((num 8) (plur hour))))) [y sleep]))]))) d. (No x: [x person] ((adv-e (lasts-for (K week)))",
        "(iter ),y((adv-e (lasts-for (K ((num 8) (plur hour)))))",
        "Notice that (9) has at least three readings: first, during a certain week-long event, nobody had an 8-hour snooze; second, a situation in which nobody slept regularly for 8 hours persisted for a weekl°; and third, there is no one who slept daily for 8 hours for a week.",
        "(9b), (9c) and (9d) provide these three readings (distinguished by the scope of the quantifier No and the adverbial for a week).",
        "Note now that in (9a), the inner durative adverbial for eight hours transforms the unbounded VP to a bounded one.",
        "Being another durative adverbial, however, the outer for a week requires that its argument be unbounded.",
        "This is not a problem as shown in ELFs (9b, c, d).",
        "That is, in (9b), the argument is a negated formula which is normally considered to be stative-unbounded, and in (9c) and (9d), the iter operator produces stative-unbounded formulas."
      ]
    },
    {
      "heading": "4. CONCLUSION",
      "text": [
        "Much theoretical work has been done on temporal adverbials (e.g., [4, 5, 7, 14, 16, 19]).",
        "There is also some computationally oriented work.",
        "For instance, Hobbs [8] provided simple rules for some temporal adverbials, including frequency ones.",
        "Moens and Steedman [15], among others, discussed the interaction of adverbials and aspectual categories.",
        "Our work goes further, in terms of (1) the scope of syntactic coverage, (2) interaction of adverbials with each other and with tense and aspect, (3) systematic (and compositional) transduction from syntax to logical form (with Logical-form deindexing),",
        "(4) formal interpretability of the resulting logical forms, and (5) demonstrable use of the resulting logical forms for inference.",
        "Our initial focus in the analysis of temporal adverbials has been PP-adverbials.",
        "Remaining work includes the analysis of clausal adverbials.",
        "Also, interactions with negation and aspect (perfect and progressive) have not been completely worked out.",
        "Negations of statives are statives, but negations of bounded sentences may be either bounded or unbounded (cf., \"We haven't met for three years\" versus \"I have friends I haven't met in three years\").",
        "The interaction between present perfect and multiple adverbials of temporal location also creates some subtle difficulties.",
        "E.g., in \"Mary has jogged {at dawn} {this month),\" the inner time adverbial modifies the \"jogging\" episode, while the outer one modifies the interval that contains the \"jogging\" episode as well as the utterance time.",
        "See [11] for some relevant points.",
        "Another issue that requires thought is adverbials involving implicit anaphoric referents.",
        "Consider, e.g., \"Shortly, Mary came in,\" \"John came back in ten minutes,\" and \"After three years, John proposed to Mary.\"",
        "These adverbials involve an implicit reference episode.",
        "Such implicit referents may often be identified from our tense trees, but at other times require inference.",
        "Another important remaining issue is the interaction between event nominals and frequency adjectives (along the lines of [25]).",
        "wHere, iterated sleep is understood as daily sleep – something that must be determined by pragmatics."
      ]
    }
  ]
}
