{
  "info": {
    "authors": [
      "Jon Oberlander"
    ],
    "book": "Workshop on Intentionality and Structure in Discource Relations",
    "id": "acl-W93-0226",
    "title": "Intentions, Information, And Inference: Two Rhetorical Questions",
    "url": "https://aclweb.org/anthology/W93-0226",
    "year": 1993
  },
  "references": [
    "acl-E93-1031",
    "acl-J86-3001",
    "acl-J92-4007",
    "acl-P91-1008"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Moore and Pollack [1992:540], following Grosz and Sidner [1986:201] point to the possibility that interpreters can often infer intentional relations from informational relations, and vice versa.",
        "I originally intended to explore the nature of these inferences in the framework of SDRT and DICE, and show how they go through in some cases, but not in others.'",
        "The details of this modelling turn out to be interesting, but not wholely surprising.",
        "I will therefore take the inference-based model for granted, and pose instead two rhetorical questions that arose when working it out.",
        "The questions are: first, when is an intentional relation not an intentional relation?",
        "And secondly, when is an informational relation not an informational relation?"
      ]
    },
    {
      "heading": "2 A question of intention",
      "text": [
        "(2) a.. Betjeman writes agreeably in praise of buttered toast and railway stations, b. and became a best seller almost By Appointment c. after Princess Margaret said she liked his verse.",
        "Which relations hold between the elements of (2)?",
        "If we are interested in the domain of time and causality, the informational relations are easy enough: the eventuality of (2a.)",
        "temporally overlaps with those of both (2b) and (2c); (210 event temporally succeeds (2c)'s, and is caused by it.",
        "But which intentional relations hold between them?",
        "In Lascarides and Oberlander [1993], we analysed the presuppositional behaviour of temporal connectives like after, and proposed a model in which subordinate clauses like (2() are accommodated via discourse attachment.",
        "As usual, various defeasible inferences go through, and the conclusion is that the following discourse relations hold between the sDR.ss: Backgroultd(2a., 2c), Narration(2c, 2b), and Result(2c, 21)).",
        "Notice: the inference process delivers not one but Iwo discourse relations holding between (2b) and (2c).",
        "So it seems that we have gone a. step further than Moore and Pollack: we not only agree with their MuItilcyci claim; we also go on to make a. MuItirdation more than one intentional-level relation can simultaneously hold between two discourse segments.",
        "In response, one could invent a. new discourse relation, Narration'nfResult, which would hold in just these cases.",
        "But its lack of independent motiva.tion, and its resemblance to Knott and Dale's [1992:7] inform-accident-and-mention-fruit relation is undermining.",
        "Alternately, one could argue that the multiplicity of discourse relations arises because we already have too many intentional relations, rather than too few.",
        "On this account, we should dipose of (say) Result, and make do with the intentional relation Narration, and various informational relations, like cause, to cover the cases.",
        "There is something to be said for this view, but I won't say it here.",
        "Rather, I would defend the Multirelation claim by observing that it is the nal ural concomitant of the multiple intentions served by single segments of discourse.",
        "We entertain as well as describe; impress as well as convince.",
        "Grosz and Sidner [1986:178] point out that the assumption that each segment has but one purpose will \"in the end prove too strong\".",
        "So segments serve multiple orthogonal goals; and this means that a segment.",
        "may fall into multiple relationships, even with a single other segment.",
        "Thus, it should be no surprise that a discourse structure theory catt deliver I 11(tre than one intentional relation holding between two discourse segments.",
        "Indeed, on this story, it.",
        "is much more surprising that some theories do not."
      ]
    },
    {
      "heading": "3 A question of information",
      "text": [
        "(3) This may seem to carry the implication that the knowledge in question is acquired without",
        "observation.",
        "The fact, if it be a fact, that I take longer steps left foot forward would not have any bearing on the care with which I might investigate the matter; I might make my measurements carelessly and get the wrong answer.",
        "But where I intend something it seems to be guaranteed that I could not get a wrong answer, so it seems as though we must know our own intentions independently of observation.",
        "[LOB G63:96-103]",
        "(4) a.",
        "But where I intend something b. it seems to be guaranteed that I could not get a. wrong answer, c. so it seems as though we must know our own intentions independently of observation.",
        "Which intentional relations hold between (4b) and (4c)?",
        "(This datum is a. real-tile version of Moore and Pollack's Bush example.)",
        "The straightforward answer appears to be: Consequence(41), 4c) and Background(4b, 4c) (cf. Oberlander [1993]).",
        "The Consequence relation is an evidential relation, in which the first-mentioned segment is taken to supply evidence for the second-mentioned segment.",
        "It's a different relation from Evidence, because the direction of evidential support is reversed.",
        "Now: suppose that, like the original Bush example, our Incorrigible example lacked the explicit connective so.",
        "What difference would this make?",
        "The answer is: we would lose the clue as to which of (4b) and (4c) was the directive part (cf. Elhadad [1992:204], who adapting Halliday, distinguishes between directive and subordinate segments).",
        "Thus, even with exactly the same causal structure beneath it, the argument could be inverted: we could be mentioning (4c) to provide evidence for (4b), rather than vice versa.",
        "But Own, would the argument be inverted?",
        "In Grosz and Sidner [1986:201], there is an equivalence between the informational relation supports and the intentional relation Dominates.",
        "Under DICE'S inference regime, the flip between Consequence and Evidence tracks the flip in the direction of supports.",
        "But bow can a domain relation like supports \"change direction\"?",
        "We agree that it's \"not implica-tion\"; but it's not even just defeasible implication.",
        "It's like implication, in that it concerns transfer of degrees of belief; but unlike most implications, there need be nothing \"out there\" to make one direction right, and the other wrong.",
        "A speaker and hearer may differ as to whether p causes q or vice versa.",
        "Only one of them will be right on each occasion.",
        "But if they differ as to whether p supports q, they can both be right; it just depends on their individual networks of prior beliefs.",
        "And if this is so, supports is not an informational – domain--relation on a. par with causes.",
        "If it is a domain relation, a. theory of discourse structure must establish which domain it's a relation on."
      ]
    },
    {
      "heading": "4 Rhetorical Answers",
      "text": [
        "Q1 When is an intentional relation not au intentional relation?"
      ]
    },
    {
      "heading": "5 References",
      "text": []
    }
  ]
}
