{
  "info": {
    "authors": [
      "Gary G. Hendrix",
      "William H. Lewis"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P81-1035",
    "title": "Transportable Natural-Language Interfaces to Databases",
    "url": "https://aclweb.org/anthology/P81-1035",
    "year": 1981
  },
  "references": [],
  "sections": [
    {
      "heading": "I INTRODUCTION",
      "text": [
        "Over the last few years a number of application systems have been constructed that allow users to access databases by posing questions in natural languages, much as English.",
        "When used in the restricted domains for which they have been especially designed, these systems have achieved reasonably high levels of performance.",
        "Such systems as LADDER [2], PLANES [10], ROBOT [1], and REL [9] require the encoding of knowledge about the domain of application in such constructs as database schemata, lexicons, pragmatic grammars, and the like.",
        "The creation of these data structures typically requires considerable effort on the part of a computer professional who has had special training in computational linguistics and the use of databases.",
        "Thus, the utility of these systems is severely limited by the high cost involved in developing an interface to any particular database.",
        "This paper describes initial work on a methodology for creating natural-language processing capabilities for new domains without the need for intervention by specially trained experts.",
        "Our approach is to acquire logical schemata and lexical information through simple interactive dialogues with someone who is familiar with the form and content of the database, but unfamiliar with the technology of natural-language interfaces.",
        "To test our approach in an actual computer environment, we have developed a prototype system called TED (Transportable English Datamanager).",
        "As a result of our experience with TED, the NL group at SRI is now undertaking the development of a much more ambitious system based on the same philosophy [4]."
      ]
    },
    {
      "heading": "II RESEARCH PROBLEMS",
      "text": [
        "Given the demonstrated feasibility of language-access systems, such as LADDER, major research issues to be dealt with in achieving transportable database interfaces include the following: * Information used by transportable systems must be cleanly divided into database-independent and database-dependent portions."
      ]
    },
    {
      "heading": "* Knowledge representations must be",
      "text": [
        "established for the database-dependent part in such a way that their form is fixed and applicable to all databases and their content readily acquirable.",
        "* Mechanisms must be developed to enable the system to acquire, information about a particular application from nonlinguists."
      ]
    },
    {
      "heading": "III THE TED PROTOTYPE",
      "text": [
        "We have developed our prototype system (TED) to explore one possible approach to these problems.",
        "In essence, TED is a LADDER-like natural-language processing system for accessing databases, combined with an \"automated interface expert\" that interviews users to learn the language and logical structure associated with a particular database and that automatically tailors the system for use with the particular application.",
        "TED allows users to create, populate, and edit their own new local databases, to describe existing local databases, or even to describe and subsequently access heterogeneous (as in OD distributed databases.",
        "Most of TED is based on and built from components of LADDER.",
        "In particular, TED uses the LIFER parser and its associated support packages [3], the SODA data access planner [5], and the PAN file access manager [6].",
        "All of these support packages are independent of the particular database used.",
        "In LADDER, the data structures used by these components were hand-generated for a particular database by computer scientists.",
        "In TED, however, they are created by TED's automated interface expert.",
        "Like LADDER, TED uses a pragmatic grammar; but TED's pragmatic grammar does not make any assumptions about the particular database being accessed.",
        "It assumes only that interactions with the system will concern data access or update, and that information regarding the particular database will be encoded in data structures of a prescribed form, which are created by the automated interface expert.",
        "The executive level of TED accepts three kinds of input: questions stated in English about the data in files that have been previously described to the system; questions posed in the SODA query language; single-word commands that Initiate dialogues with the automated interface expert."
      ]
    },
    {
      "heading": "IV THE AUTOMATED INTERFACE EXPERT",
      "text": []
    },
    {
      "heading": "A. Philosophy",
      "text": [
        "TED's mechanism for acquiring information about a particular database application is to conduct interviews with users.",
        "For such interviews to be successful, The work reported herein was supported by the Advanced Research Projects Agency of the Department of Defense under contracts N00039-79-C-0118 and N00039-80-C-0645 with the Naval Electronic Systems Command.",
        "The views and conclusions contained in this document are those of the authors and should not be interpreted as representative of the official policies, either expressed or implied, of the Defense Advanced Research Projects Agency of the U.S. Government.",
        "* There must be a range of readily understood questions that elicit all the information needed about a new database.",
        "* The questions must be both brief and easy to understand.",
        "* The system must appear coherent, eliciting required information in an order comfortable to the user.",
        "* The system must provide substantial assistance, when needed, to enable a user to understand the kinds of responses that are expected.",
        "All these points cannot be covered herein, but the sample transcript shown at the end of this paper, in conjunction with the following discussion, suggests the manner of our approach.",
        "B.",
        "Strategy A key strategy of TED is to first acquire information about the structure of files.",
        "Because the semantics of files is relatively well understood, the system thereby lays the foundation for subsequently acquiring information about the linguistic constructions likely to be used in questions about the data contained in the file.",
        "One of the single – word commands accepted by the TED executive system is the command NEW, which initiates a dialogue prompting the user to supply information about the structure of a new data file.",
        "The NEW dialogue allows the user to think of the file as a table of information and asks relatively simple questions about each of the fields (columns) in the file (table).",
        "For example, TED asks for the heading names of the columns, for possible synonyms for the heading names, and for information about the types of values (numeric, Boolean, or symbolic) that each column can contain.",
        "The heading names generally act like relational nouns, while the information about the type of values in each column provides a clue to the column's semantics.",
        "The heading name of a symbolic column tends to be the generic name for the class of objects referred to by the values of that column.",
        "Heading names for Boolean columns tend to be the names of properties that database objects can possess.",
        "If a column contains numbers, this suggests that there may be some scale with associated adjectives of degree.",
        "To allow the system to answer questions requiring the integration of information from multiple files, the user is also asked about the interconnections between the file currently being defined and other files described previously.",
        "C. Examples from a Transcript In the sample transcript at the end of this paper, the user initiates a NEW dialogue at Point A.",
        "The automated interface expert then takes the initiative in the conversation, asking first for the name of the new file, then for the names of the file's fields.",
        "The file name will be used to distinguish the new file from others during the acquisition process.",
        "The field names are entered into the lexicon as the names of attributes and are put on an agenda so that further questions about the fields may be asked subsequently of the user.",
        "At this point, TED still does not know what type of objects the data in the new file concern.",
        "Thus, as its next task, TED asks for words that might be used as generic names for the subjects of the file.",
        "Then, at Point E, TED acquires information about how to identify one of these subjects to the user and, at Point F, determines what kinds of pronouns might be used to refer to one of the subjects.",
        "(As regards ships, TED is fooled, because ships may be referred to by \"she.\")",
        "TED is programmed with the knowledge that the identifier of an object must be some kind of name, rather than a numeric quantity or Boolean value.",
        "Thus, TED can assume a priori that the NAME field given in Interaction E is symbolic in nature.",
        "At Point G, TED acquires possible synonyms for NAME.",
        "TED then cycles through all the other fields, acquiring information about their individual semantics.",
        "At Point H, TED asks about the CLASS field, but the user doesn't understand the question.",
        "By typing a question mark, the user causes TED to give a more detailed explanation of what it needs.",
        "Every question TED asks has at least two levels of explanation that a user may call upon for clarification.",
        "For example, the user again has trouble at J, whereupon he receives an extended explanation with an example.",
        "See T also.",
        "Depending upon whether a field is symbolic, arithmetic or Boolean, TED makes different forms of entries in its lexicon and seeks to acquire different types of information about the field.",
        "For example, as at Points J, K and Y, TED asks whether symbolic field values can be used as modifiers (usually in noun – noun combinations).",
        "For arithmetic fields, TED looks for adjectives associated with scales, as is illustrated by the sequence OPqR.",
        "Once TED has a word such as OLD, it assumes MORE OLD, OLDER and OLDEST may also be used.",
        "(GOOD – BETTER – BEST requires special intervention.)",
        "Note the aggressive use of previously acquired information in formulating new questions to the user (as in the use of AGE, and SHIP at Point P).",
        "We have found that this aids considerably in keeping the user focused on the current items of interest to the system and helps to keep interactions brief.",
        "Once TED has acquired local information about a new file, it seeks to relate it to all known files, including the new file itself.",
        "At Points Z through &+, TED discovers that the *SHIP* file may be joined with itself.",
        "That is, one of the attributes of a ship is yet another ship (the escorted ship), which may itself be described in the same file.",
        "The need for this information is illustrated by the query the user poses at Point G+.",
        "To better illustrate linkages between files, the transcript includes the acquisition of a second file about ship classes, beginning at Point J+.",
        "Much of this dialogue is omitted but, at L+, TED learns there is a link between the *SHIP* and *CLASS* files.",
        "At M+ it learns the direction of",
        "this link; at N+ and 0+ it learns the fields upon which the join must be made; at P+ it learns the attributes inherited through the link.",
        "This intonation is used, for example, in answering the query at S+.",
        "TED converts the user's question \"What is the speed of the hod?\"",
        "into \"What is the speed of the class whose CNAME is equal to the CLASS of the hoe!?.\"",
        "Of course, the whole purpose of the NEW dialogues is to make it possible for users to ask questions of their databases in English.",
        "Examples of English inputs accepted by TED are shown at Points E+ through I+, and S+ and T+ in the transcript.",
        "Note the use of noun – noun combinations, superlatives and arithmetic.",
        "Although not illustrated, TED also supports all the available LADDER facilities of ellipsis, spelling correction, run – time grammar extension and introspection."
      ]
    },
    {
      "heading": "V THE PRAGMATIC GRAMMAR",
      "text": [
        "The pragmatic grammar used by TED includes special syntactic/semantic categories that are acquired by the NEW dialogues.",
        "In our actual implementation, these have rather awkward names, but they correspond approximately to the following: * <GENERIC> is the category for the generic names of the objects in files.",
        "Lexical properties for this category include the name of the relevant file(s) and the names of the fields that can be used to identify one of the objects to the user.",
        "See transcript Points D and E. * <ID.VALUE> is the category for the identifiers of subjects of individual records (i.e., key – field values).",
        "For example, for the *SHIP* file, it contains the values of the NAME field.",
        "See transcript Point E. * <MOD.VALUE> is the category for the values of database fields that can serve as modifiers.",
        "See Points J and K. * <NUM.ATTR>, <SYM.ATTR>, and <BOOL.ATTR> are numeric, symbolic and Boolean attributes, respectively.",
        "They include the names of all database fields and their synonyms.",
        "* <+NUM.ADJ> is the category for adjectives (e.g. OLD) associated with numeric fields.",
        "Lexical properties include the name of the associated field and files, as well as information regarding whether the adjective is associated with greater (as in OLD) or lesser (as in YOUNG) values in the field.",
        "See Points P, Q and R."
      ]
    },
    {
      "heading": "* <COHP.ADJ> and <SUPERLATIVE> are derived from ONUM.ADJ>.",
      "text": [
        "Shown below are some illustrative pragmatic production rules for nonlexical categories.",
        "As in the foregoing examples, these are not exactly the rules used by TED, but they do convey the nature of the approach.",
        "<S> – > <PRESENT> THE <ATTR> OF <ITEM> what is the age of the reeves HOW <+NUM.ADJ> <BE> <ITEM> how old is the youngest ship <WHDET> <ITEM> <RAVE> <FEATURE> what leahy ships have a doctor <WHDET> <ITEM> <BE> <COMPLEMENT> which ships are older than reeves"
      ]
    },
    {
      "heading": "<COMP.ADJ> THAN <NUMBER>",
      "text": [
        "These pragmatic grammar rules are very much like the ones used in LADDER [2], but they differ from those of LADDER in two critical ways.",
        "(1) They capture the pragmatics of accessing databases without forcibly including information about the pragmatics of any one particular set of data.",
        "(2) They use syntactic/semantic categories that support the processes of accessing databases, but that are domain – independent and easily acquirable.",
        "It is worth noting that, even when a particular application requires the introduction of special – purpose rules, the basic pragmatic grammar used by TED provides a starting point from which domain – specific features can be added."
      ]
    },
    {
      "heading": "VI DIRECTIONS FOR FURTHER WORK",
      "text": [
        "The TED system represents a first step toward truly portable natural – language interfaces to database systems.",
        "TED is only a prototype, however, and much additional work will be required",
        "to provide adequate syntactic and conceptual coverage, as well as to increase the ease with which systems may be adapted to new databases.",
        "A severe limitation of the current TED system is its restricted range of syntactic coverage.",
        "For example, TED deals only with the verbs BE and HAVE, and does not know about units (e.g., the Waddel's age is 15.5, not 15.5 YEARS).",
        "To remove this limitation, the SRI NL group is currently adapting Jane Robinson's extensive DIAGRAM grammar [7] for use in a successor to TED.",
        "In preparation for the latter, we are experimenting with verb acquisition dialogues such as the following: > VERB Please conjugate the verb (e.g. fly flew flown) > EARN EARNED EARNED EARN is:"
      ]
    },
    {
      "heading": "1 intransitive (John dines) 2 transitive (John eats dinner) 3 ditransitive (John cooks Mary dinner) (Choose the most general pattern) > 2",
      "text": [
        "who or what is EARNED?",
        ">a SALARY who or what EARNS A SALARY?",
        "> AN EMPLOYEE can A SALARY be EARNED by AN EMPLOYEE?",
        "> YES can A SALARY EARN?",
        "> can AN EMPLOYEE EARN?",
        "> 22 Ok., an EMPLOYEE can EARN a SALARY What database field identifies an EMPLOYEE?",
        "> NAME What database field identifies a SALARY?",
        "> SALARY The greatest challenge to extending systems like TED is to increase their conceptual coverage.",
        "As pointed out by Tennant [8], users who are accorded natural – language access to a database expect not only to retrieve information directly stored there, but also to compute \"reasonable\" derivative information.",
        "For example, if a database has the location of two ships, users will expect the system to be able to provide the distance between them--an item of information not directly recorded in the database, but easily computed from the existing data.",
        "In general, any system that is to be widely accepted by users must not only provide access to primary information, but must also enhance the latter with procedures that calculate secondary attributes from the data actually stored.",
        "Data enhancement procedures are currently provided by LADDER and a few other hand – built systems, but work is needed now to devise means for allowing system users to specify their own database enhancement functions and to couple these with the natural – language component.",
        "A second issue associated with conceptual coverage is the ability to access information extrinsic to the database per se, such as where the data are stored and how the fields are defined, as well as information about the status of the query system itself.",
        "In summary, systems such as LADDER are of limited utility unless they can be transported to new databases by people with no significant formal training in computer science.",
        "Although the development of user – specifiable systems with extensive conceptual and syntactic coverage continues to pose a challenge to research, a polished version of the TED prototype, even with its limited coverage, would appear to have high potential as a useful tool for data access."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "> 0 au 0.",
        "•.■ 02 0 a .",
        "ou= as Ct. =C/3 a'a eV .... ott I. a. tot",
        "V .0 a oi 0 V3 pj aa It 0 a a ri7 a .",
        ".4 .1) ••••• Cr ma ...I .1.• = -.gal El 01 CA * a e o.",
        ".o = he a .1 .",
        ".",
        "0 a c.3 a a CA 34 u., ...) 0 ca V eL 4. .",
        "a O.",
        "01 C/1 U 0 •■•• .",
        "-•• .",
        "2 0 ... 0., CO .0 4.s a.. a C C a] .",
        "..a C v cx a a C 1:1 .4.1 .41 1:1 4141 .",
        "0 ..2 a a O.",
        "0) CO it Ci.",
        "0.",
        "CO .",
        "2 ..) a.",
        "4 44 ..... E. a. a .",
        "14 w 46.1 14 14 \"CI ta .",
        "V .0 al 0.",
        ".",
        "g. , .00 .",
        "a.. eo 0 ca ,-, a ai a ., 47 a c.) AC .0 42 0. vl •7 u ... -• a Cn S a 03 V a '.0a es al 0 0 00)3 0 a 31 C./ te > c.. II co C 1.1 U V .",
        "CV -.",
        "33 aCaS .a.",
        "O 0 0 ...0 .",
        "- V3 a> 4....,5.,.. 03).Caolo..Ca.",
        "- o3C.C= C .0 C .",
        "0 > 0 3.. n. 0 0.",
        ".,t ,-.",
        "... , A 03 V •-• .",
        "O. a 0 6 •-• .",
        "a .0 0 .",
        "7 .",
        "..)c 4 .",
        ".",
        "on A .",
        "2 .",
        ".",
        "0 ••••• 4 E.• r41",
        "= 0 0 it 3) t.) •30 ti .• .",
        "CA VI a) a) +.",
        ".4143 1.1 I+ 0 IA 1/1 AC 4... 14 la U 4.1 u .",
        ".. lcil dV) .",
        ": A 0 q$ * 4., 0 0 .. 114 4.)",
        "CY -CI .. a) 4)00041.00034.",
        ".3C.)",
        "0 6) .0 0 1., .0 0) U * 0 a) .0 4) 9'03 01' C°03 '-' 4)"
      ]
    },
    {
      "heading": ".0 ..c C.) .c Cl]",
      "text": [
        "CO 0 1 .",
        "1, la ).I to 44 1.1 14 41 'V a.",
        "-4 14 41 ... 3 A 4-4 H 41 A F. 41",
        "= 0 0 it 3) t.) •30 ti .• .",
        "CA VI a) a) +.",
        ".4143 1.1 I+ 0 IA 1/1 AC 4... 14 la U 4.1 u .",
        ".. lcil dV) .",
        ":"
      ]
    }
  ]
}
