{
  "info": {
    "authors": [
      "Dekai Wu"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P95-1033",
    "title": "An Algorithm for Simultaneously Bracketing Parallel Texts by Aligning Words",
    "url": "https://aclweb.org/anthology/P95-1033",
    "year": 1995
  },
  "references": [
    "acl-A94-1006",
    "acl-A94-1030",
    "acl-C94-2178",
    "acl-J90-2002",
    "acl-J93-2003",
    "acl-P91-1023",
    "acl-P92-1017",
    "acl-P93-1001",
    "acl-P94-1010",
    "acl-P94-1012",
    "acl-W93-0301",
    "acl-W93-0305"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We describe a granunarless method for simultaneously bracketing both halves of a parallel text and giving word alignments, assuming only a translation lexicon for the language pair.",
        "We introduce inversion-invariant transduction grammars which serve as generative models for parallel bilingual sentences with weak order constraints.",
        "Focusing on transduction grammars for bracketing, we formulate a normal form, and a stochastic version amenable to a maximum-likelihood bracketing algorithm.",
        "Several extensions and experiments are discussed."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Parallel corpora have been shown to provide an extremely rich source of constraints for statistical analysis (e.g., Brown et al.",
        "1990; Gale & Church 1991; Gale et al.",
        "1992; Church 1993; Brown et al.",
        "1993; Dagan et al.",
        "1993; Dagan & Church 1994; Fung & Church 1994; Wu & Xia 1994; Fung & McKeown 1994).",
        "Our thesis in this paper is that the lexical information actually gives sufficient information to extract not merely word alignments, but also bracketing constraints for both parallel texts.",
        "Aside from purely linguistic interest, bracket structure has been empirically shown to be highly effective at constraining subsequent training of, for example, stochastic context-free grammars (Pereira & Schabes 1992; Black et a/.",
        "1993).",
        "Previous algorithms for automatic bracketing operate on monolingual texts and hence require more grammatical constraints; for example, tactics employing mutual information have been applied to tagged text (Magerman & Marcus 1990).",
        "Algorithms for word alignment attempt to find the matching words between parallel sentences.'",
        "Although word alignments are of little use by themselves, they provide potential anchor points for other applications, or for subsequent learning stages to acquire more interesting structures.",
        "Our technique views word alignment 'Word matching is a more accurate term than word alignment since the matchings may cross, but we follow the literature.",
        "and bracket annotation for both parallel texts as an integrated problem.",
        "Although the examples and experiments herein are on Chinese and English, we believe the model is equally applicable to other language pairs, especially those within the same family (say Indo-European).",
        "Our bracketing method is based on a new formalism called an inversion-invariant transduction grammar.",
        "By their nature inversion-invariant transduction grammars overgenerate, because they permit too much constituent-ordering freedom.",
        "Nonetheless, they turn out to be very useful for recognition when the true grammar is not fully known.",
        "Their purpose is not to flag ungrammatical inputs; instead they assume that the inputs are grammatical, the aim being to extract structure from the input data, in kindred spirit with robust parsing."
      ]
    },
    {
      "heading": "2 Inversion-Invariant Transduction Grammars",
      "text": [
        "A transduction grammar is a bilingual model that generates two output streams, one for each language.",
        "The usual view of transducers as having one input stream and one output stream is more appropriate for restricted or deterministic finite-state machines.",
        "Although finite-state transducers have been well studied, they are insufficiently powerful for bilingual models.",
        "The models we consider here are non-deterministic models where the two lan-guages' role is symmetric.",
        "We begin by generalizing transduction to context-free form.",
        "In a context-free transduction grammar, terminal symbols come in pairs that are emitted to separate output streams.",
        "It follows that each rewrite rule emits not one but two streams, and that every non-terminal stands for a class of derivable substring pairs.",
        "For example, in the rewrite rule A --+ B x y C z/e the terminal symbols z and z are symbols of the language Ll and are emitted on stream 1, while the terminal symbol y is a symbol of the language L2 and is emitted on stream 2.",
        "This rule implies that x/y must be a valid entry in the translation lexicon.",
        "A matched terminal symbol pair such as I y is called a couple.",
        "As a special case, the null symbol c in either language means that no output",
        "token is generated.",
        "We call a symbol pair such as x/e an Li-singleton, and ely an L2-singleton.",
        "We can employ context-free transduction grammars in simple attempts at generative models for bilingual sentence pairs.",
        "For example, pretend for the moment that the simple transduction grammar shown in Figure 1 is a context-free transduction grammar, ignoring the symbols that are in place of the usual symbols.",
        "This grammar generates the following example pair of English and Chinese sentences in translation:",
        "(1) a.",
        "[I [[took [a book]Np lvp [for you]PP lvp Is b.",
        "[fit [[*7 [ – *InNp ]vp Maki, lvp Is",
        "Each instance of a non-terminal here actually derives two substrings, one in each of the sentences; these two substrings are translation counterparts.",
        "This suggests writing the parse trees together:",
        "(2) [Irfit [Rook/*7 [a/ – e/* book/V]te Iv p [for/it you/415]pp hrp Is",
        "The problem with context-free transduction grammars is that, just as with finite-state transducers, both sentences in a translation pair must share exactly the same grammatical structure (except for optional words that can be handled with lexical singletons).",
        "For example, the following sentence pair with a perfectly valid, alternative Chinese translation cannot be generated:",
        "(3) a.",
        "[I [[took [a book]Np Iv p [for you]pp ls b.",
        "[fit E[4]pp [*7 [ – *It]ip lvp ]vp Is",
        "We introduce the device of an inversion-invariant transduction grammar (IITG) to get around the inflexibility of context-free transduction grammars.",
        "Productions are interpreted as rewrite rules just as with context-free transduction grammars, with one additional proviso: when generating output for stream 2, the constituents on a rule's right-hand side may be emitted either left-to-right (as usual) or right-to-left (in inverted order).",
        "We use F--).",
        "instead of – ■ to indicate this.",
        "Note that inversion is permitted at any level of rule expansion.",
        "With this simple proviso, the transduction grammar of Figure 1 straightforwardly generates sentence-pair (3).",
        "However, the IITG's weakened ordering constraints now also permit the following sentence pairs, where some constituents have been reversed:",
        "(4) a.",
        "*R [[for you]pp bookhip tooklvp NI, Is b.",
        "[ft Hit 4tIpp [lit7 Ere ]vP Is (5) a *[[[you fodpp bookhe tooldvp lvp b.",
        "*[01 [[£64]PP [[11* – ]Np *T]vp hip Is",
        "As a bilingual generative linguistic theory, therefore, IITGs are not well-motivated (at least for most natural language pairs), since the majority of constructs do not have freely reversable constituents.",
        "We refer to the direction of a production's L2 constituent ordering as an orientation.",
        "It is sometimes useful to explicitly designate one of the two possible orientations when writing productions.",
        "We do this by distinguishing two varieties of concatenation operators on string-pairs, depending on the orientation.",
        "The operator [ ] performs the \"usual\" pairwise concatenation so that [AB] yields the string-pair (C'i , GO where Cj = A th and C2 = A2B2.",
        "But the operator () concatenates constituents on output stream 1 while reversing them on stream 2, so that C1 = A1 B1 but C2 = B2A2.",
        "For example, the NP Det Class NN rule in the transduction grammar above actually expands to two standard rewrite rules:"
      ]
    },
    {
      "heading": "NP – • [Det Class NN] NP (Det Class NN)",
      "text": [
        "Before turning to bracketing, we take note of three lemmas for BTUs (proofs omitted):"
      ]
    },
    {
      "heading": "3 Bracketing Transduction Grammars",
      "text": [
        "For the remainder of this paper, we focus our attention on pure bracketing.",
        "We confine ourselves to bracketing",
        "transduaion grammars (BTGs), which are IITGs where constituent categories are not differentiated.",
        "Aside from the start symbol S. BTGs contain only one non-terminal symbol, A, which rewrites either recursively as a string of A's or as a single terminal-pair.",
        "In the former case, the productions has the fonn A Af where we use Af to abbreviate A. .",
        ".",
        "A, where the fanout f denotes the number of A's.",
        "Each A corresponds to a level of bracketing and can be thought of as demarcating some unspecified kind of syntactic category.",
        "(This same \"repetitive expansion\" restriction used with standard context-free grammars and transduction grammars yields bracketing grammars without orientation invariance.)",
        "A full bracketing transduction grammar of degree f contains A productions of every fanout between 2 and f, thus allowing constituents of any length up to f. In principle, a full BTG of high degree is preferable, having the greatest flexibility to accomodate arbitrarily long matching sequences.",
        "However, the following theorem simplifies our algorithms by allowing us to get away with degree-2 BTGs.",
        "Later we will see how postprocessing restores the fanout flexibility (Section 5.2).",
        "Proof By Lemmas 1, 2, and 3, we may assume T contains only productions of the form .5' 1-■ cic, A xly, A 1-+ x/c, A ely, and A 1-4 AA .",
        ".",
        "A.",
        "For proof by induction, we need only show that any full BTG T of degree 1> 2 is equivalent to a full BTG T' of degree f-1.",
        "It suffices to show that the production A 1--* Af can be removed without any loss to the generated language, i.e., that the remaining productions in T' can still derive any string-pair derivable by T (removing a production cannot increase the set of derivable string-pairs).",
        "Let (E , C) be any string-pair derivable from A 1-0 Af , where E is output on stream 1 and C on stream 2.",
        "Define E1 as the substring of E derived from the ith A of the production, and similarly define C1.",
        "There are two cases depending on the concatenation orientation, but (E ,C) is derivable by T' in either case.",
        "In the first case, if the derivation used was A [AI], then E = El Ef and C Cl C f .",
        "Let (E' , C') = (E1 .E1 ',C' .C1).",
        "-1).",
        "Then (E' ,C') is derivable from A 4 [A1-1], and thus (E,C) = (E'Ef ,C'Cf) is derivable from A 4 [A A].",
        "In the second case, the derivation used was A -■ (Al), and we still have E = El .",
        ".E1 but now C = Cf .",
        ".",
        ".C1.",
        "Now let (E' ,C\") =",
        "(E1 Ef -1, Cf 1 .C').",
        "Then (E' ,C\") is derivable from A (Al - 1), and thus (E, C) (E'E', C/ C\") is derivable from A -+ (A A).",
        "0"
      ]
    },
    {
      "heading": "4 Stochastic Bracketing Transduction Grammars",
      "text": [
        "In a stochastic BTG (SBTG), each rewrite rule has a probability.",
        "Let af denote the probability of the A-production with fanout degree f. For the remaining (lexical) productions, we use b(x, y) to denote /IA x I ylAj.",
        "The probabilities obey the constraint that",
        "For our experiments we employed a normal form transduction grammar, so cv = 0 for all f 0 2.",
        "The A-productions used were:",
        "The b(x, y) distribution actually encodes the English-Chinese translation lexicon.",
        "As discussed below, the lexicon we employed was automatically learned from a parallel corpus, giving us the b(x , y) probabilities directly.",
        "The latter two singleton forms permit any word in either sentence to be unmatched.",
        "A small c-constant is chosen for the probabilities b(x , c) and b(e, y), so that the optimal bracketing resorts to these productions only when it is otherwise impossible to match words.",
        "With BTGs, to parse means to build matched bracket-ings for sentence-pairs rather than sentences.",
        "This means that the adjacency constraints given by the nested levels must be obeyed in the bracketings of both languages.",
        "The result of the parse gives bracketings for both input sentences, as well as a bracket alignment indicating the corresponding brackets between the sentences.",
        "The bracket alignment includes a word alignment as a byproduct.",
        "Consider the following sentence pair from our corpus:",
        "(6) a.",
        "The Authority will be accountable to the Fman-cial Secretary.",
        "b. iggnIfill161#413CA A*0",
        "Assume we have the productions in Figure 2, which is a fragment excerpted from our actual BTG.",
        "Ignoring capitalization, an example of a valid parse that is consistent with our linguistic ideas is: (7) [[[ The/e Authority/r, ITRir ] [ will/44* ([ be/E accountable/Art ] [to/If] [the\"( [[ Financial/itta Secretary/A ]]]])]] J. ]",
        "Figure 3 shows a graphic representation of the same bracketing, where the () level of bracketing is marked by the horizontal line.",
        "The English is read in the usual depth-first left-to-right order, but for the Chinese, a horizontal line means the right subtree is traversed before the left.",
        "The () notation concisely displays the common structure of the two sentences.",
        "However, the bracketing is clearer if we view the sentences monolingually, which allows us to invert the Chinese constituents within the () so that only H brackets need to appear:",
        "(8) a.",
        "[[[ The Authority] [ will a be accountable ] [ to [ the [[ Financial Secretary MB]] . ]",
        "b.",
        "[ [ [ [ /gf If Na ] [ tif* [[If] EE Met ffl BB [ A* BB .",
        "l",
        "In the monolingual view, extra brackets appear in one language whenever there is a singleton in the other language.",
        "If the goal is just to obtain brackets for monolingual sentences, the extra brackets can be discarded after parsing: (9) [[[ irgifi ] [I* [ itd [ Mk M B [:I ill .",
        "l The basis of the bracketing strategy can be seen as choosing the bracketing that maximizes the (probabilistically weighted) number of words matched, subject to the BTG representational constraint, which has the effect of limiting the possible crossing patterns in the word alignment.",
        "A simpler, related idea of penalizing distortion from some ideal matching pattern can be found in the statistical translation (Brown et al.",
        "1990; Brown et al.",
        "1993) and word alignment (Dagan et al.",
        "1993; Dagan & Church 1994) models.",
        "Unlike these models, however, the BTG aims to model constituent structure when determining distortion penalties.",
        "In particular, crossings that are consistent with the constituent tree structure are not penalized.",
        "The implicit assumption is that core arguments of frames remain similar across languages, and that core arguments of the same frame will surface adjacently.",
        "The accuracy of the method on a particular language pair will therefore depend upon the extent to which this language universals hypothesis holds.",
        "However, the approach is robust because if the assumption is violated, damage will be limited to dropping the fewest possible crossed word matchings.",
        "We now describe how a dynamic-programming parser can compute an optimal bracketing given a sentence-pair and a stochastic BTG.",
        "In bilingual parsing, just as with ordinary monolingual parsing, probabilizing the grammar",
        "permits ambiguities to be resolved by choosing the maximum likelihood parse.",
        "Our algorithm is similar in spirit to the recognition algorithm for HMMs (Viterbi 1967).",
        "Denote the input English sentence by e1,... , eT and the corresponding input Chinese sentence by , • , As an abbreviation we write e,.•t for the sequence of words e,44, es+2, • • .",
        ", et, and similarly for .",
        "Let tu v = max P[e,..tleu..v1 be the maximum probability of any derivation from A that successfully parses both substrings e,..t and cu..,, .",
        "The best parse of the sentence pair is that with probability 60,T,O,V • The algorithm computes 60,T,O,V following the recurrences below.",
        "The time complexity of this algorithm is 03(T3 V2) where T and V are the lengths of the two sentences.",
        "of the parse tree, initially set qi = (0, T, 0,V) to be the root.",
        "The remaining descendants in the optimal parse tree are then given recursively for any q (s, t, u, v) by:",
        "Several additional extensions on this algorithm were found to be useful, and are briefly described below.",
        "Details are given in Wu (1995).",
        "2We are generalizing argmax as to allow arg to specify the index of interest"
      ]
    },
    {
      "heading": "4.1 Simultaneous segmentation",
      "text": [
        "We often find the same concept realized using different numbers of words in the two languages, creating potential difficulties for word alignment; what is a single word in English may be realized as a compound in Chinese.",
        "Since Chinese text is not orthographically separated into words, the standard methodology is to first preprocess input texts through a segmentation module (Chiang et al.",
        "1992; Lin et al.",
        "1992; Chang & Chen 1993; Lin et al.",
        "1993; Wu & Tseng 1993; Sproat et al.",
        "1994).",
        "However, this seriously degrades our algorithm's performance, since the the segmenter may encounter ambiguities that are unresolvable monolingually and thereby introduce errors.",
        "Even if the Chinese segmentation is acceptable monolingually, it may not agree with the division of words present in the English sentence.",
        "Moreover, conventional compounds are frequently and unpredictably missing from translation lexicons, and this can further degrade performance.",
        "To avoid such problems we have extended the algorithm to optimize the segmentation of the Chinese sentence in parallel with the bracketing process.",
        "Note that this treatment of segmentation does not attempt to address the open linguistic question of what constitutes a Chinese \"word\".",
        "Our definition of a correct \"segmentation\" is purely task-driven: longer segments are desirable if and only if no compositional translation is possible."
      ]
    },
    {
      "heading": "4.2 Pre/post-positional biases",
      "text": [
        "Many of the bracketing errors are caused by singletons.",
        "With singletons, there is no cross-lingual discrimination to increase the certainty between alternative bracketings.",
        "A heuristic to deal with this is to specify for each of the two languages whether prepositions or postpositions are more common, where \"preposition\" here is meant not in the usual part-of-speech sense, but rather in a broad sense of the tendency of function words to attach left or right.",
        "This simple strategem is effective because the majority of unmatched singletons are function words that lack counterparts in the other language.",
        "This observation holds assuming that the translation lexicon's coverage is reasonably good.",
        "For both English and Chinese, we specify a prepositional bias, which means that singletons are attached to the right whenever possible."
      ]
    },
    {
      "heading": "4.3 Punctuation constraints",
      "text": [
        "Certain punctuation characters give strong constituency indications with high reliability.",
        "\"Perfect separators\", which include colons and Chinese full stops, and \"perfect delimiters\", which include parentheses and quotation marks, can be used as bracketing constraints.",
        "We have extended the algorithm to precluded hypotheses that are inconsistent with such constraints, by initializing those entries in the DP table corresponding to illegal sub-hypotheses with zero probabilities.",
        "These entries are blocked from recomputation during the DP phase.",
        "As their probabilities always remain zero, the illegal bracketings can never participate in any optimal bracketing."
      ]
    },
    {
      "heading": "5 Postprocessing",
      "text": []
    },
    {
      "heading": "5.1 A Singleton-Rebalancing Algorithm",
      "text": [
        "We now introduce an algorithm for further improving the bracketing accuracy in cases of singletons.",
        "Consider the following bracketing produced by the algorithm of the previous section: (10) aThek [[Authority/) Ode accountable/] [to thek [e/rig [Financial/gta Secretary/M ]]1)1111./0] The prepositional bias has already correctly restricted the singleton \"me/f\" to attach to the right, but of course \"The\" does not belong outside the rest of the sentence, but rather with \"Authority\".",
        "The problem is that singletons have no discriminative power between alternative bracket matchings – they only contribute to the ambiguity.",
        "However, we can minimize the impact by moving singletons as deep as possible, closer to the individual word they precede or succeed, by widening the scope of the brackets immediately following the singleton.",
        "In general this improves precision since wide-scope brackets are less constraining.",
        "The algorithm employs a rebalancing strategy rem-niscent of balanced-tree structures using left and right rotations.",
        "A left rotation changes a (A(BC)) structure to a ((AB)C) structure, and vice versa for a right rotation.",
        "The task is complicated by the presence of both [] and () brackets with both L1- and L2-singletons, since each combination presents different interactions.",
        "To be legal, a rotation must preserve symbol order on both output streams.",
        "However, the following lemma shows that any subtree can always be rebalanced at its root if either of its children is a singleton of either language.",
        "Lemma 4 Let x be a L1 singleton, y be a L2 singleton, and A, B,C be arbitrary constituent subtrees.",
        "Then the following properties hold for the [l and () operators:",
        "The method of Figure4 modifies the input tree to attach singletons as closely as possible to couples, but remaining consistent with the input tree in the following sense: singletons cannot \"escape\" their immediately surrounding brackets.",
        "The key is that for any given subtree, if the outermost bracket involves a singleton that should be rotated into a subtree, then exactly one of the singleton rotation properties will apply.",
        "The method proceeds depth-first, sinking each singleton as deeply as possible.",
        "For example, after rebalancing, sentence (10) is bracketed as follows:",
        "(11) a [[Tixie Authority/* Re] ( @de",
        "accountable/OA] [to thek WO) [Financial/Mt Secretary/ M I]]M] J0 ]"
      ]
    },
    {
      "heading": "5.2 Flattening the Bracketing",
      "text": [
        "Because the BTG is in normal form, each bracket can only hold two constituents.",
        "l'his improves parsing efficiency, but requires overconunitment since the algorithm is always forced to choose between (A(BC)) and ((AB)C) structures even when no choice is clearly better.",
        "In the worst case, both sentences might have perfectly aligned words, lending no discriminative leverage whatsoever to the bracketer.",
        "This leaves a very large number of choices: if both sentences are of length I = m, then there are (3) possible bracketings with fanout 2, none of which is better justified than any other.",
        "Thus to improve accuracy, we should reduce the specificity of the bracketing's commitment in such cases.",
        "We implement this with another postprocessing stage.",
        "The algorithm proceeds bottom-up, eliminating as many brackets as possible, by making use of the associativity equivalences [ABC] [A[BC]] [[AB]C] and",
        "(ABC) .= (A(BC)) ((AB)C).",
        "The singleton bidirectionality and flipping commutativity equivalences (see Lemma 4) are also applied, whenever they render the associativity equivalences applicable.",
        "The final result after flattening sentence (11) is as follows:"
      ]
    },
    {
      "heading": "6 Experiments",
      "text": [
        "Evaluation methodology for bracketing is controversial because of varying perspectives on what the \"gold stan-dard\" should be.",
        "We identify two prototypical positions, and give results for both.",
        "One position uses a linguistic evaluation criterion, where accuracy is measured against some theoretic notion of constituent structure.",
        "The other position uses a functional evaluation criterion, where the \"correctness\" of a bracketing depends on its utility with respect to the application task at hand.",
        "For example, here we consider a bracket-pair functionally useful if it correctly identifies phrasal translations – especially where the phrases in the two languages are not compositionally derivable solely from obvious word translations.",
        "Notice that in contrast, the linguistic evaluation criterion is insensitive to whether the bracketings of the two sentences match each other in any semantic way, as long as the monolingual bracketings in each sentence are correct.",
        "In either case, the bracket precision gives the proportion of found brackets that agree with the chosen correctness criterion.",
        "All experiments reported in this paper were performed on sentence-pairs from the HKUST English-Chinese Parallel Bilingual Corpus, which consists of governmental transcripts (Wu 1994).",
        "The translation lexicon was automatically learned from the same corpus via statistical sentence alignment (Wu 1994) and statistical Chinese word and collocation extraction (Fung & Wu 1994; Wu & Fung 1994), followed by an EM word-translation learning procedure (Wu & Xia 1994).",
        "The translation lexicon contains an English vocabulary of approximately 6,500 words and a Chinese vocabulary of approximately 5,500 words.",
        "The mapping is many-to-many, with an average of 2.25 Chinese translations per English word.",
        "The translation accuracy is imperfect (about 86% percent weighted precision), which turns out to cause many of the bracketing errors.",
        "Approximately 2,000 sentence-pairs with both English and Chinese lengths of 30 words or less were extracted from our corpus and bracketed using the algorithm described.",
        "Several additional criteria were used to filter out unsuitable sentence-pairs.",
        "If the lengths of the pair of sentences differed by more than a 2:1 ratio, the pair was rejected; such a difference usually arises as the result of an earlier error in automatic sentence alignment.",
        "Sentences containing more than one word absent from the translation lexicon were also rejected; the bracketing method is not intended to be robust against lexicon inadequacies.",
        "We also rejected sentence pairs with fewer than two matching words, since this gives the bracketing algorithm no discriminative leverage; such pairs accounted for less than 2% of the input data.",
        "A random sample of the bracketed sentence pairs was then drawn, and the bracket precision was computed under each criterion for correctness.",
        "Additional examples are shown in Figure 5.",
        "Under the linguistic criterion, the monolingual bracket precision was 80.4% for the English sentences, and 78.4% for the Chinese sentences.",
        "Of course, monolingual grammar-based bracketing methods can achieve higher precision, but such tools assume grammar resources that may not be available, such as good Chinese grammars.",
        "Moreover, if a good monolingual bracketer is available, its output can easily be incorporated in much the same way as punctuation constraints, thereby combining the best of both worlds.",
        "Under the functional criterion, the parallel bracket precision was 72.5%, lower than the monolingual precision since brackets can be correct in one language but not the other.",
        "Grammar-based bracketing methods cannot directly produce results of a comparable nature."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We have proposed a new tool for the corpus linguist's arsenal: a method for simultaneously bracketing both halves of a parallel bilingual corpus, using only a word translation lexicon.",
        "The method can also be seen as a word alignment algorithm that employs a realistic distortion model and aligns consituents as well as words.",
        "The basis of the approach is a new inversion-invariant"
      ]
    },
    {
      "heading": "transduction grammar formalism.",
      "text": [
        "Various extension strategies for simultaneous segmentation, positional biases, punctuation constraints, singleton rebalancing, and bracket flattening have been introduced.",
        "Parallel bracketing exploits a relatively untapped source of constraints, in that parallel bilingual sentences are used to mutually analyze each other.",
        "The model nonetheless retains a high degree of compatibility with more conventional monolingual formalisms and methods.",
        "The bracketing and alignment of parallel corpora can be fully automatized with zero initial knowledge resources, with the aid of automatic procedures for learning word translation lexicons.",
        "This is particularly valuable for work on languages for which online knowledge resources are relatively scarce compared with English."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "I would like to thank Xuanyin Xia, Eva Wai-Man Fong, Pascale Fung, and Derick Wood."
      ]
    }
  ]
}
