{
  "info": {
    "authors": [
      "Mark Hepple"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E95-1018",
    "title": "Mixing Modes of Linguistic Description in Categorial Grammar",
    "url": "https://aclweb.org/anthology/E95-1018",
    "year": 1995
  },
  "references": [
    "acl-C90-2041",
    "acl-C92-1024",
    "acl-C94-2201",
    "acl-E91-1035",
    "acl-E93-1034"
  ],
  "sections": [
    {
      "text": [
        "Email: hepple@dcs .",
        "sheff ield ac .",
        "uk"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Recent work within the field of Categorial Grammar has seen the development of approaches that allow different modes of logical behaviour to be displayed within a single system, something corresponding to making available differing modes of linguistic description.",
        "Earlier attempts to achieve this goal have employed modal operators called structural modalities, whose use presents a number of problems.",
        "I propose an alternative approach, involving coexistence and interrelation of different sub logics, that eliminates the need for structural modalities, whilst maintaining the descriptive power they provide."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Categorial Grammar formalisms consist of logics.",
        "Syntactic information (e.g. subcategorisation, word order) is encoded in complex formulas or types assigned to lexical items.",
        "Syntactic derivation is via deduction over lexical formulas.",
        "Alternative systems differ in the logics they use,1 which may be classified by their limitations on the use of 'resources' (i.e. assumptions) in deduction, and their consequent sensitivity to the specific structuring of those resources (a comparison which gives rise to the 'substructural hierarchy' of logics).",
        "In linguistic terms, such logics can be seen to implement different possible views of the nature of linguistic structure.",
        "In the past few years, categorial systems have been developed that allow access to the resource behaviour of more than one level of the substructural hierarchy.",
        "This amounts to a recognition The author also at Department of Psychology, Sheffield University.",
        "The research reported here was done largely during a year at IRCS, UPenn, with the support of an IRCS Postdoctoral Fellowship award.",
        "I would like to thank Ruth Kempson, Natasha Kurtonina, Michael Moortgat, Glyn Morrill and Yde Venema for valuable discussions of the ideas in this paper.",
        "1 For example, associative Lambek calculus (Lambek 1958), non-associative Lambek calculus (Lambek 1961), a permutative variant of associative Lambek calculus known as LP (van Benthem 1983), the 'headed' systems of Moortgat & Morrill (1991).",
        "that a full account of phenomena within a language may require use of more than one notion of linguistic structure, so that e.g. rigid treelike structures may be appropriate for one class of phenomena (binding, perhaps), whereas more flexible structures may be appropriate for another (coordination, perhaps).",
        "Consideration of cross linguistic variation strengthens the case for allowing multiple notions of structure.",
        "One approach to creating systems with mixed resource behaviour employs operators called structural modalities.",
        "In such work, a specific resource logic is selected as 'basic' for stating the grammar, thereby setting the default characteristics of resource sensitivity.",
        "Then, structural modalities are used to allow controlled access to the resource behaviour of other substructural levels.",
        "Various problems theoretical, computational and practical arise for the use of such operators.",
        "For example, where they are used extensively, unduly complicated accounts tend to result.",
        "Also, the need to have a single 'base logic' presents problems for the development of a truly general cross-linguistic framework.",
        "More recent work has seen the development of approaches that have coexistence of different sublogics within a single mixed or multimodal system.2 Moortgat Oehrle (1993;1994) and Hepple (1993) propose general approaches for combining substructural logics into multimodal systems, where 'movement between levels' (enabled by structural modalities in the earlier work) is freely allowed, provided it accords with what are seen to be 'natural relations' between the levels in terms of the relative informativeness of their descriptions.",
        "Although developed separately, these two sources propose formal systems that are in many ways similar, but, interestingly, take precisely opposing views as to what are the 'natural relations' between levels.",
        "This difference of opinion has consequences for how the systems may be used as linguistic formalisms (requiring, for ex-2Some early examples of multimodal systems are logics that have coexistence, but without interlinkage, of associative and non-associative Lambek calculus (Oehrle & Zhang 1989; Morrill 1990).",
        "Further examples include systems that combine associative Lambek calculus with special connectives for discontinuity (e.g. Morrill & Solias 1993; Hepple 1994).",
        "ample, 'additional apparatus' for handling word order in the second approach), and more crucially for the kind of linguistic accounts they allow to be formulated.",
        "In this paper, I will describe the approach taken in Hepple (1993) what I call the 'hybrid' approach, discuss the general linguistic model that it tends to foster and provide some linguistic illustration, and discuss possibilities for parsing hybrid systems.",
        "I will begin with discussion of substructural hierarchy and structural modalities, as it is the behaviour of systems with structural modalities that inspires the hybrid view of how different levels should be related.",
        "F[BoC: x]A: [x/vow].a The Identity (id) and Cut rules express the reflexivity and transitivity of the derivability relation.",
        "Each connective has a Right [R] and Left [L] rule, showing, respectively, how to prove and how to use a type containing that connective.",
        "Note that this formulation includes a system of term",
        "A can be derived from the structured configuration of antecedent formulas F. F[V] represents represents the result of replacing 4) with 4\" in r[4].",
        "labelling, whereby each type is associated with a lambda term (giving objects TYPE:term) in accordance with the well known Curry-Howard interpretation of proofs, with the consequence that complete proofs return a term that records the proof's functional or natural deduction structure.",
        "Such terms play an important role in the approach to be developed.",
        "The system of term labelling has the following features.",
        "All antecedent formulas are associated with variables.",
        "Cut inferences are interpreted via substitution (with a[b/v] representing the substitution of b for v in a).",
        "For implicational connectives, Left and Right inferences are interpreted via functional application and abstraction, respectively.",
        "A different abstraction and application operator is used for each implicational connective, so that terms fully record the proof structure.",
        "The implication 4 (resp.",
        "'L)) has application operator 7, (resp.",
        "), giving a*-0- b (resp.",
        "67; a) for 'a applied to b', and abstraction operator [7,-] (resp.",
        "[T,]), e.g.",
        "[.",
        "]v.a (resp.",
        "riv.a) for abstraction over v in a.",
        "Product Right inferences are interpreted via system specific pairing.",
        "For product Left inferences, a term such as [x/vow].a represents the substitution of x for v-Ew in a.4 We must next consider the issue of resource structure and its consequences for linguistic derivation.",
        "If we assume for the above sequent system that antecedents are (non-empty) binarily bracketted sequences of types then we have a version of the non-associative Lambek calculus (NL: Lambek 1961), where deduction is sensitive to the order and bracketting of assumptions, each of which must be used precisely once in a deduction.",
        "NL is a system whose implicit notion of linguistic structure is binary branching treelike objects, and this rigidity of structure is reflected in the type combinations that the system allows.'",
        "However, it is possible to undermine sensitivity to aspects of resource structure by inclusion of structural rules, which act to modify the structure of the antecedent configuration.",
        "For example, the following rules of Permutation ([P]) and Association GAD undermine sensitivity to the linear order and bracketting of assumptions, respectively:",
        "branching mobiles (since order is undermined only within the confines of the given bracketting).",
        "Adding [A] to NL gives a version of associative Lambek calculus (L: Lambek 1961), which views language purely in terms of strings of tokens.",
        "If both [A] and [P] are added, we have the system LP (van Benthem 1983), corresponding to a fragment of linear logic (Girard 1987), which views language in terms of unordered multisets of tokens.",
        "structural rules, whose side conditions (shown to the right) restrict their involvement to the relevant subsystems."
      ]
    },
    {
      "heading": "{0 E {e,}",
      "text": [
        "r[(c :c, B: b)]A : a [11 CRB: b, (C: c, D: d))]A: a rK(B:b, C:c), D: d)]A : a With only the rules (1,2,3), we would have a system where different substructural levels coexist, but without interrelation.",
        "Such interrelation is effected by the rule (4), which allows a bracket pair of one system (oi) to be replaced by that of another system (oi), just in case the latter's system exhibits greater freedom of resource usage (as indicated by the relation <, which orders the subsystems thus: < 1 < ) (4)l'[(B: b, C: c)3] z.",
        "A : a",
        "F[(B: b, C: c).]",
        "A: a 1<) The following proofs are for the two transformations discussed in the previous section, illustrating 'natural relations' between levels.",
        "For the result label's subterm x*i(z,B y), the directionality of applications suggests the ordering x z y. Abstraction discounts z as an 'orderable element', leaving just x 4 y, i.e. with A/B preceding CB, as we would expect.",
        "For a term x'E y, the permutativity of 0 suggests that both orderings of x and y are possible.",
        "Note however that word order determination must be sensitive to the specific modes of structuring and their properties, e.g. the non-associativity of 0 implies an 'integrity' for y, z in x',1-; (y.5 z) excluding y x z as a possible order, despite the permutativity of 0.",
        "To determine word order, a normalised proof term is first transformed to give a yield term, in which its orderable elements are structured in accordance with their original manner of combination, e.g.",
        "[(v w)I xey].",
        "(x , (v0w) Yield terms may be restructured in ways appropriate to the different operators (e.g. subterms p0q may be rewritten to q0p, etc.).",
        "Possible linear orders can simply be 'read off' the variants a yield term under restructuring, e.g. x *ET, (y`5.z) gives orders xyz and yzx, since its yield term is x0(y0z), whose only variant is (y0z)0x"
      ]
    },
    {
      "heading": "7 The linguistic model",
      "text": [
        "I noted earlier that extensive use of structural modalities tends to result in very complex analyses.",
        "This fact tends to favour the selection of stronger systems for the base level logic, a move which is associated with loss of possibly useful resource sensitivity.",
        "This problem does not arise for the hybrid approach, which freely allows us to use weaker logics for constructing lexical types that richly encode linguistic information.",
        "Consider firstly a hybrid system that includes only the two levels L and LP, of which clearly L will in general be more appropriate for linguistic description.",
        "Under the view of how levels are related that I have argued for, the linkage between these two levels is such that X0Y X.Y is a theorem, alongside which we will find also (e.g.) X/Y XoY.",
        "Note that it is the latter theorem, and its variants, that most crucially bear upon what is gained by the move to a mixed system, given that the lexical encoding of linguistic information predominantly involves the assignment of functional types.",
        "Hence, a lexical functor constructed with L connectives may be transformed to one involving LP connectives, allowing us to exploit the structural freedom of that level.'",
        "For 'Note that with the converse direction of linkage, as advanced by Moortgat Oehrle (1993), but with lexical functors still constructed using L connectives, no practical use could be made of the permutative LP level in this minimal mixed system.",
        "example, in handling extraction, a 'sentence missing NP somewhere' may be derived as sonp, as in proof B of Figure 1.",
        "Consider next a system that includes also the non-associative level NL.",
        "This additional level might be adopted as the principal one for lexical specification, giving various advantages for linguistic analysis.",
        "For example, by having a lexical element subcategorise for a complement that is some 'non-associative functor' (i.e. of the form AB or IAA), we could be sure that the complement taken was a 'natural projection' of some lexical head, and not one built by composition (or other associativity based combination).",
        "On the other hand, where the freedom of associative combination is required, it is still available, given that we have (e.g.) X9SY X/Y.",
        "Some categorial treatments of non-constituent coordination have depended crucially (either implicitly or explicitly) on associativity allowing, for example, subject and verb to be combined without other verb complements, making possible a 'like-with-like' coordination treatment of non-constituent coordination as in e.g. (i) Mary spoke and Susan whispered, to Bill (where the conjuncts are each analysed as s/pp).",
        "In a purely non-associative system, such as NL, such an analysis is excluded.",
        "In the hybrid approach, however, this treatment is still possible even with non-associative lexical types, provided coordination is done at the associative level, e.g. the conjuncts of (i) can be derived and coordinated as ship since: np, (nAs)Opp s/pp is a theorem as in (5).",
        "Furthermore, since we have also X9SY XoY, such non-associative lexical specification is still compatible with the treatment of extraction described above.",
        "It is hoped that the above simple examples of linguistic uses will serve to give a feeling for the general character of the linguistic model that the hybrid approach would favour, i.e. one with very rich lexical encoding of syntactic information, achieved using predominantly the implicational connectives of the weakest available logic, with the stronger logics of the mixed system allowing less informative (but hence also more 'flexible') descriptions of (functional) linguistic objects.",
        "The above example systems clearly do not exhaust the possibilities for 'rich lexical encoding'.",
        "For example, it seems likely that lexical assign-(5)npnpss (np, ((nAs)PP, 1313).",
        ")s",
        "ments should specify headedness or dependency information, as in the calculi of Moortgat & Morrill (1991)."
      ]
    },
    {
      "heading": "8 Parsing with hybrid grammars",
      "text": [
        "It is well known that parsing (theorem proving) with sequent formalisms suffers efficiency problems as a consequence of derivational equivalence (or 'spurious ambiguity'), i.e. from the existence of multiple proofs that assign the same meaning for a given type combination.",
        "Alternative but equivalent formalisations of the above system are possible.",
        "Hepple (1993), for example, provides a natural deduction formalisation.",
        "Such a formalisation should readily provide the basis for a chart based approach to parsing hybrid logic grammars, after the manner of existing chart methods for use with L (KOnig 1990; Hepple 1992).",
        "A further promising possibility for efficient parsing of hybrid system grammars involves proof net reformulation, following a general scheme for such reformulation described in Moortgat (1992).",
        "However, the precise character of either chart or proof net based methods for parsing hybrid system grammars is a topic requiring further research."
      ]
    },
    {
      "heading": "9 Concluding Remarks",
      "text": [
        "As noted earlier, the approach described here has strong similarities to one developed independently by Moortgat & Oehrle (1993), although they take a precisely opposing view as to what constitute the appropriate directions of linkage between levels.",
        "One consequence of this difference is to allow them a more standard treatment of word order (not requiring an enriched term labelling algebra).",
        "The most important 'practical' difference is that the differing directions of 'natural movement' will tend to foster very different linguistic accounts.",
        "We may ask which of these two contradicting views of linkage is correct.",
        "Hepple (TO APPEAR) suggests that both views are possible, and may even be compatible for realisation within a single system, further extending the possibilities for the multimodal systems that can be constructed and for their potential utility.",
        "In conclusion, I have described an approach in which different sublogics coexist and are interrelated within a single categorial system.",
        "This gives an approach which allows access to a range of different modes of characterising linguistic structure, where the specific mode of description that is used in any case can be chosen as that which is appropriate for the aspect of linguistic phenomena that is under consideration."
      ]
    }
  ]
}
